#sppContactHPInstance_el.properties
#Fri Sep 07 05:12:53 GMT 2007
description=
description_comment=The description of this Secondary Page
email_address=\u0397\u03bb\u03b5\u03ba\u03c4\u03c1\u03bf\u03bd\u03b9\u03ba\u03cc \u03c4\u03b1\u03c7\u03c5\u03b4\u03c1\u03bf\u03bc\u03b5\u03af\u03bf
email_message=\u039c\u03ae\u03bd\u03c5\u03bc\u03b1 
email_topic=\u0398\u03ad\u03bc\u03b1  
error_message=\u03a0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03b4\u03b9\u03bf\u03c1\u03b8\u03ce\u03c3\u03c4\u03b5 \u03c4\u03b1 \u03bb\u03ac\u03b8\u03b7 \u03c0\u03bf\u03c5 \u03b5\u03af\u03bd\u03b1\u03b9 \u03c4\u03bf\u03bd\u03b9\u03c3\u03bc\u03ad\u03bd\u03b1 \u03c0\u03b1\u03c1\u03b1\u03ba\u03ac\u03c4\u03c9 \u03bc\u03b5 \u03ba\u03cc\u03ba\u03ba\u03b9\u03bd\u03bf \u03c7\u03c1\u03ce\u03bc\u03b1 .
headerDescription=\u03a3\u03c5\u03bc\u03c0\u03bb\u03b7\u03c1\u03ce\u03c3\u03c4\u03b5 \u03b1\u03c5\u03c4\u03ae \u03c4\u03b7\u03bd \u03b1\u03c0\u03bb\u03ae \u03c6\u03cc\u03c1\u03bc\u03b1 \u03ba\u03b1\u03b9 \u03b8\u03b1 \u03b1\u03c0\u03b1\u03bd\u03c4\u03ae\u03c3\u03bf\u03c5\u03bc\u03b5 \u03c3\u03c4\u03b7\u03bd \u03b5\u03c1\u03ce\u03c4\u03b7\u03c3\u03b7 \u03c3\u03b1\u03c2 \u03c4\u03bf \u03c3\u03c5\u03bd\u03c4\u03bf\u03bc\u03cc\u03c4\u03b5\u03c1\u03bf \u03b4\u03c5\u03bd\u03b1\u03c4\u03cc. \u03a0\u03b1\u03c1\u03b1\u03ba\u03b1\u03bb\u03ce \u03c3\u03c5\u03bc\u03c0\u03bb\u03b7\u03c1\u03ce\u03c3\u03c4\u03b5 \u03c4\u03b7 \u03c3\u03c4\u03b1 \u03b1\u03b3\u03b3\u03bb\u03b9\u03ba\u03ac \u03ae \u03c3\u03b5 \u03ba\u03ac\u03c0\u03bf\u03b9\u03b1 \u03b1\u03c0\u03cc \u03c4\u03b9\u03c2 \u03c0\u03b1\u03c1\u03b1\u03ba\u03ac\u03c4\u03c9 \u03b3\u03bb\u03ce\u03c3\u03c3\u03b5\u03c2. \u0394\u03b9\u03b1\u03c6\u03bf\u03c1\u03b5\u03c4\u03b9\u03ba\u03ac \u03c4\u03b7\u03bb\u03b5\u03c6\u03c9\u03bd\u03b5\u03af\u03c3\u03c4\u03b5 \u03b1\u03c0\u03b5\u03c5\u03b8\u03b5\u03af\u03b1\u03c2 \u03c3\u03b5 \u03ad\u03bd\u03b1 \u03b1\u03c0\u03cc \u03c4\u03b1 \u03c0\u03b1\u03c1\u03b1\u03ba\u03ac\u03c4\u03c9 \u03c4\u03b7\u03bb\u03ad\u03c6\u03c9\u03bd\u03b1.\r\n\u0391\u03b3\u03b3\u03bb\u03b9\u03ba\u03ac: +49 7031 468 3288\r\n\u0393\u03b1\u03bb\u03bb\u03b9\u03ba\u03ac: +49 7031 468 3286\r\n\u0393\u03b5\u03c1\u03bc\u03b1\u03bd\u03b9\u03ba\u03ac: +49 7031 468 3287\r\n\u0399\u03c4\u03b1\u03bb\u03b9\u03ba\u03ac: +49 7031 468 3291\r\n\u0399\u03c3\u03c0\u03b1\u03bd\u03b9\u03ba\u03ac: +49 7031 468 3285
headerDescriptionBgColor=
headerDescriptionSuccess=\u039f\u03b9 \u03c0\u03bb\u03b7\u03c1\u03bf\u03c6\u03bf\u03c1\u03af\u03b5\u03c2 \u03c0\u03bf\u03c5 \u03c5\u03c0\u03bf\u03b2\u03ac\u03bb\u03b1\u03c4\u03b5 \u03ad\u03c7\u03bf\u03c5\u03bd \u03c0\u03b1\u03c1\u03b1\u03bb\u03b7\u03c6\u03b8\u03b5\u03af \u03ba\u03b1\u03b9 \u03b8\u03b1 \u03b5\u03bd\u03b7\u03bc\u03b5\u03c1\u03c9\u03b8\u03bf\u03cd\u03bd \u03b1\u03bd\u03b1\u03bb\u03cc\u03b3\u03c9\u03c2.\r\n\r\n\u039c\u03c0\u03bf\u03c1\u03b5\u03af \u03bd\u03b1 \u03c7\u03c1\u03b5\u03b9\u03b1\u03c3\u03c4\u03b5\u03af \u03bd\u03b1 \u03bf\u03c1\u03af\u03c3\u03bf\u03c5\u03bc\u03b5 \u03be\u03b1\u03bd\u03ac \u03c4\u03bf\u03bd \u03ba\u03c9\u03b4\u03b9\u03ba\u03cc \u03c3\u03b1\u03c2 \u03c9\u03c2 \u03bc\u03ad\u03c1\u03bf\u03c2 \u03c4\u03b7\u03c2 \u03b4\u03b9\u03b1\u03b4\u03b9\u03ba\u03b1\u03c3\u03af\u03b1\u03c2 \u03b1\u03bd\u03ac\u03bb\u03c5\u03c3\u03b7\u03c2 \u03c4\u03bf\u03c5 \u03c0\u03c1\u03bf\u03b2\u03bb\u03ae\u03bc\u03b1\u03c4\u03bf\u03c2.\r\n\r\n\u0395\u03c0\u03b9\u03bb\u03ad\u03be\u03c4\u03b5 \u03ad\u03bd\u03b1 \u03c3\u03cd\u03bd\u03b4\u03b5\u03c3\u03bc\u03bf \u03b1\u03c0\u03cc \u03c4\u03bf \u03b1\u03c1\u03b9\u03c3\u03c4\u03b5\u03c1\u03cc \u03bc\u03b5\u03bd\u03bf\u03cd \u03b3\u03b9\u03b1 \u03bd\u03b1 \u03c3\u03c5\u03bd\u03b5\u03c7\u03af\u03c3\u03b5\u03c4\u03b5 \u03bd\u03b1 \u03c7\u03c1\u03b7\u03c3\u03b9\u03bc\u03bf\u03c0\u03bf\u03b9\u03b5\u03af\u03c4\u03b5 \u03c4\u03bf Smart Portal.
headerTitle=\u0395\u03c0\u03b9\u03ba\u03bf\u03b9\u03bd\u03c9\u03bd\u03ae\u03c3\u03c4\u03b5 \u03bc\u03b5 \u03c4\u03b7\u03bd HP
headerTitleBgColor=#0066FF
headerTitleSuccess=\u03a3\u03b1\u03c2 \u03b5\u03c5\u03c7\u03b1\u03c1\u03b9\u03c3\u03c4\u03bf\u03cd\u03bc\u03b5
submitLabel=\u0398\u03ad\u03bc\u03b1  
title=\u0395\u03c0\u03b9\u03ba\u03bf\u03b9\u03bd\u03c9\u03bd\u03ae\u03c3\u03c4\u03b5 \u03bc\u03b5 \u03c4\u03b7\u03bd HP
title_comment=The title of this Secondary Page
title_omniture=
title_omniture_comment=Contact HP
