# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Katselutiedosto:
config.viewfilename.help.title=Katselutiedoston m\u00e4\u00e4ritt\u00e4minen
config.viewfilename.help.content=<p>Anna katselutiedoston kantanimi (mukaan lukien tiedostotunniste).  Esimerkiksi <code>omaKatselutiedosto.html</code>.</p><p>T\u00e4ss\u00e4 tiedostossa on sis\u00e4lt\u00f6, jonka haluat portletin n\u00e4ytt\u00e4v\u00e4n. Tiedoston on oltava olemassa.  T\u00e4m\u00e4n tiedoston on sijaittava jokaisen t\u00e4m\u00e4n klusterin portlettipalvelimessa, portletin resurssipaketin <code>html</code>-kansiossa tai sen alikansiossa.  (Tiedosto voi sijaita my\u00f6s portletin WAR-paketin <code>html</code>-kansiossa tai sen alikansiossa.)  Jos k\u00e4yt\u00e4t alikansiota, katselutiedoston nimess\u00e4 pit\u00e4\u00e4 olla kyseisen alikansion polku.  Esimerkiksi <code>tiedostot/omaKatselutiedosto.html</code>.</p><p>Tiedoston sis\u00e4lt\u00f6 pit\u00e4\u00e4 lokalisoida k\u00e4ytetylle kielelle.  Jos olet k\u00e4\u00e4nt\u00e4nyt sis\u00e4ll\u00f6n, k\u00e4\u00e4nnettyjen katselutiedostojen pit\u00e4\u00e4 olla samassa sijainnissa kuin kantakatselutiedoston ja ne pit\u00e4\u00e4 merkit\u00e4 tunnisteilla kielen mukaisesti.</p><p>Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.</p>
config.subsfilename=<contextual_help>Korvauspaikkamerkit-tiedosto</contextual_help> (valinnainen):
config.subsfilename.help.title=Korvauspaikkamerkit-tiedoston m\u00e4\u00e4ritt\u00e4minen
config.subsfilename.help.content=<p>Ellei katselutiedostosi k\u00e4yt\u00e4 <code>{INCLUDE:<i>key</i>}</code>-paikkamerkki\u00e4, t\u00e4m\u00e4n kohdan voi j\u00e4tt\u00e4\u00e4 tyhj\u00e4ksi.</p><p>Jos katselutiedostosi k\u00e4ytt\u00e4\u00e4 mainittua paikkamerkki\u00e4, kirjoita korvauspaikkamerkit-tiedoston nimi t\u00e4h\u00e4n. Esimerkiksi <code>omaKatselutiedostoSis\u00e4lt\u00e4\u00e4.ominaisuudet</code>.</p><p>T\u00e4m\u00e4 tiedosto sis\u00e4lt\u00e4\u00e4 avainarvoparit, jotka haluat portletin asettavan paikoilleen renderoidessaan <code>{INCLUDE:<i>key</i>}</code>-paikkamerkkej\u00e4 katselutiedostossasi.  Jos et anna tiedostonime\u00e4, k\u00e4ytett\u00e4v\u00e4n tiedoston oletuksena on <code>html_viewer_includes.properties</code>.</p><p>Tiedoston on sijaittava jokaisen t\u00e4m\u00e4n klusterin portlettipalvelimessa, luokkapolun kansiossa (esimerkiksi Yleiset resurssit -kansiossa). (Tiedosto voi sijaita my\u00f6s portletin WAR-paketin <code>/WEB-INF/luokat</code>-kansiossa.) Jos k\u00e4yt\u00e4t alikansiota, korvauspaikkamerkit-tiedoston nimen pit\u00e4\u00e4 alkaa alikansion polulla.</p><p>Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.</p>
config.launchbuttonless=Avaa linkit <contextual_help>uudessa painikkeettomassa ikkunassa</contextual_help>?
config.launchbuttonless.help.title=Linkkien avaaminen uudessa painikkeettomassa ikkunassa
config.launchbuttonless.help.content=Jos valitset t\u00e4m\u00e4n asetuksen, portletti avaa katselutiedoston sis\u00e4lt\u00e4m\u00e4t hyperlinkit uuteen alaikkunaan, jossa ei ole painikkeita.  Jos et valitse t\u00e4t\u00e4 asetusta, linkit avataan nykyiseen ikkunaan.  Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.
config.okbutton=Tallennus
info.saved=Tekem\u00e4si muutokset on tallennettu.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Virhe: {0})
error.message=Virhe:
error.internal=Haluamasi palvelu tai tieto ei ole t\u00e4ll\u00e4 hetkell\u00e4 saatavilla. Yrit\u00e4 my\u00f6hemmin uudelleen.
error.nullFile=Haluamasi palvelu tai tieto ei ole t\u00e4ll\u00e4 hetkell\u00e4 saatavilla.  Yrit\u00e4 my\u00f6hemmin uudelleen.
error.nullFilename=Katselutiedoston nimi ei voi olla tyhj\u00e4.  Korjaa kohta alla.
error.pathInFilename=Katselutiedoston nimi ei voi sis\u00e4lt\u00e4\u00e4 mink\u00e4\u00e4n yl\u00e4kansion polkua (eli <code>..</code> -viittausta).  Korjaa kohta alla.
#
warn.message=Varoitus:
warn.nullFile=Alla nimetty\u00e4 katselutiedostoa ei l\u00f6ydy.  Oletko luonut ja asentanut sit\u00e4 viel\u00e4?
warn.nullSubsFile=Alla nimetty\u00e4 korvauspaikkamerkit-tiedostoa ei l\u00f6ydy.  Oletko luonut ja asentanut sit\u00e4 viel\u00e4?
