# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Fichier d'affichage :
config.viewfilename.help.title=Configuration d'un fichier d'affichage
config.viewfilename.help.content=<p>Entrez le nom de base (et l'extension) du fichier d'affichage.  Par exemple, <code>monFichierAffichage.html</code>.</p><p>Ce fichier contient le contenu \u00e0 afficher sur le portlet et doit exister.  Ce fichier doit se trouver sur le serveur de chaque portlet de ce cluster, dans le dossier <code>html</code> des ressources du portlet ou dans son sous-dossier.  (Sinon, le fichier doit se trouver dans le dossier <code>html</code> ou son sous-dossier au sein du portlet WAR.)  Si vous utilisez un sous-dossier, le nom du fichier d'affichage doit inclure le chemin d'acc\u00e8s du sous-dossier.  Par exemple, <code>mesFichiers/monFichierAffichage.html</code>.</p><p>Le contenu du fichier doit \u00eatre localis\u00e9 en fonction des param\u00e8tres r\u00e9gionaux de base.  Si vous avez traduit le contenu, les fichiers d'affichage traduits doivent accompagner le fichier d'affichage de base dans le m\u00eame emplacement et \u00eatre marqu\u00e9s des param\u00e8tres r\u00e9gionaux correspondants.</p><p>Consultez le document administratif pour plus de renseignements.</p>
config.subsfilename=<contextual_help>Fichier de substitutions de jetons</contextual_help> (optional):
config.subsfilename.help.title=Configuration d'un fichier de substitutions de jetons
config.subsfilename.help.content=<p>Sauf si votre fichier d'affichage utilise le jeton <code>{INCLUDE:<i>key</i>}</code>, vous pouvez laisser cet emplacement vide.</p><p>Si votre fichier d'affichage utilise ce jeton, entrez ici le nom du fichier de substitution de jetons correspondant. Par exemple, <code>myViewFileIncludes.properties</code>.</p><p>Ce fichier contient les paires cl\u00e9-valeur que vous souhaitez faire ins\u00e9rer au portlet lors du rendu des jetons <code>{INCLUDE:<i>key</i>}</code> dans votre fichier d'affichage.  Si vous n'entrez pas de nom de fichier, un fichier nomm\u00e9 <code>html_viewer_includes.properties</code> est pris par d\u00e9faut.</p><p>Le fichier doit exister sur chaque serveur de portlet dans ce cluster, dans ce dossier sur le classpath - par exemple, votre dossier \u00ab\u00a0global resources\u00a0\u00bb. (Le fichier peut \u00e9galement se trouver dans le portlet WAR sous le dossier <code>/WEB-INF/classes</code>.) Si vous utilisez un sous-dossier, le nom du fichier de substitution de jetons doit commencer par ce chemin de sous-dossier.</p><p>Veuillez vous reporter \u00e0 la documentation administrative pour plus d'informations.</p>
config.launchbuttonless=Ouvrir les liens dans <contextual_help>new buttonless window</contextual_help>?
config.launchbuttonless.help.title=Ouverture des liens dans une nouvelle fen\u00eatre sans boutons
config.launchbuttonless.help.content=Si vous cochez cette option, les hyperliens du contenu du fichier d'affichage affich\u00e9s par le portlet seront ouverts dans une nouvelle fen\u00eatre ind\u00e9pendante sans boutons.  Si vous ne cochez pas cette option, ils seront ouverts dans la fen\u00eatre actuelle.  Consultez le document administratif pour plus de renseignements.
config.okbutton=Enregistrer
info.saved=Vos modifications ont \u00e9t\u00e9 enregistr\u00e9es.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Erreur\u00a0: {0})
error.message=Erreur\u00a0:
error.internal=Le service ou renseignement demand\u00e9 n'est pas disponible pour l'instant. Veuillez essayer de nouveau ult\u00e9rieurement.
error.nullFile=Le service ou renseignement demand\u00e9 n'est pas disponible pour l'instant.  Veuillez essayer de nouveau ult\u00e9rieurement.
error.nullFilename=Le nom du fichier d'affichage est requis.  Veuillez le corriger ci-dessous.
error.pathInFilename=Le nom du fichier d'affichage ne peut contenir un chemin d'acc\u00e8s au r\u00e9pertoire parent (c.-\u00e0-d., r\u00e9f\u00e9rence <code>..</code>).  Veuillez le corriger ci-dessous.
#
warn.message=Avertissement\u00a0:
warn.nullFile=Le fichier d'affichage indiqu\u00e9 ci-dessous est introuvable.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
warn.nullSubsFile=Le fichier de substitutions de jetons indiqu\u00e9 ci-dessous est introuvable.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
