# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Fichier de visualisation :
config.viewfilename.help.title=Configuration d'un fichier de visualisation
config.viewfilename.help.content=<p>Entrez le nom de base (avec son extension) du fichier de visualisation.  Par exemple, <code>monFichierVisualisation.html</code>.</p><p>Ce fichier contient tout ce qui doit \u00eatre affich\u00e9 par le portlet et doit exister.  Ce fichier doit \u00eatre pr\u00e9sent sur chaque serveur de portlets du cluster, dans le dossier <code>html</code> de l'ensemble des ressources du portlet ou dans un de ses sous-dossiers.  (Sinon, le fichier peut se trouver dans le dossier <code>html</code>, ou un de ses sous-dossiers, \u00e0 l'int\u00e9rieur m\u00eame du fichier WAR du portlet.)  Si vous utilisez un sous-dossier, son chemin doit \u00eatre inclus dans le nom du fichier de visualisation.  Par exemple, <code>mesFichiers/monFichierVisualisation.html</code>.</p><p>Le contenu du fichier doit \u00eatre localis\u00e9 pour les param\u00e8tres r\u00e9gionaux de base.  Si vous avez traduit le contenu, les fichiers de visualisation traduits doivent \u00eatre situ\u00e9s dans le m\u00eame emplacement que le fichier de visualisation de base et ils doivent \u00eatre identifi\u00e9s en tant que param\u00e8tres r\u00e9gionaux.</p><p>Reportez-vous au document administratif pour plus d'informations.</p>
config.subsfilename=<contextual_help>Fichier de substitutions de jetons</contextual_help> (en option) :
config.subsfilename.help.title=Configuration d'un fichier de substitutions de jetons
config.subsfilename.help.content=<p>Sauf si votre fichier utilise le jeton <code>{INCLUDE:<i>cl\u00e9</i>}</code>, vous pouvez laisser cette zone vide.</p><p>Si votre fichier de visualisation utilise ce jeton, entrez ici le nom du fichier de substitutions de jetons. Par exemple, <code>monFichierVisualisationInclut.properties</code>.</p><p>Ce fichier contient les paires cl\u00e9-valeur que le portlet doit ins\u00e9rer lors du rendu des jetons <code>{INCLUDE:<i>cl\u00e9</i>}</code> dans le fichier de visualisation.  Si vous n'indiquez pas de nom de fichier, le programme s\u00e9lectionne par d\u00e9faut un fichier nomm\u00e9 <code>html_viewer_includes.properties</code>.</p><p>Le fichier doit exister sur chaque serveur de portlet de ce cluster, dans un dossier du chemin de classes, par exemple votre dossier "ressources globales". (Sinon, il peut se trouver \u00e0 l'int\u00e9rieur du fichier WAR du portlet, dans le dossier <code>/WEB-INF/classes</code>.) Si vous utilisez un sous-dossier, le nom du fichier de substitutions de jetons doit commencer par le chemin correspondant.</p><p>Reportez-vous \u00e0 la documentation d'administration pour plus d'informations.</p>
config.launchbuttonless=Ouvrir dans <contextual_help>une nouvelle fen\u00eatre sans bouton</contextual_help>\u00a0?
config.launchbuttonless.help.title=Ouverture dans une nouvelle fen\u00eatre sans bouton
config.launchbuttonless.help.content=Si vous cochez cette option, tous les hyperliens du fichier de visualisation affich\u00e9s par le portlet s'ouvriront dans une nouvelle fen\u00eatre fille sans bouton.  Si vous ne cochez pas cette option, ils s'ouvriront dans la fen\u00eatre en cours.  Consultez le document administratif pour plus d'informations.
config.okbutton=Enregistrer
info.saved=Vos modifications ont \u00e9t\u00e9 enregistr\u00e9es.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Erreur\u00a0: {0})
error.message=Erreur :
error.internal=Le service ou l'information que vous avez demand\u00e9(e) n'est pas disponible actuellement. Veuillez r\u00e9essayer ult\u00e9rieurement.
error.nullFile=Le service ou l'information que vous avez demand\u00e9(e) n'est pas disponible actuellement.  Veuillez r\u00e9essayer ult\u00e9rieurement.
error.nullFilename=Le nom du fichier de visualisation ne doit pas \u00eatre vide.  Corrigez-le ci-dessous.
error.pathInFilename=Le nom du fichier de visualisation ne doit contenir aucun chemin de r\u00e9pertoire racine, c'est-\u00e0-dire aucune r\u00e9f\u00e9rence <code>..</code>.  Corrigez-le ci-dessous.
#
warn.message=Avertissement :
warn.nullFile=Le fichier de visualisation nomm\u00e9 ci-dessous est introuvable.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
warn.nullSubsFile=Le fichier de substitutions de jetons nomm\u00e9 ci-dessous est introuvable.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
