# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Anzeigedatei:
config.viewfilename.help.title=Anzeigedatei konfigurieren
config.viewfilename.help.content=<p>Geben Sie den Basisnamen (einschlie\u00dflich Erweiterung) der Anzeigedatei ein.  Beispiel: <code>myViewFile.html</code>.</p><p>Diese Datei enth\u00e4lt den Inhalt, den das Portlet anzeigen soll, und sie muss vorhanden sein.  Diese Datei muss auf jedem Portlet-Server in diesem Cluster im <code>html</code>-Ordner des Pakets f\u00fcr Portlet-Ressourcen oder in einem Unterordner dieses Ordners existieren.  (Alternativ kann die Datei im <code>html</code>-Ordner oder in einem Unterordner dieses Ordners in der Portlet-WAR selbst gespeichert sein.)  Wenn Sie einen Unterordner verwenden, muss der Name der Anzeigedatei diesen Unterordnerpfad enthalten.  Beispiel: <code>myFiles/myViewFile.html</code>.</p><p>Der Dateiinhalt sollte entsprechend der Basisl\u00e4ndereinstellung lokalisiert sein.  Wenn der Inhalt \u00fcbersetzt wurde, sollten die \u00fcbersetzten Anzeigedateien an derselben Position wie die Basisanzeigedatei gespeichert und mit derselben L\u00e4ndereinstellung gekennzeichnet sein.</p><p>Weitere Informationen finden Sie im Verwaltungsdokument.</p>
config.subsfilename=<contextual_help>Tokenersetzungsdatei</contextual_help> (optional):
config.subsfilename.help.title=Tokenersetzungsdatei konfigurieren
config.subsfilename.help.content=<p>Sie brauchen dieses Feld nur auszuf\u00fcllen, wenn in Ihrer Anzeigedatei das Token <code>{INCLUDE:<i>Schl\u00fcssel</i>}</code> verwendet wird.</p><p>Wird dieses Token in Ihrer Anzeigedatei verwendet, geben Sie den Namen der Tokenersetzungsdatei f\u00fcr dieses Token hier ein. Beispiel: <code>myViewFileIncludes.properties</code>.</p><p>Diese Datei enth\u00e4lt die Schl\u00fcssel-Wert-Paare, die das Portlet einf\u00fcgen soll, wenn die Tokens <code>{INCLUDE:<i>Schl\u00fcssel</i>}</code> in Ihrer Anzeigedatei gerendert werden.  Wenn Sie keinen Dateinamen eingeben, wird der Dateiname <code>html_viewer_includes.properties</code> angenommen.</p><p>Die Datei muss auf jedem Portlet-Server in diesem Cluster in einem Ordner im Klassenpfad vorhanden sein \u2013 beispielsweise in Ihrem Order f\u00fcr globale Ressourcen. (Alternativ kann die Datei in der Portlet-WAR im Ordner <code>/WEB-INF/classes</code> gespeichert sein.) Wenn Sie einen Unterordner verwenden, muss der Name der Tokenersetzungsdatei mit diesem Unterordnerpfad beginnen.</p><p>Weitere Informationen finden Sie im Verwaltungsdokument.</p>
config.launchbuttonless=Links in einem <contextual_help>neuen Fenster ohne Schaltfl\u00e4chen</contextual_help> \u00f6ffnen?
config.launchbuttonless.help.title=Links in einem neuen Fenster ohne Schaltfl\u00e4chen \u00f6ffnen
config.launchbuttonless.help.content=Wenn Sie diese Option ausw\u00e4hlen, werden die Hyperlinks im Inhalt der vom Portlet angezeigten Datei in einem neuen untergeordneten Fenster ohne Schaltfl\u00e4chen ge\u00f6ffnet.  Wenn Sie diese Option nicht ausw\u00e4hlen, werden sie im aktuellen Fenster ge\u00f6ffnet.  Weitere Informationen enth\u00e4lt das Verwaltungsdokument.
config.okbutton=Speichern
info.saved=Ihre \u00c4nderungen wurden gespeichert.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Fehler: {0})
error.message=Fehler:
error.internal=Der angeforderte Service oder die angeforderte Information ist derzeit nicht verf\u00fcgbar. Bitte versuchen Sie es sp\u00e4ter erneut.
error.nullFile=Der angeforderte Service oder die angeforderte Information ist derzeit nicht verf\u00fcgbar.  Bitte versuchen Sie es sp\u00e4ter erneut.
error.nullFilename=Der Name der Anzeigedatei muss angegeben werden.  Bitte unten korrigieren.
error.pathInFilename=Der Name der Anzeigedatei kann keinen Pfad f\u00fcr ein \u00fcbergeordnetes Verzeichnis enthalten (d. h. die Angabe <code>..</code>).  Bitte unten korrigieren.
#
warn.message=Warnung:
warn.nullFile=Die unten angegebene Anzeigedatei wurde nicht gefunden.  Haben Sie sie schon erstellt und installiert?
warn.nullSubsFile=Die unten angegebene Tokenersetzungsdatei wurde nicht gefunden.  Haben Sie sie schon erstellt und installiert?
