# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Visningsfil:
config.viewfilename.help.title=Konfigurering af visningsfil
config.viewfilename.help.content=<p>Skriv basisnavnet (inklusive filtype) p\u00e5 visningsfilen.  F.eks. <code>minvisningsfil.html</code>.</p><p>Denne fil indeholder det indhold, som portlet'en skal vise og skal findes.  Filen skal findes p\u00e5 alle portlet-servere i dette cluster, i portlet ressource-bundle mappen <code>html</code> eller i en mappe derunder.  (Alternativt kan filen ligge i mappen <code>html</code> eller i en mappe derunder inde i selve portlet WAR'en).  Hvis du bruger en undermappe, skal visningsfilnavnet inkludere stien til undermappen.  F.eks. <code>minefiler/minvisningsfil.html</code>.</p><p>Filindholdet skal lokaliseres til basislandestandard.  Hvis du har oversat indholdet, skal de oversatte visningsfiler f\u00f8lge basisvisningsfilen i samme placering og v\u00e6re m\u00e6rket med relevant landestandard.</p><p>Se administrationsdokumentet for yderligere oplysninger.</p>
config.subsfilename=<contextual_help>Token-substitutionsfil</contextual_help> (valgfrit):
config.subsfilename.help.title=Konfigurering af token-substitutionsfil
config.subsfilename.help.content=<p>Medmindre visningsfilen benytter <code>{INCLUDE:<i>key</i>}</code> token'et, kan du lade dette v\u00e6re blankt.</p><p>Hvis visningsfilen bruger dette token, skal du skrive navnet p\u00e5 token-substitutionsfilen her. For eksempel <code>minvisningsfilinkluderer.properties</code>.</p><p>Filen indeholder de n\u00f8glev\u00e6rdipar, som portlet'en skal inds\u00e6tte, n\u00e5r <code>{INCLUDE:<i>key</i>}</code> tokens i visningsfilen gengives.  Hvis ikke du angiver et filnavn, bruges filnavnet <code>html_viewer_includes.properties</code>.</p><p>Filen skal findes p\u00e5 alle portlet-servere i dette cluster, i en mappe i classpath - for eksempel mappen med "globale ressourcer". (Filen kan ogs\u00e5 ligge inden i portlet WAR'en i mappen <code>/WEB-INF/classes</code>). Hvis du benytter en undermappe, skal token-substitutionsfilnavnet starte med stien til den p\u00e5g\u00e6ldende undermappe.</p><p>Der er flere oplysninger i administrationsdokumentationen.</p>
config.launchbuttonless=\u00c5bn linkene i <contextual_help>nyt vindue uden knapper</contextual_help>?
config.launchbuttonless.help.title=\u00c5bner links i et nyt vindue uden knapper
config.launchbuttonless.help.content=Hvis du markerer denne indstilling, vil hyperlink i det visningsfilindhold, der vises af portlet'en, blive \u00e5bnet i et nyt undervindue uden knapper.  Hvis ikke du markerer dette punkt, \u00e5bnes de i det aktuelle vindue.  Se administrationsdokumentet for yderligere oplysninger.
config.okbutton=Gem
info.saved=Dine \u00e6ndringer er gemt.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Fejl: {0})
error.message=Fejl:
error.internal=Den tjeneste eller de oplysninger, du har bedt om, er i \u00f8jeblikket ikke tilg\u00e6ngelige. Pr\u00f8v igen senere.
error.nullFile=Den tjeneste eller de oplysninger, du har bedt om, er i \u00f8jeblikket ikke tilg\u00e6ngelige.  Pr\u00f8v igen senere.
error.nullFilename=Visningsfilens navn m\u00e5 ikke v\u00e6re tomt.  Ret det nedenfor.
error.pathInFilename=Visningsfilens navn m\u00e5 ikke indeholde en sti til overordnet bibliotek (dvs. <code>..</code> reference).  Ret det nedenfor.
#
warn.message=Advarsel:
warn.nullFile=Nedenst\u00e5ende visningsfil findes ikke.  Har du oprettet og installeret filen?
warn.nullSubsFile=Nedenst\u00e5ende token-substitutionsfil findes ikke.  Har du oprettet og installeret filen?
