# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Visningsfil:
config.viewfilename.help.title=Konfigurere en visningsfil
config.viewfilename.help.content=<p>Skriv basisfilnavnet (inkludert filtype) p\u00e5 visningsfilen.  For eksempel <code>minVisningsFil.html</code>.</p><p>Denne filen inneholder innholdet du vil at portalprogrammet skal vise, og den m\u00e5 finnes.  Denne filen m\u00e5 finnes p\u00e5 hver portalprogramserver i dette clusteret, i mappen for portalprogramressurspakken <code>html</code> eller en undermappe i den.  (Alternativt kan filen finnes i <code>html</code>-mappen eller en undermappe i den innenfor selve portalprogram-WAR.)  Hvis du bruker en undermappe, m\u00e5 visningsfilnavnet inkludere banen til den undermappen.  For eksempel <code>mineFiler/minVisningsFil.html</code>.</p><p>Filinnholdet m\u00e5 v\u00e6re lokalisert for basislokalitetsinnstillingen.  Hvis du har oversatt innholdet, m\u00e5 den oversatte visningsfilen f\u00f8lge basisvisningsfilen p\u00e5 samme sted, og m\u00e5 v\u00e6re merket med lokalitetsinnstillingen.</p><p>Se administrasjonsdokumentet for mer informasjon.</p>
config.subsfilename=<contextual_help>Symbolerstatningsfil</contextual_help> (valgfritt):
config.subsfilename.help.title=Konfigurere en symbolerstatningsfil
config.subsfilename.help.content=<p>Hvis ikke visningsfilen bruker <code>{INCLUDE:<i>key</i>}</code>-symbolet, kan du la dette st\u00e5 tomt.</p><p>Hvis visningsfilen bruker det symbolet, skriver du navnet p\u00e5 symbolerstatningsfilen for symbolet her. For eksempel <code>minVisningsFilInkluderer.properties</code>.</p><p>Denne filen inneholder n\u00f8kkelverdiparene som du vil at portalprogrammet skal sette inn ved gjengivelse av <code>{INCLUDE:<i>key</i>}</code>-symboler i visningsfilen.  Hvis du ikke skriver et filnavn, brukes en fil med navnet <code>html_viewer_includes.properties</code>.</p><p>Filen m\u00e5 finnes p\u00e5 hver portalprogramserver i dette clusteret, i en mappe i klassebanen - for eksempel din "global resources"-mappe. (Alternativt kan filen v\u00e6re i portalprogram-WAR i <code>/WEB-INF/classes</code>-mappen.) Hvis du bruker en undermappe, m\u00e5 navnet p\u00e5 symbolerstatningsfilen starte med banen til undermappen.</p><p>Se administrasjonsdokumentasjonen for mer informasjon.</p>
config.launchbuttonless=\u00c5pne lenker i <contextual_help>nytt vindu uten knapper</contextual_help>?
config.launchbuttonless.help.title=\u00c5pne lenker i et nytt vindu uten knapper
config.launchbuttonless.help.content=Hvis du merker av for dette alternativet, vil alle hyperlenker i visningsfilinnholdet som vises av portalprogrammet, bli \u00e5pnet i et nytt underordnet vindu uten knapper.  Hvis du ikke merker av for dette alternativet, \u00e5pnes de i gjeldende vindu.  Se administrasjonsdokumentet for mer informasjon.
config.okbutton=Lagre
info.saved=Endringene dine er lagret.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Feil: {0})
error.message=Feil:
error.internal=Tjenesten eller informasjonen du ba om, er ikke tilgjengelig n\u00e5. Pr\u00f8v igjen senere.
error.nullFile=Tjenesten eller informasjonen du ba om, er ikke tilgjengelig n\u00e5.  Pr\u00f8v igjen senere.
error.nullFilename=Visningsfilnavnet kan ikke v\u00e6re tomt.  Korriger det nedenfor.
error.pathInFilename=Visningsfilnavnet kan ikke inneholde noen bane til overordet katalog (som <code>..</code> referanse).  Korriger det nedenfor.
#
warn.message=Advarsel:
warn.nullFile=Finner ikke visningsfilen nedenfor.  Har du opprettet og installert den enn\u00e5?
warn.nullSubsFile=Finner ikke symbolerstatningsfilen nedenfor.  Har du opprettet og installert den enn\u00e5?
