# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Skat\u012b\u0161anas fails:
config.viewfilename.help.title=Skat\u012b\u0161anas faila konfigur\u0113\u0161ana
config.viewfilename.help.content=<p>Ievadiet skat\u012b\u0161an\u0101s faila pamata nosaukumu (ieskaitot papla\u0161in\u0101jumu).  Piem\u0113ram, <code>myViewFile.html</code>.</p><p>\u0160is fails satur saturu, kuru v\u0113laties, lai port\u0101la komponents r\u0101d\u012btu, un tas nedr\u012bkst neeksist\u0113t.  \u0160\u012bm failam j\u0101eksist\u0113 katr\u0101 \u0161\u012b klastera port\u0101la komponentu server\u012b, port\u0101la komponentu resursu sai\u0161\u0137a <code>html</code> map\u0113 vai nor\u0101d\u012btaj\u0101 apak\u0161map\u0113.  (K\u0101 alternat\u012bva, \u0161is fails var eksist\u0113t <code>html</code> map\u0113 vai \u0161eit nor\u0101d\u012btaj\u0101 map\u0113 pa\u0161\u0101 port\u0101la komponenta WAR.)  Ja izmantojat apak\u0161mapi, skat\u012b\u0161anas faila nosaukumam j\u0101satur apak\u0161mapes ce\u013c\u0161.  Piem\u0113ram, <code>myFiles/myViewFile.html</code>.</p><p>Faila saturam j\u0101b\u016bt lokaliz\u0113tam pamata lokaliz\u0101cijai.  Ja saturs ir tulkots, tulkotajiem skat\u012b\u0161anas failiem j\u0101atrodas taj\u0101 pa\u0161\u0101 lok\u0101cij\u0101, kur pamata skat\u012b\u0161anas failam, un tiem j\u0101b\u016bt atz\u012bm\u0113tiem ar atbilsto\u0161o lokaliz\u0101ciju.</p><p>L\u016bdzu, lai ieg\u016btu papildinform\u0101ciju, skatiet administr\u0101cijas dokumentu.</p>
config.subsfilename=<contextual_help>Pilnvaru aizvieto\u0161anas fails</contextual_help> (opcija):
config.subsfilename.help.title=Pilnvaru aizvieto\u0161anas faila konfigur\u0113\u0161ana
config.subsfilename.help.content=<p>Ja vien j\u016bsu skat\u012b\u0161an\u0101s fails neizmanto <code>{INCLUDE:<i>key</i>}</code> pilnvaru, varat atst\u0101t \u0161o lauku tuk\u0161u.</p><p>Ja j\u016bsu skat\u012b\u0161an\u0101s fails izmanto \u0161\u0101du pilnvaru, tad \u0161eit ievadiet pilnvaru aizvieto\u0161anas faila nosaukumu. Piem\u0113ram, <code>myViewFileIncludes.properties</code>.</p><p>\u0160is fails satur atsl\u0113gu-v\u0113rt\u012bbu p\u0101rus, kurus v\u0113laties, lai port\u0101la komponents ievietotu, kad tiek apstr\u0101d\u0101tas <code>{INCLUDE:<i>key</i>}</code> pilnvaras j\u016bsu skat\u012b\u0161an\u0101s fail\u0101.  Ja neievad\u0101t faila nosaukumu, tad tiek uzskat\u012bts, ka ievad\u012bts <code>html_viewer_includes.properties</code> fails.</p><p>\u0160im failam ir j\u0101eksist\u0113 uz katra port\u0101la komponentu servera \u0161aj\u0101 klaster\u012b, map\u0113, kas nor\u0101d\u012bta kla\u0161u ce\u013c\u0101 - piem\u0113ram, "glob\u0101lo resursu" map\u0113. (K\u0101 alternat\u012bva, \u0161is fails var eksist\u0113t <code>/WEB-INF/classes</code> map\u0113, pa\u0161\u0101 port\u0101la komponenta WAR.) Ja izmantojat apak\u0161mapi, pilnvaru aizvieto\u0161anas faila nosaukumam ir j\u0101s\u0101kas ar \u0161\u012bs apak\u0161mapes ce\u013cu.</p><p>Lai ieg\u016btu papildinform\u0101ciju, l\u016bdzu, skatiet administr\u0113\u0161anas dokument\u0101ciju.</p>
config.launchbuttonless=Atv\u0113rt saites <contextual_help>jaun\u0101 log\u0101 bez pog\u0101m</contextual_help>?
config.launchbuttonless.help.title=Sai\u0161u atv\u0113r\u0161ana jaun\u0101 log\u0101 bez pog\u0101m
config.launchbuttonless.help.content=Ja atz\u012bm\u0113jat \u0161o opciju, jebkuras port\u0101la komponenta par\u0101d\u012bt\u0101 skat\u012b\u0161anas faila satur\u0101 eso\u0161\u0101s hipersaites tiks atv\u0113rtas jaun\u0101 atvasin\u0101taj\u0101 log\u0101 bez pog\u0101m.  Ja neatz\u012bm\u0113jat \u0161o opciju, t\u0101s tiks atv\u0113rtas pa\u0161reiz\u0113j\u0101 log\u0101.  Lai ieg\u016btu papildinform\u0101ciju, l\u016bdzu skatiet administr\u0113\u0161anas dokumentu.
config.okbutton=Saglab\u0101t
info.saved=J\u016bsu veikt\u0101s izmai\u0146as tika saglab\u0101tas.

# messages for view mode 
# (none)

# messages for error handling
error.code=(K\u013c\u016bda: {0})
error.message=K\u013c\u016bda:
error.internal=J\u016bsu piepras\u012btais pakalpojums vai inform\u0101cija \u0161obr\u012bd nav pieejama. L\u016bdzu, m\u0113\u0123iniet v\u0113lreiz v\u0113l\u0101k.
error.nullFile=J\u016bsu piepras\u012btais pakalpojums vai inform\u0101cija \u0161obr\u012bd nav pieejama.  L\u016bdzu, m\u0113\u0123iniet v\u0113lreiz v\u0113l\u0101k.
error.nullFilename=Skat\u012b\u0161anas faila nosaukums nevar b\u016bt tuk\u0161s.  L\u016bdzu to izlabojiet zem\u0101k.
error.pathInFilename=Skat\u012b\u0161anas faila nosaukums nevar satur\u0113t saturo\u0161\u0101s mapes ce\u013cu (t.i. , <code>..</code> atsauce).  L\u016bdzu to izlabojiet zem\u0101k.
#
warn.message=Br\u012bdin\u0101jums:
warn.nullFile=Zem\u0101k nor\u0101d\u012btais skat\u012b\u0161an\u0101s fails nav atrodams.  Vai esat to izveidojis un instal\u0113jis?
warn.nullSubsFile=Zem\u0101k nor\u0101d\u012btais pilnvaru aizvieto\u0161anas fails nav atrodams.  Vai esat to izveidojis un instal\u0113jis?
