# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=S\u00fabor zobrazenia:
config.viewfilename.help.title=Konfigur\u00e1cia s\u00faboru zobrazenia
config.viewfilename.help.content=<p>Zadajte z\u00e1kladn\u00fd n\u00e1zov (vr\u00e1tane pr\u00edpony) s\u00faboru zobrazenia.  Napr\u00edklad <code>myViewFile.html</code>.</p><p>V tomto s\u00fabore sa nach\u00e1dza obsah, ktor\u00fd m\u00e1 portlet zobrazova\u0165. S\u00fabor mus\u00ed existova\u0165.  Tento s\u00fabor by mal existova\u0165 na ka\u017edom portletovom serveri tohto klastra, v prie\u010dinku so zv\u00e4zkami zdrojov portletu <code>html</code> alebo v jeho podprie\u010dinku.  (S\u00fabor v\u0161ak m\u00f4\u017ee existova\u0165 aj v prie\u010dinku <code>html</code> alebo podprie\u010dinku, ktor\u00e9 sa nach\u00e1dzaj\u00fa v samotnom portlete WAR.)  Ak pou\u017e\u00edvate podprie\u010dinok, n\u00e1zov s\u00faboru zobrazenia by mal obsahova\u0165 t\u00fato cestu k podprie\u010dinku.  Napr\u00edklad <code>myFiles/myViewFile.html</code>.</p><p>Obsah s\u00faboru by mal by\u0165 lokalizovan\u00fd pod\u013ea miestnych nastaven\u00ed.  Ak ste obsah prelo\u017eili, prelo\u017een\u00e9 s\u00fabory zobrazenia by sa mali vz\u0165ahova\u0165 na z\u00e1kladn\u00fd s\u00fabor zobrazenia v tom istom umiestnen\u00ed a mali by by\u0165 ozna\u010den\u00e9 v s\u00falade s miestnymi nastaveniami.</p><p>\u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.</p>
config.subsfilename=<contextual_help>S\u00fabor so substit\u00faciami tokenu</contextual_help> (volite\u013en\u00e9):
config.subsfilename.help.title=Konfigur\u00e1cia s\u00faboru so substit\u00faciami tokenu
config.subsfilename.help.content=<p>Ak s\u00fabor zobrazenia neobsahuje token <code>{INCLUDE:<i>key</i>}</code>, m\u00f4\u017eete necha\u0165 t\u00fato mo\u017enos\u0165 pr\u00e1zdnu.</p><p>Ak s\u00fabor zobrazenia pou\u017e\u00edva token, zadajte n\u00e1zov s\u00faboru so substit\u00faciami tokenu na toto miesto. Napr\u00edklad <code>myViewFileIncludes.properties</code>.</p><p>Tento s\u00fabor obsahuje p\u00e1ry k\u013e\u00fa\u010d-hodnota, ktor\u00e9 m\u00e1 portlet vlo\u017ei\u0165 pri vykres\u013eovan\u00ed tokenov <code>{INCLUDE:<i>key</i>}</code> v s\u00fabore zobrazenia.  Ak n\u00e1zov s\u00faboru nezad\u00e1te, predpokladan\u00fd n\u00e1zov s\u00faboru bude <code>html_viewer_includes.properties</code>.</p><p>S\u00fabor by mal existova\u0165 na ka\u017edom portletovom serveri tohto klastra a v prie\u010dinku v r\u00e1mci cesty k skupine \u2013 napr\u00edklad v prie\u010dinku \u201eglob\u00e1lne zdroje\u201c. (S\u00fabor v\u0161ak m\u00f4\u017ee existova\u0165 aj v samotnom portlete WAR v prie\u010dinku <code>/WEB-INF/classes</code>.) Ak pou\u017e\u00edvate podprie\u010dinok, n\u00e1zov s\u00faboru so substit\u00faciami tokenov sa m\u00f4\u017ee za\u010d\u00edna\u0165 touto cestou k podprie\u010dinku.</p><p>\u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.</p>
config.launchbuttonless=Chcete otvori\u0165 prepojenia v <contextual_help>novom okne bez tla\u010didiel</contextual_help>?
config.launchbuttonless.help.title=Otvorenie prepojen\u00ed v novom okne bez tla\u010didiel
config.launchbuttonless.help.content=Ak za\u010diarknete t\u00fato mo\u017enos\u0165, v\u0161etky hypertextov\u00e9 prepojenia v obsahu s\u00faboru zobrazenia zobrazovan\u00e9 prostredn\u00edctvom portletu sa otvoria v novom podriadenom okne bez tla\u010didiel.  Ak t\u00fato mo\u017enos\u0165 neza\u010diarknete, otvoria sa v aktu\u00e1lnom okne.  \u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.
config.okbutton=Ulo\u017ei\u0165
info.saved=Zmeny boli ulo\u017een\u00e9.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Chyba: {0})
error.message=Chyba:
error.internal=Po\u017eadovan\u00e1 slu\u017eba alebo inform\u00e1cia nie s\u00fa moment\u00e1lne k dispoz\u00edcii. Sk\u00faste to znova nesk\u00f4r.
error.nullFile=Po\u017eadovan\u00e1 slu\u017eba alebo inform\u00e1cia nie s\u00fa moment\u00e1lne k dispoz\u00edcii.  Sk\u00faste to znova nesk\u00f4r.
error.nullFilename=S\u00fabor zobrazenia nem\u00f4\u017ee by\u0165 pr\u00e1zdny.  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
error.pathInFilename=S\u00fabor zobrazenia nesmie obsahova\u0165 \u017eiadnu nadraden\u00fa cestu adres\u00e1ra (napr. odkaz <code>..</code>).  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
#
warn.message=Upozornenie:
warn.nullFile=S\u00fabor zobrazenia nach\u00e1dzaj\u00faci sa ni\u017e\u0161ie nie je mo\u017en\u00e9 n\u00e1js\u0165.  U\u017e ste ho vytvorili a nain\u0161talovali?
warn.nullSubsFile=S\u00fabor so substit\u00faciami tokenu nach\u00e1dzaj\u00faci sa ni\u017e\u0161ie nie je mo\u017en\u00e9 n\u00e1js\u0165.  U\u017e ste ho vytvorili a nain\u0161talovali?
