# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Datoteka za prikaz:
config.viewfilename.help.title=Konfiguriranje datoteke za prikaz
config.viewfilename.help.content=<p>Unesite osnovni naziv (uklju\u010duju\u0107i nastavak) datoteke prikaza.  Primjerice, unesite <code>myViewFile.html</code>.</p><p>U toj datoteci nalazi se sadr\u017eaj koji \u017eelite prikazati putem portleta te ona mora postojati.  Ta datoteka trebala bi postojati na svim poslu\u017eiteljima portleta u ovom klasteru, u <code>html</code> mapi paketa resursa portleta ili u njegovoj podmapi.  (Datoteka se mo\u017ee nalaziti i u <code>html</code> mapi ili podmapi unutar samog WAR-a portleta.)  Ako koristite podmapu, naziv datoteke prikaza mora sadr\u017eavati put podmape.  Primjerice, <code>myFiles/myViewFile.html</code>.</p><p>Sadr\u017eaj datoteke mora biti lokaliziran na jezik baze.  Ako ste preveli sadr\u017eaj, prevedene datoteke prikaza moraju se nalaziti na istom mjestu kao i osnovne datoteke prikaza te biti na odgovaraju\u0107i na\u010din ozna\u010dene lokalnim postavkama.</p><p>Dodatne informacije potra\u017eite u administracijskom dokumentu.</p>
config.subsfilename=<contextual_help>Datoteka za zamjenu tokena</contextual_help> (nije obavezno):
config.subsfilename.help.title=Konfiguriranje datoteke za zamjenu tokena
config.subsfilename.help.content=<p>Ako va\u0161a datoteka za prikaz koristi token <code>{INCLUDE:<i>key</i>}</code>, ovaj dio mo\u017eete ostaviti praznim.</p><p>Ako va\u0161a datoteka za prikaz ne koristi taj token, ovdje unesite naziv datoteke za zamjenu tokena. Npr., <code>myViewFileIncludes.properties</code>.</p><p>Ta datoteka sadr\u017ei parove vrijednosti klju\u010deva koje portlet mora umetnuti pri renderiranju tokena <code>{INCLUDE:<i>key</i>}</code> u datoteci prikaza.  Ako ne unesete naziv datoteke, koristi se naziv <code>html_viewer_includes.properties</code>.</p><p>Datoteka bi trebala postojati na svim poslu\u017eiteljima portleta u ovom klasteru, i to u mapi u putu klase, npr. u mapi s globalnim resursima. (Datoteka se mo\u017ee nalaziti i u WAR-u portleta u mapi <code>/WEB-INF/classes</code>.) Ako koristite podmapu, naziv datoteke za zamjenu tokena mora zapo\u010dinjati putom te podmape.</p><p>Dodatne informacije potra\u017eite u administracijskoj dokumentaciji.</p>
config.launchbuttonless=\u017delite li otvoriti veze u <contextual_help>novom prozoru bez gumba</contextual_help>?
config.launchbuttonless.help.title=Otvaranje veza u novom prozoru bez gumba
config.launchbuttonless.help.content=Ako ozna\u010dite tu mogu\u0107nost, sve hiperveze u sadr\u017eaju datoteke prikaza prikazane putem portleta bit \u0107e otvorene u novom podre\u0111enom prozoru bez gumba.  Ako ne ozna\u010dite tu mogu\u0107nost, hiperveze \u0107e biti otvorene u trenutnom prozoru.  Dodatne informacije potra\u017eite u administracijskom dokumentu.
config.okbutton=Spremi
info.saved=Va\u0161e su promjene spremljene.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Pogre\u0161ka: {0})
error.message=Pogre\u0161ka:
error.internal=usluga ili informacija koju ste zatra\u017eili trenutno nije dostupna. Poku\u0161ajte ponovno kasnije.
error.nullFile=Usluga ili informacija koju ste zatra\u017eili trenutno nije dostupna.  Poku\u0161ajte ponovno kasnije.
error.nullFilename=Naziv datoteke prikaza ne mo\u017ee biti prazan.  Ispravite to u nastavku.
error.pathInFilename=Naziv datoteke prikaza ne mo\u017ee sadr\u017eavati put nadre\u0111enog direktorija (tj., referenca <code>..</code>).  Ispravite to u nastavku.
#
warn.message=Upozorenje:
warn.nullFile=Nije mogu\u0107e prona\u0107i dolje navedenu datoteku prikaza.  Jeste li je ve\u0107 stvorili i instalirali?
warn.nullSubsFile=Nije mogu\u0107e prona\u0107i dolje navedenu datoteku za zamjenu tokena.  Jeste li je ve\u0107 stvorili i instalirali?
