# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Visningsfil:
config.viewfilename.help.title=Konfigurera en visningsfil
config.viewfilename.help.content=<p>Ange basnamnet (inklusive filnamnstill\u00e4gg) f\u00f6r visningsfilen.  Det kan t.ex. vara <code>myViewFile.html</code>.</p><p>Denna fil rymmer det inneh\u00e5ll som du vill att din portlet ska visa och den m\u00e5ste finnas i verkligheten.  Denna fil m\u00e5ste finnas p\u00e5 alla portletservrar i klustret och i <code>html</code>-mappen f\u00f6r portletens resurspaket eller i en undermapp till denna.  (Som ett alternativ kan filen ligga i <code>html</code>-mappen eller en undermapp till denna inuti portletens WAR.)  Om du anv\u00e4nder en undermapp m\u00e5ste visningsfilens namn inkludera s\u00f6kv\u00e4gen till denna undermapp.  Det kan t.ex. vara <code>myFiles/myViewFile.html</code>.</p><p>Filinneh\u00e5llet i din bas-locale ska vara lokaliserat.  Om du har \u00f6versatt inneh\u00e5llet b\u00f6r de \u00f6versatta visningsfilerna lagras tillsammans med basvisningsfilen p\u00e5 samma st\u00e4lle och vara m\u00e4rkta med aktuell locale.</p><p>I administrationsdokumentet finner du mer information om detta.</p>
config.subsfilename=<contextual_help>Fil med tokensubstitutioner</contextual_help> (valfritt):
config.subsfilename.help.title=Konfigurera en fil med substitutioner f\u00f6r token
config.subsfilename.help.content=<p>Om din visningsfil inte anv\u00e4nder n\u00e5gon <code>{INCLUDE:<i>key</i>}</code>-token kan du l\u00e4mna detta f\u00e4lt tomt.</p><p>Om visningsfilen anv\u00e4nder denna token ska du skriva namnet p\u00e5 filen med tokensubstitutioner h\u00e4r. Det kan t.ex. vara <code>myViewFileIncludes.properties</code>.</p><p>Denna fil inneh\u00e5ller de nyckelv\u00e4rdespar som du vill att portleten ska infoga n\u00e4r den renderar <code>{INCLUDE:<i>key</i>}</code>-token i din visningsfil.  Om du inte anger n\u00e5got filnamn f\u00f6ruts\u00e4tts det att du vill anv\u00e4nda en fil med namnet <code>html_viewer_includes.properties</code>.</p><p>Denna fil m\u00e5ste finnas p\u00e5 varje portletserver i klustret, i en mapp i klass\u00f6kv\u00e4gen - t.ex. din "global resources"-mapp. (Som ett alternativ kan filen ligga i portletens WAR i mappen <code>/WEB-INF/classes</code>.) Om du anv\u00e4nder en undermapp m\u00e5ste namnet p\u00e5 filen med tokensubstitutioner inkludera s\u00f6kv\u00e4gen till denna undermapp.</p><p>G\u00e5 till administrationsdokumentet om du vill ha mer information.</p>
config.launchbuttonless=\u00d6ppna l\u00e4nkar i <contextual_help>nytt f\u00f6nster utan knappar</contextual_help>?
config.launchbuttonless.help.title=\u00d6ppna l\u00e4nkar i ett nytt f\u00f6nster utan knappar
config.launchbuttonless.help.content=Om du markerar det h\u00e4r alternativet kommer alla hyperl\u00e4nkar i det visningsfilsinneh\u00e5ll som visas av portleten att \u00f6ppnas i ett nytt underordnat f\u00f6nster utan knappar.  Om du inte markerar det h\u00e4r alternativet \u00f6ppnas de i det aktuella f\u00f6nstret.  G\u00e5 till administrationsdokumentet om du vill ha mer information.
config.okbutton=Spara
info.saved=Dina \u00e4ndringar har sparats.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Fel: {0})
error.message=Fel:
error.internal=Den service eller information du s\u00f6ker \u00e4r inte tillg\u00e4nglig just nu. F\u00f6rs\u00f6k igen senare.
error.nullFile=Den service eller information du s\u00f6ker \u00e4r inte tillg\u00e4nglig just nu.  F\u00f6rs\u00f6k igen senare.
error.nullFilename=Visningsfilens namn f\u00e5r inte utel\u00e4mnas.  \u00c5tg\u00e4rda detta nedan.
error.pathInFilename=Visningsfilens namn f\u00e5r inte inneh\u00e5lla n\u00e5gon s\u00f6kv\u00e4g till en \u00f6verordnad katalog (t.ex. <code>..</code>).  \u00c5tg\u00e4rda detta nedan.
#
warn.message=Varning:
warn.nullFile=Hittar inte den visningsfil som anges nedan.  Har du skapat och installerat den \u00e4n?
warn.nullSubsFile=Hittar inte den fil med tokensubstitutioner som anges nedan.  Har du skapat och installerat den \u00e4n?
