# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\ubcf4\uae30 \ud30c\uc77c:
config.viewfilename.help.title=\ubcf4\uae30 \ud30c\uc77c \uad6c\uc131 \uc911
config.viewfilename.help.content=<p>\ubcf4\uae30 \ud30c\uc77c\uc758 \uae30\ubcf8 \uc774\ub984(\ud655\uc7a5\uba85 \ud3ec\ud568)\uc744 \uc785\ub825\ud558\uc2ed\uc2dc\uc624.  \uc608: <code>myViewFile.html</code>.</p><p>\uc774 \ud30c\uc77c\uc5d0\ub294 \ud3ec\ud2c0\ub9bf\uc5d0 \ud45c\uc2dc\ud560 \ub0b4\uc6a9\uc774 \ub4e4\uc5b4 \uc788\uc73c\uba70 \ubc18\ub4dc\uc2dc \uc874\uc7ac\ud574\uc57c \ud569\ub2c8\ub2e4.  \uc774 \ud30c\uc77c\uc740 \uc774 \ud074\ub7ec\uc2a4\ud130\uc758 \uac01 \ud3ec\ud2c0\ub9bf \uc11c\ubc84\uc5d0\uc11c \ud3ec\ud2c0\ub9bf \ub9ac\uc18c\uc2a4 \ubc88\ub4e4 <code>html</code> \ud3f4\ub354 \ub610\ub294 \ud558\uc704 \ud3f4\ub354\uc5d0 \uc874\uc7ac\ud574\uc57c \uc555\ub2c8\ub2e4.  (\uc544\ub2c8\uba74 \ud30c\uc77c\uc774 \ud3ec\ud2c0\ub9bf WAR \uc790\uccb4 \ub0b4\ubd80\uc758 <code>html</code> \ud3f4\ub354 \ub610\ub294 \ud558\uc704 \ud3f4\ub354\uc5d0 \uc874\uc7ac\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.)  \ud558\uc704 \ud3f4\ub354\ub97c \uc0ac\uc6a9\ud560 \uacbd\uc6b0 \ubcf4\uae30 \ud30c\uc77c \uc774\ub984\uc5d0 \ud574\ub2f9 \ud558\uc704 \ud3f4\ub354 \uacbd\ub85c\uac00 \ud3ec\ud568\ub418\uc5b4\uc57c \ud569\ub2c8\ub2e4.  \uc608: <code>myFiles/myViewFile.html</code>.</p><p>\ud30c\uc77c \ub0b4\uc6a9\uc740 \uae30\ubcf8 \ub85c\ucf00\uc77c\ub85c \ud604\uc9c0\ud654\ub418\uc5b4\uc57c \ud569\ub2c8\ub2e4.  \ub0b4\uc6a9\uc744 \ubc88\uc5ed\ud55c \uacbd\uc6b0 \ubc88\uc5ed\ub41c \ubcf4\uae30 \ud30c\uc77c\uc740 \ub3d9\uc77c\ud55c \uc704\uce58\uc5d0 \uae30\ubcf8 \ubcf4\uae30 \ud30c\uc77c\uacfc \ud568\uaed8 \uc788\uc5b4\uc57c \ud558\uba70 \uadf8\uc5d0 \ub530\ub77c \ub85c\ucf00\uc77c\ub85c \ud0dc\uadf8 \ucc98\ub9ac\ub418\uc5b4\uc57c \ud569\ub2c8\ub2e4.</p><p>\uc790\uc138\ud55c \ub0b4\uc6a9\uc740 \uad00\ub9ac \ubb38\uc11c\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.</p>
config.subsfilename=<contextual_help>\ud1a0\ud070 \uad50\uccb4 \ud30c\uc77c</contextual_help>(\uc120\ud0dd \uc0ac\ud56d):
config.subsfilename.help.title=\ud1a0\ud070 \uad50\uccb4 \ud30c\uc77c \uad6c\uc131 \uc911
config.subsfilename.help.content=<p>\uc0ac\uc6a9\uc790 \ubcf4\uae30 \ud30c\uc77c\uc5d0 <code>{\ud3ec\ud568:<i>\ud0a4</i>}</code> \ud1a0\ud070\uc744 \uc0ac\uc6a9\ud558\uc9c0 \uc54a\uc744 \uacbd\uc6b0 \uc774 \ud56d\ubaa9\uc744 \ube44\uc6cc\ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.</p><p>\uc0ac\uc6a9\uc790 \ubcf4\uae30 \ud30c\uc77c\uc5d0 \ud574\ub2f9 \ud1a0\ud070\uc744 \uc0ac\uc6a9\ud560 \uacbd\uc6b0 \uc5ec\uae30\uc5d0 \ud1a0\ud070 \uad50\uccb4 \ud30c\uc77c \uc774\ub984\uc744 \uc785\ub825\ud558\uc2ed\uc2dc\uc624. \uc608: <code>myViewFileIncludes.properties</code>.</p><p>\uc774 \ud30c\uc77c\uc5d0\ub294 \uc0ac\uc6a9\uc790 \ubcf4\uae30 \ud30c\uc77c\uc5d0 <code>{\ud3ec\ud568:<i>\ud0a4</i>}</code> \ud1a0\ud070\uc744 \ub80c\ub354\ub9c1\ud558\ub294 \uacbd\uc6b0 \ud3ec\ud2c0\ub9bf\uc5d0 \uc0bd\uc785\ud560 \ud0a4 \uac12 \uc30d\uc774 \ub4e4\uc5b4 \uc788\uc2b5\ub2c8\ub2e4.  \ud30c\uc77c \uc774\ub984\uc744 \uc785\ub825\ud558\uc9c0 \uc54a\uc740 \uacbd\uc6b0 <code>html_viewer_includes.properties</code>\ub77c\ub294 \ud30c\uc77c\uc774 \uac00\uc815\ub429\ub2c8\ub2e4.</p><p>\uc774 \ud30c\uc77c\uc740 \uc774 \ud074\ub7ec\uc2a4\ud130\uc758 \uac01 \ud3ec\ud138\ub9bf \uc11c\ubc84 \ubc0f classpath\uc758 \ud3f4\ub354\uc5d0 \uc874\uc7ac\ud574\uc57c \ud569\ub2c8\ub2e4(\uc608: "\uae00\ub85c\ubc8c \ub9ac\uc18c\uc2a4" \ud3f4\ub354). (\uc544\ub2c8\uba74, \ud30c\uc77c\uc774 <code>/WEB-INF/classes</code> \ud3f4\ub354\uc758 \ud3ec\ud138\ub9bf WAR \ub0b4\ubd80\uc5d0 \uc874\uc7ac\ud560 \uc218 \uc788\uc2b5\ub2c8\ub2e4.) \ud558\uc704 \ud3f4\ub354\ub97c \uc0ac\uc6a9\ud560 \uacbd\uc6b0 \ud1a0\ud070 \uad50\uccb4 \ud30c\uc77c \uc774\ub984\uc740 \ud574\ub2f9 \ud558\uc704 \ud3f4\ub354 \uacbd\ub85c\ub85c \uc2dc\uc791\ub418\uc5b4\uc57c \ud569\ub2c8\ub2e4.</p><p>\uc790\uc138\ud55c \ub0b4\uc6a9\uc740 \uad00\ub9ac \ubb38\uc11c\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.</p>
config.launchbuttonless=<contextual_help>\ub2e8\ucd94 \uc5c6\ub294 \uc0c8 \ucc3d</contextual_help>\uc758 \ub9c1\ud06c\ub97c \uc5ec\uc2dc\uaca0\uc2b5\ub2c8\uae4c?
config.launchbuttonless.help.title=\ub2e8\ucd94 \uc5c6\ub294 \uc0c8 \ucc3d\uc758 \ub9c1\ud06c \uc5f4\uae30
config.launchbuttonless.help.content=\uc774 \uc635\uc158\uc744 \ud45c\uc2dc\ud560 \uacbd\uc6b0 \ud3ec\ud2c0\ub9bf\uc5d0\uc11c \ud45c\uc2dc\ub418\ub294 \ubcf4\uae30 \ud30c\uc77c \ub0b4\uc6a9\uc758 \ubaa8\ub4e0 \ud558\uc774\ud37c\ub9c1\ud06c\uac00 \ub2e8\ucd94 \uc5c6\ub294 \uc0c8 \ud558\uc704 \ucc3d\uc5d0\uc11c \uc5f4\ub9bd\ub2c8\ub2e4.  \uc774 \uc635\uc158\uc744 \ud45c\uc2dc\ud558\uc9c0 \uc54a\uc744 \uacbd\uc6b0 \ud604\uc7ac \ucc3d\uc5d0\uc11c \uc5f4\ub9bd\ub2c8\ub2e4.  \uc790\uc138\ud55c \ub0b4\uc6a9\uc740 \uad00\ub9ac \ubb38\uc11c\ub97c \ucc38\uc870\ud558\uc2ed\uc2dc\uc624.
config.okbutton=\uc800\uc7a5
info.saved=\ubcc0\uacbd \uc0ac\ud56d\uc774 \uc800\uc7a5\ub418\uc5c8\uc2b5\ub2c8\ub2e4.

# messages for view mode 
# (none)

# messages for error handling
error.code=(\uc624\ub958: {0})
error.message=\uc624\ub958:
error.internal=\uc694\uccad\ud55c \uc11c\ube44\uc2a4 \ub610\ub294 \uc815\ubcf4\ub97c \ud604\uc7ac \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4. \ub098\uc911\uc5d0 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
error.nullFile=\uc694\uccad\ud55c \uc11c\ube44\uc2a4 \ub610\ub294 \uc815\ubcf4\ub97c \ud604\uc7ac \uc0ac\uc6a9\ud560 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \ub098\uc911\uc5d0 \ub2e4\uc2dc \uc2dc\ub3c4\ud558\uc2ed\uc2dc\uc624.
error.nullFilename=\ubcf4\uae30 \ud30c\uc77c \uc774\ub984\uc740 \ube44\uc6cc \ub458 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc544\ub798 \ub0b4\uc6a9\uc744 \uc218\uc815\ud558\uc2ed\uc2dc\uc624.
error.pathInFilename=\ubcf4\uae30 \ud30c\uc77c \uc774\ub984\uc5d0\ub294 \uc0c1\uc704 \ub514\ub809\ud1a0\ub9ac \uacbd\ub85c(\uc608: <code>..</code> \ucc38\uc870)\uac00 \ud3ec\ud568\ub420 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc544\ub798 \ub0b4\uc6a9\uc744 \uc218\uc815\ud558\uc2ed\uc2dc\uc624.
#
warn.message=\uacbd\uace0:
warn.nullFile=\uc544\ub798 \uc774\ub984\uc758 \ubcf4\uae30 \ud30c\uc77c\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc774\ubbf8 \uc0dd\uc131\ud558\uc5ec \uc124\uce58\ud588\uc2b5\ub2c8\uae4c?
warn.nullSubsFile=\uc544\ub798 \uc774\ub984\uc758 \ud1a0\ud070 \uad50\uccb4 \ud30c\uc77c\uc744 \ucc3e\uc744 \uc218 \uc5c6\uc2b5\ub2c8\ub2e4.  \uc774\ubbf8 \uc0dd\uc131\ud558\uc5ec \uc124\uce58\ud588\uc2b5\ub2c8\uae4c?
