# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Datoteka za prikaz:
config.viewfilename.help.title=Konfiguriranje datoteke za prikaz
config.viewfilename.help.content=<p>Vnesite osnovno ime (vklju\u010dno z dodatkom) datoteke, ki jo \u017eelite prikazati.  Na primer <code>myViewFile.html</code>.</p><p>To je datoteka z vsebino, katero \u017eelite prikazati v dverih, poleg tega pa mora obstajati.  Ta datoteka bi morala biti v vsakem stre\u017eniku za dveri v tej gru\u010di, v mapi paketa za vire dveri ali pa v njeni podmapi.  (Lahko pa datoteka obstaja v korenski mapi oziroma v njeni podmapi znotraj dveri WAR.)  \u010ce uporabite podmapo, bi prikazano ime mape moralo vklju\u010devati pot do te podmape.  Na primer <code>myFiles/myViewFile.html</code>.</p><p>Vsebina datoteke bi za osnovno podro\u010dno nastavitev morala biti lokalizirana.  \u010ce ste prevedli vsebino, bi morale biti prevedene datoteke za prikaz na isti lokaciji kot osnovna datoteka za prikaz, morale pa bi biti tudi ozna\u010dene z ustreznimi lokalnimi nastavitvami.</p><p>Ve\u010d informacij najdete v skrbni\u0161kem dokumentu.</p>
config.subsfilename=Poljubna <contextual_help>datoteka, ki vsebuje nekaj</contextual_help>:
config.subsfilename.help.title=Konfiguriranje datoteke, ki vsebuje nekaj
config.subsfilename.help.content=<p>To polje lahko pustite prazno razen, \u010de va\u0161a datoteka za prikaz uporablja \u017eeton <code>{INCLUDE:<i>key</i>}</code>. </p><p>\u010ce datoteka za prikaz uporablja ta \u017eeton, tukaj vnesite ime datoteke, ki vsebuje nekaj. Na primer <code>myViewFileIncludes.properties</code>.</p><p>To je datoteka s klju\u010dnimi pari, za katere \u017eelite, da jih dveri vstavijo, ko v va\u0161i datoteki za prikaz naletijo na \u017eeton <code>{INCLUDE:<i>key</i>}</code>.  \u010ce ne vnesete imena datoteke, se ustvari datoteka z imenom <code>html_viewer_includes.properties</code>.</p><p>Datoteka bi morala biti v vsakem stre\u017eniku za dveri v tej gru\u010di, v mapi s spremenljivko classpath (na primer, v mapi \u00bbglobalni viri\u00ab), v mapi paketa za vire dveri ali v sami dveri WAR. \u010ce uporabite podmapo, bi se ime datoteke, ki vsebuje nekaj, moralo za\u010deti s potjo do te podmape.</p><p>Ve\u010d informacij najdete v skrbni\u0161ki dokumentaciji.</p>
config.launchbuttonless=\u017delite odpreti povezave v <contextual_help>novem oknu brez gumbov</contextual_help>?
config.launchbuttonless.help.title=Odpiranje povezav v novem oknu brez gumbov
config.launchbuttonless.help.content=\u010ce ozna\u010dite to mo\u017enost, se bodo vse hiperpovezave iz vsebine datoteke za prikaz, ki je prikazana v dverih, odprle v novem podrejenem oknu brez gumbov.  \u010ce ne ozna\u010dite te mo\u017enosti, se bodo odprle v trenutnem oknu.  Ve\u010d informacij najdete v skrbni\u0161kem dokumentu.
config.checkseconds.text1=<contextual_help>Trajanje predpomnilnika:</contextual_help>
config.checkseconds.text2=sekund
config.checkseconds.help.title=Konfiguriranje trajanja predpomnilnika
config.checkseconds.help.content=<p>S to mo\u017enostjo lahko dolo\u010dite, da dveri dolo\u010den \u010das uporabljajo predpomnilnik za zgornje podatke. Predpomnilnik bo vseboval zgoraj navedene mo\u017enosti konfiguracije, poleg tega pa tudi vsebino prikaza in zgoraj imenovane datoteke, ki vsebujejo nekaj. To lahko izbolj\u0161a delovanje dveri pri veliki obremenitvi.</p><p>\u010ce \u017eelite omogo\u010diti predpomnilnik za dolo\u010deno \u0161tevilo sekund, vnesite to \u0161tevilko \u2013 npr. <code>900</code> za 15 minut. \u010ce \u017eelite predpomnilnik omogo\u010diti za vedno, vnesite <code>-1</code>. \u010ce \u017eelite onemogo\u010diti predpomnilnik, vnesite <code>0</code> ali pustite mo\u017enost prazno.</p><p>V vsakem primeru, ko na tej strani kliknete <b>Shrani</b>, se bo obstoje\u010di predpomnilnik izbrisal. Tako se bodo spremembe, ki jih shranite tukaj, uporabile takoj. Predpomnilnik se po\u010disti tudi ko znova za\u017eenete dveri.</p>
config.okbutton=Shrani
info.saved=Spremembe so shranjene.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Napaka: {0})
error.message=Napaka:
error.input=Pri podatkih, ki ste jih vnesli, je pri\u0161lo do te\u017eav.
error.internal=Storitev ali informacije, ki ste jih \u017eeleli, trenutno niso na voljo. Poskusite znova pozneje.
error.nullFile=Storitev ali informacije, ki ste jih \u017eeleli, trenutno niso na voljo.  Poskusite znova pozneje.
error.nullFilename=Ime datoteke za prikaz mora biti dolo\u010deno.  Popravite spodaj.
error.pathInFilename=Ime datoteke za prikaz ne sme vsebovati poti do glavne mape (npr. zveze <code>..</code>).  Popravite spodaj.
error.pathInSubsFilename=Ime datoteke, ki vsebuje nekaj, ne sme vsebovati poti do glavne mape (npr. zveze <code>..</code>).  Popravite spodaj.
error.checkSecondsValue=Trajanje predpomnilnika mora biti izra\u017eeno v celem \u0161tevilu sekund.  Popravite spodaj.
error.notSaved=Spremembe niso bile shranjene.
#
warn.message=Opozorilo:
warn.nullFile=Imena datoteke za prikaz ni mogo\u010de najti ali prebrati.  Ali ste jo \u017ee ustvarili in namestili?
warn.nullSubsFile=Imena datoteke, ki vsebuje nekaj, ni mogo\u010de najti ali prebrati.  Ali ste jo \u017ee ustvarili in namestili?
