# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=S\u00fabor zobrazenia:
config.viewfilename.help.title=Konfigur\u00e1cia s\u00faboru zobrazenia
config.viewfilename.help.content=<p>Zadajte z\u00e1kladn\u00fd n\u00e1zov (vr\u00e1tane pr\u00edpony) s\u00faboru zobrazenia.  Napr\u00edklad <code>myViewFile.html</code>.</p><p>V tomto s\u00fabore sa nach\u00e1dza obsah, ktor\u00fd m\u00e1 portlet zobrazova\u0165. S\u00fabor mus\u00ed existova\u0165.  Tento s\u00fabor by mal existova\u0165 na ka\u017edom portletovom serveri tohto klastra, v prie\u010dinku so zv\u00e4zkami zdrojov portletu alebo v jeho podprie\u010dinku.  (S\u00fabor v\u0161ak m\u00f4\u017ee existova\u0165 aj v kore\u0148ovom prie\u010dinku alebo jeho podprie\u010dinku, ktor\u00e9 sa nach\u00e1dzaj\u00fa v portlete WAR.)  Ak pou\u017e\u00edvate podprie\u010dinok, n\u00e1zov s\u00faboru zobrazenia by mal obsahova\u0165 t\u00fato cestu k podprie\u010dinku.  Napr\u00edklad <code>myFiles/myViewFile.html</code>.</p><p>Obsah s\u00faboru by mal by\u0165 lokalizovan\u00fd pod\u013ea miestnych nastaven\u00ed.  Ak ste obsah prelo\u017eili, prelo\u017een\u00e9 s\u00fabory zobrazenia by sa mali vz\u0165ahova\u0165 na z\u00e1kladn\u00fd s\u00fabor zobrazenia v tom istom umiestnen\u00ed a mali by by\u0165 ozna\u010den\u00e9 v s\u00falade s miestnymi nastaveniami.</p><p>\u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.</p>
config.subsfilename=Volite\u013en\u00fd <contextual_help>s\u00fabor zahrnutia</contextual_help>:
config.subsfilename.help.title=Konfigur\u00e1cia s\u00faboru zahrnutia
config.subsfilename.help.content=<p>Ak s\u00fabor zobrazenia nepou\u017e\u00edva token <code>{INCLUDE:<i>key</i>}</code>, m\u00f4\u017eete necha\u0165 t\u00fato mo\u017enos\u0165 pr\u00e1zdnu.</p><p>Ak s\u00fabor zobrazenia pou\u017e\u00edva token, zadajte n\u00e1zov s\u00faboru zahrnutia na toto miesto. Napr\u00edklad <code>myViewFileIncludes.properties</code>.</p><p>Tento s\u00fabor obsahuje p\u00e1ry k\u013e\u00fa\u010d-hodnota, ktor\u00e9 m\u00e1 portlet vlo\u017ei\u0165 pri vykres\u013eovan\u00ed tokenov <code>{INCLUDE:<i>key</i>}</code> v s\u00fabore zobrazenia.  Ak n\u00e1zov s\u00faboru nezad\u00e1te, predpokladan\u00fd n\u00e1zov s\u00faboru bude <code>html_viewer_includes.properties</code>.</p><p>S\u00fabor by mal existova\u0165 v ka\u017edom portletovom serveri tohto klastra, v prie\u010dinku v r\u00e1mci cesty k skupine (napr\u00edklad v prie\u010dinku Glob\u00e1lne zdroje), v prie\u010dinku so zv\u00e4zkami zdrojov portletu alebo v portlete WAR. Ak pou\u017e\u00edvate podprie\u010dinok, n\u00e1zov s\u00faboru zahrnutia sa m\u00f4\u017ee za\u010d\u00edna\u0165 touto cestou k podprie\u010dinku.</p><p>\u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.</p>
config.launchbuttonless=Chcete otvori\u0165 prepojenia v <contextual_help>novom okne bez tla\u010didiel</contextual_help>?
config.launchbuttonless.help.title=Otvorenie prepojen\u00ed v novom okne bez tla\u010didiel
config.launchbuttonless.help.content=Ak za\u010diarknete t\u00fato mo\u017enos\u0165, v\u0161etky hypertextov\u00e9 prepojenia v obsahu s\u00faboru zobrazenia zobrazovan\u00e9 prostredn\u00edctvom portletu sa otvoria v novom podriadenom okne bez tla\u010didiel.  Ak t\u00fato mo\u017enos\u0165 neza\u010diarknete, otvoria sa v aktu\u00e1lnom okne.  \u010eal\u0161ie inform\u00e1cie z\u00edskate v dokumente o spr\u00e1ve.
config.checkseconds.text1=<contextual_help>Trvanie vyrovn\u00e1vacej pam\u00e4te:</contextual_help>
config.checkseconds.text2=s
config.checkseconds.help.title=Konfigur\u00e1cia d\u013a\u017eky ukladania do vyrovn\u00e1vacej pam\u00e4te
config.checkseconds.help.content=<p>Mo\u017enos\u0165 uveden\u00e1 vy\u0161\u0161ie ur\u010duje, ako dlho maj\u00fa by\u0165 \u00fadaje ukladan\u00e9 do vyrovn\u00e1vacej pam\u00e4te portletom. Vyrovn\u00e1vacia pam\u00e4\u0165 obsahuje mo\u017enosti konfigur\u00e1cie uveden\u00e9 vy\u0161\u0161ie a obsah s\u00faborov zobrazenia a zahrnutia pomenovan\u00fdch vy\u0161\u0161ie. T\u00fdm sa zlep\u0161\u00ed v\u00fdkon portletu pri vysokom za\u0165a\u017een\u00ed.</p><p>Ak chcete povoli\u0165 ukladanie do vyrovn\u00e1vacej pam\u00e4te na nieko\u013eko sek\u00fand, zadajte \u010d\u00edslo, ako napr\u00edklad <code>900</code>, \u010do zodpoved\u00e1 15 min\u00fatam. Ak chcete povoli\u0165 ukladanie do vyrovn\u00e1vacej pam\u00e4te, zadajte \u010d\u00edseln\u00fd k\u00f3d <code>-1</code>.  Ak chcete zru\u0161i\u0165 ukladanie do vyrovn\u00e1vacej pam\u00e4te, zadajte \u010d\u00edseln\u00fd k\u00f3d <code>0</code> alebo nechajte t\u00fato mo\u017enos\u0165 pr\u00e1zdnu.</p><p>Kliknutie na polo\u017eku <b>Save</b> na tejto str\u00e1nke znamen\u00e1 v\u017edy vymazanie s\u00fa\u010dasn\u00e9ho obsahu vyrovn\u00e1vacej pam\u00e4te.  Zmeny, ktor\u00e9 vykon\u00e1te tu, sa prejavia okam\u017eite. Vyrovn\u00e1vacia pam\u00e4\u0165 sa vyma\u017ee aj po re\u0161tartovan\u00ed portletu.</p>
config.okbutton=Ulo\u017ei\u0165
info.saved=Zmeny boli ulo\u017een\u00e9.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Chyba: {0})
error.message=Chyba:
error.input=V zadan\u00fdch \u00fadajoch sa vyskytla chyba.
error.internal=Po\u017eadovan\u00e1 slu\u017eba alebo inform\u00e1cia nie s\u00fa moment\u00e1lne k dispoz\u00edcii. Sk\u00faste to znova nesk\u00f4r.
error.nullFile=Po\u017eadovan\u00e1 slu\u017eba alebo inform\u00e1cia nie s\u00fa moment\u00e1lne k dispoz\u00edcii.  Sk\u00faste to znova nesk\u00f4r.
error.nullFilename=S\u00fabor zobrazenia nem\u00f4\u017ee by\u0165 pr\u00e1zdny.  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
error.pathInFilename=S\u00fabor zobrazenia nesmie obsahova\u0165 \u017eiadnu nadraden\u00fa cestu adres\u00e1ra (napr. odkaz <code>..</code>).  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
error.pathInSubsFilename=S\u00fabor zahrnutia nesmie obsahova\u0165 \u017eiadnu nadraden\u00fa cestu adres\u00e1ra (napr. odkaz <code>..</code>).  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
error.checkSecondsValue=Trvanie vyrovn\u00e1vacej pam\u00e4te mus\u00ed by\u0165 zadan\u00e9 vo forme cel\u00e9ho \u010d\u00edsla a v sekund\u00e1ch.  Opravy vykonajte v \u010dasti ni\u017e\u0161ie.
error.notSaved=Zmeny neboli ulo\u017een\u00e9.
#
warn.message=Upozornenie:
warn.nullFile=S\u00fabor zobrazenia, nach\u00e1dzaj\u00faci sa ni\u017e\u0161ie, nie je mo\u017en\u00e9 n\u00e1js\u0165 ani na\u010d\u00edta\u0165.  U\u017e ste ho vytvorili a nain\u0161talovali?
warn.nullSubsFile=S\u00fabor zahrnutia, nach\u00e1dzaj\u00faci sa ni\u017e\u0161ie, nie je mo\u017en\u00e9 n\u00e1js\u0165 ani na\u010d\u00edta\u0165.  U\u017e ste ho vytvorili a nain\u0161talovali?
