# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Katselutiedosto:
config.viewfilename.help.title=Katselutiedoston m\u00e4\u00e4ritt\u00e4minen
config.viewfilename.help.content=<p>Anna katselutiedoston kantanimi (mukaan lukien tiedostotunniste).  Esimerkiksi <code>omaKatselutiedosto.html</code>.</p><p>T\u00e4ss\u00e4 tiedostossa on sis\u00e4lt\u00f6, jonka haluat portletin n\u00e4ytt\u00e4v\u00e4n. Tiedoston on oltava olemassa.  T\u00e4m\u00e4n tiedoston on sijaittava jokaisessa t\u00e4m\u00e4n klusterin portlettipalvelimessa, portletin resurssipaketin kansiossa tai sen alikansiossa.  (Tiedosto voi sijaita my\u00f6s portletin WAR-paketin juurikansiossa tai sen alikansiossa.) Jos k\u00e4yt\u00e4t alikansiota, katselutiedoston nimess\u00e4 pit\u00e4\u00e4 olla kyseisen alikansion polku.  Esimerkiksi <code>tiedostot/omaKatselutiedosto.html</code>.</p><p>Tiedoston sis\u00e4lt\u00f6 pit\u00e4\u00e4 lokalisoida k\u00e4ytetylle kielelle.  Jos olet k\u00e4\u00e4nt\u00e4nyt sis\u00e4ll\u00f6n, k\u00e4\u00e4nnettyjen katselutiedostojen pit\u00e4\u00e4 olla samassa sijainnissa kuin kantakatselutiedoston ja ne pit\u00e4\u00e4 merkit\u00e4 tunnisteilla kielen mukaisesti.</p><p>Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.</p>
config.subsfilename=Valinnainen <contextual_help>sis\u00e4lt\u00e4\u00e4-tiedosto</contextual_help>:
config.subsfilename.help.title=Sis\u00e4lt\u00e4\u00e4-tiedoston m\u00e4\u00e4ritt\u00e4minen
config.subsfilename.help.content=<p>Ellei katselutiedostosi k\u00e4yt\u00e4 <code>{INCLUDE:<i>key</i>}</code>-paikkamerkki\u00e4, t\u00e4m\u00e4n kohdan voi j\u00e4tt\u00e4\u00e4 tyhj\u00e4ksi.</p><p>Jos katselutiedostosi k\u00e4ytt\u00e4\u00e4 mainittua paikkamerkki\u00e4, kirjoita sis\u00e4lt\u00e4\u00e4-tiedoston nimi t\u00e4h\u00e4n. Esimerkiksi <code>omaKatselutiedostoSis\u00e4lt\u00e4\u00e4.ominaisuudet</code>.</p><p>T\u00e4m\u00e4 tiedosto sis\u00e4lt\u00e4\u00e4 avainarvoparit, jotka haluat portletin asettavan paikoilleen renderoidessaan <code>{INCLUDE:<i>key</i>}</code>-paikkamerkkej\u00e4 katselutiedostossasi.  Jos et anna tiedostonime\u00e4, k\u00e4ytett\u00e4v\u00e4n tiedoston oletuksena on <code>html_viewer_includes.properties</code>.</p><p>Tiedoston on sijaittava jokaisessa t\u00e4m\u00e4n klusterin portlettipalvelimessa, luokkapolun kansiossa (esimerkiksi Yleiset resurssit -kansiossa), portletin resurssipaketin kansiossa tai portletin WAR-paketissa itsess\u00e4\u00e4n. Jos k\u00e4yt\u00e4t alikansiota, sis\u00e4lt\u00e4\u00e4-tiedoston nimen pit\u00e4\u00e4 alkaa alikansion polulla.</p><p>Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.</p>
config.launchbuttonless=Avaa linkit <contextual_help>uudessa painikkeettomassa ikkunassa</contextual_help>?
config.launchbuttonless.help.title=Linkkien avaaminen uudessa painikkeettomassa ikkunassa
config.launchbuttonless.help.content=Jos valitset t\u00e4m\u00e4n asetuksen, portletti avaa katselutiedoston sis\u00e4lt\u00e4m\u00e4t hyperlinkit uuteen alaikkunaan, jossa ei ole painikkeita.  Jos et valitse t\u00e4t\u00e4 asetusta, linkit avataan nykyiseen ikkunaan.  Lis\u00e4tietoja on hallintatietojen k\u00e4ytt\u00f6oppaassa.
config.checkseconds.text1=<contextual_help>V\u00e4limuistin kesto:</contextual_help>
config.checkseconds.text2=sekuntia
config.checkseconds.help.title=V\u00e4limuistin keston m\u00e4\u00e4ritt\u00e4minen
config.checkseconds.help.content=<p>T\u00e4m\u00e4n asetuksen avulla m\u00e4\u00e4ritet\u00e4\u00e4n, kuinka pitk\u00e4\u00e4n portletti s\u00e4ilytt\u00e4\u00e4 yll\u00e4 olevat tiedot v\u00e4limuistissaan. V\u00e4limuisti sis\u00e4lt\u00e4\u00e4 yll\u00e4 olevat m\u00e4\u00e4ritykset sek\u00e4 yll\u00e4 nimettyjen katselu- ja sis\u00e4lt\u00e4\u00e4-tiedostojen sis\u00e4ll\u00f6n. T\u00e4m\u00e4 saattaa parantaa portletin toimintaa raskaan kuormituksen aikana.</p><p>Anna arvoksi sekuntim\u00e4\u00e4r\u00e4, jonka ajan haluat tietojen s\u00e4ilyv\u00e4n v\u00e4limuistissa \u2013 esimerkiksi <code>900</code>, jos haluat v\u00e4limuistin keston olevan 15 minuuttia. Jos haluat, ett\u00e4 tiedot s\u00e4ilyv\u00e4t v\u00e4limuistissa pysyv\u00e4sti, anna arvoksi <code>-1</code>. Jos haluat poistaa v\u00e4limuistin k\u00e4yt\u00f6st\u00e4, anna arvoksi <code>0</code> tai j\u00e4t\u00e4 kohta tyhj\u00e4ksi.</p><p>V\u00e4limuisti tyhjennet\u00e4\u00e4n joka tapauksessa aina, kun t\u00e4ll\u00e4 sivulla valitaan <b>Tallenna</b>. T\u00e4m\u00e4n vuoksi tallentamasi muutokset tulevat voimaan heti. V\u00e4limuisti tyhjennet\u00e4\u00e4n my\u00f6s silloin, kun portletti k\u00e4ynnistet\u00e4\u00e4n uudelleen.</p>
config.okbutton=Tallennus
info.saved=Tekem\u00e4si muutokset on tallennettu.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Virhe: {0})
error.message=Virhe:
error.input=Annetuissa tiedoissa on ongelma.
error.internal=Haluamasi palvelu tai tieto ei ole t\u00e4ll\u00e4 hetkell\u00e4 saatavilla. Yrit\u00e4 my\u00f6hemmin uudelleen.
error.nullFile=Haluamasi palvelu tai tieto ei ole t\u00e4ll\u00e4 hetkell\u00e4 saatavilla.  Yrit\u00e4 my\u00f6hemmin uudelleen.
error.nullFilename=Katselutiedoston nimi ei voi olla tyhj\u00e4.  Korjaa kohta alla.
error.pathInFilename=Katselutiedoston nimi ei voi sis\u00e4lt\u00e4\u00e4 mink\u00e4\u00e4n yl\u00e4kansion polkua (eli <code>..</code> -viittausta).  Korjaa kohta alla.
error.pathInSubsFilename=Sis\u00e4lt\u00e4\u00e4-tiedoston nimi ei voi sis\u00e4lt\u00e4\u00e4 mink\u00e4\u00e4n yl\u00e4kansion polkua (eli <code>..</code> -viittausta).  Korjaa kohta alla.
error.checkSecondsValue=V\u00e4limuistin keston on koostuttava kokonaisista sekunneista.  Korjaa kohta alla.
error.notSaved=Tekemi\u00e4si muutoksia ei ole tallennettu.
#
warn.message=Varoitus:
warn.nullFile=Alla nimetty\u00e4 katselutiedostoa ei l\u00f6ydy tai sit\u00e4 ei voida lukea.  Oletko luonut ja asentanut sit\u00e4 viel\u00e4?
warn.nullSubsFile=Alla nimetty\u00e4 sis\u00e4lt\u00e4\u00e4-tiedostoa ei l\u00f6ydy tai sit\u00e4 ei voida lukea.  Oletko luonut ja asentanut sit\u00e4 viel\u00e4?
