# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Fichier de visualisation :
config.viewfilename.help.title=Configuration d'un fichier de visualisation
config.viewfilename.help.content=<p>Entrez le nom de base (avec son extension) du fichier de visualisation.  Par exemple, <code>monFichierVisualisation.html</code>.</p><p>Ce fichier contient tout ce qui doit \u00eatre affich\u00e9 par le portlet et doit exister.  Ce fichier doit \u00eatre pr\u00e9sent sur chaque serveur de portlets du cluster, dans le dossier de l'ensemble des ressources du portlet ou dans un de ses sous-dossiers.  (Sinon, le fichier peut se trouver dans le dossier racine, ou un de ses sous-dossiers, \u00e0 l'int\u00e9rieur m\u00eame du fichier WAR du portlet.)  Si vous utilisez un sous-dossier, son chemin doit \u00eatre inclus dans le nom du fichier de visualisation.  Par exemple, <code>mesFichiers/monFichierVisualisation.html</code>.</p><p>Le contenu du fichier doit \u00eatre localis\u00e9 pour les param\u00e8tres r\u00e9gionaux de base.  Si vous avez traduit le contenu, les fichiers de visualisation traduits doivent \u00eatre situ\u00e9s dans le m\u00eame emplacement que le fichier de visualisation de base et ils doivent \u00eatre identifi\u00e9s en tant que param\u00e8tres r\u00e9gionaux.</p><p>Reportez-vous au document administratif pour plus d'informations.</p>
config.subsfilename=<contextual_help>Fichier includes</contextual_help> facultatif :
config.subsfilename.help.title=Configuration d'un fichier includes
config.subsfilename.help.content=<p>Sauf si votre fichier utilise le jeton <code>{INCLUDE:<i>key</i>}</code>, vous pouvez laisser cette zone vide.</p><p>Si votre fichier de visualisation utilise ce jeton, entrez ici le nom du fichier includes correspondant. Par exemple, <code>monFichierVisualisationInclut.properties</code>.</p><p>Ce fichier contient les paires cl\u00e9-valeur que le portlet doit ins\u00e9rer lors du rendu des jetons <code>{INCLUDE:<i>key</i>}</code> dans le fichier de visualisation.  Si vous n'indiquez pas de nom de fichier, le programme s\u00e9lectionne par d\u00e9faut un fichier nomm\u00e9 <code>html_viewer_includes.properties</code>.</p><p>Le fichier doit exister sur chaque serveur de portlet de ce cluster, dans un dossier du chemin de classes (par exemple votre dossier "ressources globales"), au sein du dossier de l'ensemble des ressources du portlet ou dans le portlet WAR. Si vous utilisez un sous-dossier, le nom du fichier includes doit commencer par le chemin correspondant.</p><p>Reportez-vous \u00e0 la documentation d'administration pour plus d'informations.</p>
config.launchbuttonless=Ouvrir dans <contextual_help>une nouvelle fen\u00eatre sans bouton</contextual_help>\u00a0?
config.launchbuttonless.help.title=Ouverture dans une nouvelle fen\u00eatre sans bouton
config.launchbuttonless.help.content=Si vous cochez cette option, tous les hyperliens du fichier de visualisation affich\u00e9s par le portlet s'ouvriront dans une nouvelle fen\u00eatre fille sans bouton.  Si vous ne cochez pas cette option, ils s'ouvriront dans la fen\u00eatre en cours.  Consultez le document administratif pour plus d'informations.
config.checkseconds.text1=<contextual_help>Dur\u00e9e de la mise en cache\u00a0:</contextual_help>
config.checkseconds.text2=secondes
config.checkseconds.help.title=Configuration de la dur\u00e9e de mise en cache
config.checkseconds.help.content=<p>Cette option vous permet d'indiquer une p\u00e9riode durant laquelle les donn\u00e9es ci-dessus seront mises en cache par le portlet. Le cache conservera les options de configuration d\u00e9finies ci-dessus ainsi que le contenu du fichier de visualisation et du fichier includes mentionn\u00e9s ci-dessus. Ceci permet d'am\u00e9liorer les performances du portlet en cas de lourde charge.</p><p>Pour activer la mise en cache, entrez un nombre de secondes (par exemple, <code>900</code> correspond \u00e0 15\u00a0minutes). Pour une mise en cache illimit\u00e9e, saisissez <code>-1</code>. Pour d\u00e9sactiver la mise en cache, saisissez <code>0</code> ou laissez le champ vide.</p><p>Quel que soit votre choix, lorsque vous cliquerez sur l'option <b>Enregistrer</b> de cette page, le cache existant sera nettoy\u00e9. Les modifications que vous enregistrez prendront effet imm\u00e9diatement. Le cache est \u00e9galement nettoy\u00e9 \u00e0 chaque fois que le portlet est red\u00e9marr\u00e9.</p>
config.okbutton=Enregistrer
info.saved=Vos modifications ont \u00e9t\u00e9 enregistr\u00e9es.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Erreur\u00a0: {0})
error.message=Erreur :
error.input=Un probl\u00e8me est survenu avec les donn\u00e9es que vous avez saisies.
error.internal=Le service ou l'information que vous avez demand\u00e9(e) n'est pas disponible actuellement. Veuillez r\u00e9essayer ult\u00e9rieurement.
error.nullFile=Le service ou l'information que vous avez demand\u00e9(e) n'est pas disponible actuellement.  Veuillez r\u00e9essayer ult\u00e9rieurement.
error.nullFilename=Le nom du fichier de visualisation ne doit pas \u00eatre vide.  Corrigez-le ci-dessous.
error.pathInFilename=Le nom du fichier de visualisation ne doit contenir aucun chemin de r\u00e9pertoire racine, c'est-\u00e0-dire aucune r\u00e9f\u00e9rence <code>..</code>.  Corrigez-le ci-dessous.
error.pathInSubsFilename=Le nom du fichier includes ne doit contenir aucun chemin de r\u00e9pertoire racine, c'est-\u00e0-dire aucune r\u00e9f\u00e9rence <code>..</code>.  Corrigez-le ci-dessous.
error.checkSecondsValue=La dur\u00e9e de la mise en cache doit \u00eatre exprim\u00e9e sous la forme d'un nombre entier de secondes.  Corrigez-le ci-dessous.
error.notSaved=Vos modifications n'ont pas \u00e9t\u00e9 enregistr\u00e9es.
#
warn.message=Avertissement :
warn.nullFile=Impossible de trouver ou de lire le fichier de visualisation mentionn\u00e9 ci-dessous.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
warn.nullSubsFile=Impossible de trouver ou de lire le fichier includes mentionn\u00e9 ci-dessous.  L'avez-vous d\u00e9j\u00e0 cr\u00e9\u00e9 et install\u00e9 ?
