# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u05e7\u05d5\u05d1\u05e5 \u05ea\u05e6\u05d5\u05d2\u05d4:
config.viewfilename.help.title=\u05e7\u05d1\u05d9\u05e2\u05ea \u05ea\u05e6\u05d5\u05e8\u05d4 \u05e9\u05dc \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4
config.viewfilename.help.content=<p>\u05d4\u05d6\u05df \u05d0\u05ea \u05e9\u05dd \u05d4\u05d1\u05e1\u05d9\u05e1 (\u05db\u05d5\u05dc\u05dc \u05e1\u05d9\u05d5\u05de\u05ea) \u05e9\u05dc \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4.  \u05dc\u05d3\u05d5\u05d2\u05de\u05d4, <code>myViewFile.html</code>.\u200f</p><p>\u05e7\u05d5\u05d1\u05e5 \u05d6\u05d4 \u05de\u05db\u05d9\u05dc \u05d0\u05ea \u05d4\u05ea\u05d5\u05db\u05df \u05e9\u05d1\u05e8\u05e6\u05d5\u05e0\u05da \u05dc\u05d4\u05e6\u05d9\u05d2 \u05d1\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d5\u05d0\u05d9\u05df \u05dc\u05de\u05d7\u05d5\u05e7 \u05d0\u05d5\u05ea\u05d5.  \u05e7\u05d5\u05d1\u05e5 \u05d6\u05d4 \u05e6\u05e8\u05d9\u05da \u05dc\u05d4\u05ea\u05e7\u05d9\u05d9\u05dd \u05d1\u05db\u05dc \u05e9\u05e8\u05ea \u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d1\u05d0\u05e9\u05db\u05d5\u05dc \u05d6\u05d4, \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05d4 \u05d1\u05d7\u05d1\u05d9\u05dc\u05ea \u05d4\u05de\u05e9\u05d0\u05d1\u05d9\u05dd \u05e9\u05dc \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d0\u05d5 \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05de\u05e9\u05e0\u05d4 \u05d1\u05ea\u05d5\u05db\u05d4.   (\u05dc\u05d7\u05dc\u05d5\u05e4\u05d9\u05df, \u05d4\u05e7\u05d5\u05d1\u05e5 \u05d9\u05db\u05d5\u05dc \u05dc\u05d4\u05ea\u05e7\u05d9\u05d9\u05dd \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05d4\u05d1\u05e1\u05d9\u05e1 \u05d0\u05d5 \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05de\u05e9\u05e0\u05d4 \u05d1\u05ea\u05d5\u05db\u05d4, \u05d1\u05e7\u05d5\u05d1\u05e5 \u05d4-WAR \u05e9\u05dc \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05e2\u05e6\u05de\u05d5.)  \u05d0\u05dd \u05ea\u05e9\u05ea\u05de\u05e9 \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05de\u05e9\u05e0\u05d4, \u05d5\u05d3\u05d0 \u05e9\u05e9\u05dd \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d9\u05db\u05d9\u05dc \u05d0\u05ea \u05e0\u05ea\u05d9\u05d1 \u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05d4\u05de\u05e9\u05e0\u05d4.  \u05dc\u05d3\u05d5\u05d2\u05de\u05d4, <code>myFiles/myViewFile.html</code>.\u200f</p><p>\u05e2\u05dc \u05ea\u05d5\u05db\u05df \u05d4\u05e7\u05d5\u05d1\u05e5 \u05dc\u05d4\u05d9\u05d5\u05ea \u05de\u05ea\u05d5\u05e8\u05d2\u05dd \u05d1\u05d4\u05ea\u05d0\u05dd \u05dc\u05de\u05d9\u05e7\u05d5\u05dd \u05d4\u05d1\u05e1\u05d9\u05e1.  \u05d0\u05dd \u05ea\u05e8\u05d2\u05de\u05ea \u05d0\u05ea \u05d4\u05ea\u05d5\u05db\u05df, \u05e2\u05dc \u05e7\u05d5\u05d1\u05e6\u05d9 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d4\u05de\u05ea\u05d5\u05e8\u05d2\u05de\u05d9\u05dd \u05dc\u05d4\u05d9\u05d5\u05ea \u05e6\u05de\u05d5\u05d3\u05d9\u05dd \u05dc\u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d4\u05d1\u05e1\u05d9\u05e1\u05d9 \u05d1\u05d0\u05d5\u05ea\u05d5 \u05de\u05d9\u05e7\u05d5\u05dd, \u05d5\u05d9\u05e9 \u05dc\u05ea\u05d9\u05d9\u05d2 \u05d0\u05d5\u05ea\u05dd \u05d1\u05de\u05d9\u05e7\u05d5\u05dd \u05d1\u05d4\u05ea\u05d0\u05dd.</p><p>\u05e2\u05d9\u05d9\u05df \u05d1\u05de\u05e1\u05de\u05da \u05d4\u05e0\u05d9\u05d4\u05d5\u05dc \u05dc\u05e7\u05d1\u05dc\u05ea \u05de\u05d9\u05d3\u05e2 \u05e0\u05d5\u05e1\u05e3.</p>
config.subsfilename=<contextual_help>\u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5</contextual_help> \u05d0\u05d5\u05e4\u05e6\u05d9\u05d5\u05e0\u05dc\u05d9:
config.subsfilename.help.title=\u05e7\u05d1\u05d9\u05e2\u05ea \u05ea\u05e6\u05d5\u05e8\u05d4 \u05e9\u05dc \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5
config.subsfilename.help.content=\u05d1\u05d0\u05e4\u05e9\u05e8\u05d5\u05ea\u05da \u05dc\u05d4\u05e9\u05d0\u05d9\u05e8 \u05d0\u05ea \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5 \u05e8\u05d9\u05e7 <p>\u05d0\u05dc\u05d0 \u05d0\u05dd \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05de\u05e9\u05ea\u05de\u05e9 \u05d1\u05e1\u05de\u05dc code>{INCLUDE:<i>key</i>}</code>>\u200f.</p><p>\u05d0\u05dd \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05de\u05e9\u05ea\u05de\u05e9 \u05d1\u05e1\u05de\u05dc \u05d6\u05d4, \u05d4\u05d6\u05df \u05d0\u05ea \u05d4\u05e9\u05dd \u05e2\u05d1\u05d5\u05e8 \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5 \u05db\u05d0\u05df. \u05dc\u05d3\u05d5\u05d2\u05de\u05d4, <code>myViewFileIncludes.properties</code>\u200f.</p><p>\u05e7\u05d5\u05d1\u05e5 \u05d6\u05d4 \u05de\u05db\u05d9\u05dc \u05d6\u05d5\u05d2\u05d5\u05ea \u05e9\u05dc \u05e2\u05e8\u05db\u05d9-\u05de\u05e4\u05ea\u05d7 \u05e9\u05d1\u05e8\u05e6\u05d5\u05e0\u05da \u05e9\u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d9\u05d6\u05d9\u05df \u05d1\u05e2\u05ea \u05e2\u05d9\u05d1\u05d5\u05d3 \u05d0\u05e1\u05d9\u05de\u05d5\u05e0\u05d9 \u05d4-<code>{INCLUDE:<i>key</i>}</code> \u05d1\u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05e9\u05d1\u05e8\u05e9\u05d5\u05ea\u05da.  \u05d0\u05dd \u05dc\u05d0 \u05ea\u05d6\u05d9\u05df \u05e9\u05dd \u05e7\u05d5\u05d1\u05e5, \u05d9\u05d5\u05e7\u05e6\u05d4 \u05dc\u05e7\u05d5\u05d1\u05e5 \u05d4\u05e9\u05dd <code>html_viewer_includes.properties</code>\u200f.</p><p>\u05e7\u05d5\u05d1\u05e5 \u05d6\u05d4 \u05e6\u05e8\u05d9\u05da \u05dc\u05d4\u05ea\u05e7\u05d9\u05d9\u05dd \u05d1\u05db\u05dc \u05e9\u05e8\u05ea \u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d1\u05d0\u05e9\u05db\u05d5\u05dc \u05d6\u05d4, \u05d1\u05ea\u05d9\u05e7\u05d9\u05d4 \u05d1-classpath (\u05dc\u05d3\u05d5\u05d2\u05de\u05d4, \u05d1\u05ea\u05d9\u05e7\u05d9\u05d4 "\u05de\u05e9\u05d0\u05d1\u05d9\u05dd \u05db\u05dc\u05dc\u05d9\u05d9\u05dd"), \u05ea\u05d7\u05ea \u05ea\u05d9\u05e7\u05d9\u05d9\u05d4 \u05d1\u05d7\u05d1\u05d9\u05dc\u05ea \u05d4\u05de\u05e9\u05d0\u05d1\u05d9\u05dd \u05e9\u05dc \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d0\u05d5 \u05d1-WAR \u05e9\u05dc \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05e2\u05e6\u05de\u05d5. \u05d0\u05dd \u05ea\u05e9\u05ea\u05de\u05e9 \u05d1\u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05de\u05e9\u05e0\u05d4, \u05e9\u05de\u05d5 \u05e9\u05dc \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5 \u05d0\u05de\u05d5\u05e8 \u05dc\u05d4\u05ea\u05d7\u05d9\u05dc \u05d1\u05e0\u05ea\u05d9\u05d1 \u05e9\u05dc \u05ea\u05d9\u05e7\u05d9\u05d9\u05ea \u05d4\u05de\u05e9\u05e0\u05d4.</p><p>\u05e2\u05d9\u05d9\u05df \u05d1\u05ea\u05d9\u05e2\u05d5\u05d3 \u05d4\u05e0\u05d9\u05d4\u05d5\u05dc \u05dc\u05e7\u05d1\u05dc\u05ea \u05de\u05d9\u05d3\u05e2 \u05e0\u05d5\u05e1\u05e3.</p>
config.launchbuttonless=\u05dc\u05e4\u05ea\u05d5\u05d7 \u05e7\u05d9\u05e9\u05d5\u05e8\u05d9\u05dd \u05d1<contextual_help>\u05d7\u05dc\u05d5\u05df \u05d7\u05d3\u05e9 \u05dc\u05dc\u05d0 \u05dc\u05d7\u05e6\u05e0\u05d9\u05dd</contextual_help>?
config.launchbuttonless.help.title=\u05e4\u05d5\u05ea\u05d7 \u05e7\u05d9\u05e9\u05d5\u05e8\u05d9\u05dd \u05d1\u05d7\u05dc\u05d5\u05df \u05d7\u05d3\u05e9 \u05dc\u05dc\u05d0 \u05dc\u05d7\u05e6\u05e0\u05d9\u05dd
config.launchbuttonless.help.content=\u05d0\u05dd \u05ea\u05e1\u05de\u05df \u05d0\u05e4\u05e9\u05e8\u05d5\u05ea \u05d6\u05d5, \u05db\u05dc \u05d4\u05d9\u05e4\u05e8-\u05e7\u05d9\u05e9\u05d5\u05e8 \u05d1\u05ea\u05d5\u05db\u05df \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d4\u05de\u05d5\u05e6\u05d2 \u05d1\u05d0\u05de\u05e6\u05e2\u05d5\u05ea \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d9\u05d9\u05e4\u05ea\u05d7 \u05d1\u05d7\u05dc\u05d5\u05df \u05de\u05e9\u05e0\u05d4 \u05d7\u05d3\u05e9 \u05dc\u05dc\u05d0 \u05dc\u05d7\u05e6\u05e0\u05d9\u05dd.  \u05d0\u05dd \u05dc\u05d0 \u05ea\u05e1\u05de\u05df \u05d0\u05e4\u05e9\u05e8\u05d5\u05ea \u05d6\u05d5, \u05d4\u05d5\u05d0 \u05d9\u05d9\u05e4\u05ea\u05d7 \u05d1\u05d7\u05dc\u05d5\u05df \u05d4\u05e0\u05d5\u05db\u05d7\u05d9.  \u05e2\u05d9\u05d9\u05df \u05d1\u05de\u05e1\u05de\u05da \u05d4\u05e0\u05d9\u05d4\u05d5\u05dc \u05dc\u05e7\u05d1\u05dc\u05ea \u05de\u05d9\u05d3\u05e2 \u05e0\u05d5\u05e1\u05e3.
config.checkseconds.text1=<contextual_help>\u05de\u05e9\u05da \u05d4\u05d6\u05de\u05df \u05e9\u05dc \u05d4\u05de\u05d8\u05de\u05d5\u05df:</contextual_help>
config.checkseconds.text2=\u05e9\u05e0\u05d9\u05d5\u05ea
config.checkseconds.help.title=\u05e7\u05d1\u05d9\u05e2\u05ea \u05ea\u05e6\u05d5\u05e8\u05d4 \u05e9\u05dc \u05d6\u05de\u05df \u05d4\u05de\u05d8\u05de\u05d5\u05df
config.checkseconds.help.content=<p>\u05d1\u05e2\u05d6\u05e8\u05ea \u05d0\u05e4\u05e9\u05e8\u05d5\u05ea \u05d6\u05d5 \u05ea\u05d5\u05db\u05dc \u05dc\u05d4\u05d2\u05d3\u05d9\u05e8 \u05d0\u05ea \u05d4\u05e0\u05ea\u05d5\u05e0\u05d9\u05dd \u05e9\u05dc\u05e2\u05d9\u05dc \u05e2\u05d1\u05d5\u05e8 \u05de\u05d8\u05de\u05d5\u05df \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05dc\u05de\u05e9\u05da \u05d6\u05de\u05df \u05de\u05e1\u05d5\u05d9\u05dd. \u05d4\u05de\u05d8\u05de\u05d5\u05df \u05d9\u05db\u05dc\u05d5\u05dc \u05d0\u05ea \u05d0\u05e4\u05e9\u05e8\u05d5\u05d9\u05d5\u05ea \u05d4\u05ea\u05e6\u05d5\u05e8\u05d4 \u05e9\u05dc\u05e2\u05d9\u05dc \u05db\u05de\u05d5 \u05d2\u05dd \u05d0\u05ea \u05ea\u05d5\u05db\u05df \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d5\u05d0\u05ea \u05db\u05d5\u05dc\u05dc \u05d4\u05e7\u05d1\u05e6\u05d9\u05dd \u05d4\u05de\u05d5\u05e4\u05d9\u05e2\u05d9\u05dd \u05dc\u05e2\u05d9\u05dc. \u05e4\u05e2\u05d5\u05dc\u05d4 \u05d6\u05d5 \u05e2\u05e9\u05d5\u05d9\u05d4 \u05dc\u05e9\u05e4\u05e8 \u05d0\u05ea \u05d4\u05d1\u05d9\u05e6\u05d5\u05e2\u05d9\u05dd \u05e9\u05dc \u05d4\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8 \u05d1\u05ea\u05e7\u05d5\u05e4\u05d4 \u05e9\u05dc \u05e2\u05d5\u05de\u05e1 \u05e8\u05d1.</p><p>\u05db\u05d3\u05d9 \u05dc\u05d0\u05e4\u05e9\u05e8 \u05de\u05d8\u05de\u05d5\u05df \u05dc\u05de\u05e1\u05e4\u05e8 \u05e9\u05e0\u05d9\u05d5\u05ea \u05de\u05e1\u05d5\u05d9\u05dd, \u05d4\u05d6\u05df \u05d0\u05ea \u05d4\u05de\u05e1\u05e4\u05e8 - \u05dc\u05d3\u05d5\u05d2\u05de\u05d4, <code>900</code> \u05e2\u05d1\u05d5\u05e8 15 \u05d3\u05e7\u05d5\u05ea. \u05db\u05d3\u05d9 \u05dc\u05d0\u05e4\u05e9\u05e8 \u05de\u05d8\u05de\u05d5\u05df \u05ea\u05de\u05d9\u05d3\u05d9, \u05d4\u05d6\u05df <code>-1</code>. \u05db\u05d3\u05d9 \u05dc\u05d1\u05d8\u05dc \u05de\u05d8\u05de\u05d5\u05df, \u05d4\u05d6\u05df <code>0</code> \u05d0\u05d5 \u05d4\u05e9\u05d0\u05e8 \u05d0\u05ea \u05d4\u05d0\u05e4\u05e9\u05e8\u05d5\u05ea \u05e8\u05d9\u05e7\u05d4.</p><p>\u05d1\u05db\u05dc \u05de\u05e7\u05e8\u05d4, \u05d1\u05e2\u05ea \u05dc\u05d7\u05d9\u05e6\u05d4 \u05e2\u05dc <b>\u05e9\u05de\u05d9\u05e8\u05d4</b> \u05d1\u05d3\u05e3 \u05d6\u05d4, \u05d4\u05de\u05d8\u05de\u05d5\u05df \u05d4\u05e7\u05d9\u05d9\u05dd \u05d9\u05d9\u05de\u05d7\u05e7. \u05e2\u05dc \u05db\u05df, \u05e9\u05d9\u05e0\u05d5\u05d9\u05d9\u05dd \u05e9\u05d9\u05d9\u05e9\u05de\u05e8\u05d5 \u05db\u05d0\u05df \u05d9\u05d9\u05db\u05e0\u05e1\u05d5 \u05dc\u05ea\u05d5\u05e7\u05e3 \u05de\u05d9\u05d9\u05d3\u05d9\u05ea. \u05d4\u05de\u05d8\u05de\u05d5\u05df \u05d9\u05d9\u05de\u05d7\u05e7 \u05d2\u05dd \u05db\u05d0\u05e9\u05e8 \u05ea\u05d1\u05e6\u05e2 \u05d4\u05e4\u05e2\u05dc\u05d4 \u05de\u05d7\u05d3\u05e9 \u05dc\u05e4\u05d5\u05e8\u05d8\u05dc\u05d8.</p>
config.okbutton=\u05e9\u05de\u05d9\u05e8\u05d4
info.saved=\u05d4\u05e9\u05d9\u05e0\u05d5\u05d9\u05d9\u05dd \u05e9\u05dc\u05da \u05e0\u05e9\u05de\u05e8\u05d5.

# messages for view mode 
# (none)

# messages for error handling
error.code=(\u05e9\u05d2\u05d9\u05d0\u05d4: {0})
error.message=\u05e9\u05d2\u05d9\u05d0\u05d4:
error.input=\u05d0\u05d9\u05e8\u05e2\u05d4 \u05d1\u05e2\u05d9\u05d4 \u05d1\u05e0\u05ea\u05d5\u05e0\u05d9\u05dd \u05e9\u05d4\u05d6\u05e0\u05ea.
error.internal=\u05d4\u05e9\u05d9\u05e8\u05d5\u05ea \u05d0\u05d5 \u05d4\u05de\u05d9\u05d3\u05e2 \u05e9\u05d1\u05d9\u05e7\u05e9\u05ea \u05d0\u05d9\u05e0\u05d5 \u05d6\u05de\u05d9\u05df \u05db\u05e2\u05ea. \u05e0\u05e1\u05d4 \u05e9\u05d5\u05d1 \u05de\u05d0\u05d5\u05d7\u05e8 \u05d9\u05d5\u05ea\u05e8.
error.nullFile=\u05d4\u05e9\u05d9\u05e8\u05d5\u05ea \u05d0\u05d5 \u05d4\u05de\u05d9\u05d3\u05e2 \u05e9\u05d1\u05d9\u05e7\u05e9\u05ea \u05d0\u05d9\u05e0\u05d5 \u05d6\u05de\u05d9\u05df \u05db\u05e2\u05ea.  \u05e0\u05e1\u05d4 \u05e9\u05d5\u05d1 \u05de\u05d0\u05d5\u05d7\u05e8 \u05d9\u05d5\u05ea\u05e8.
error.nullFilename=\u05e9\u05dd \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05dc\u05d0 \u05d9\u05db\u05d5\u05dc \u05dc\u05d4\u05d9\u05d5\u05ea \u05e8\u05d9\u05e7.  \u05ea\u05e7\u05df \u05d0\u05d5\u05ea\u05d5 \u05dc\u05d4\u05dc\u05df.
error.pathInFilename=\u05e9\u05dd \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d0\u05d9\u05e0\u05d5 \u05d9\u05db\u05d5\u05dc \u05dc\u05d4\u05db\u05d9\u05dc \u05e0\u05ea\u05d9\u05d1 \u05e1\u05e4\u05e8\u05d9\u05d9\u05ea \u05d0\u05d1 (\u05db\u05d2\u05d5\u05df, \u05d4\u05e4\u05e0\u05d9\u05d9\u05d4 \u05dc<code>..</code>).  \u05ea\u05e7\u05df \u05d0\u05d5\u05ea\u05d5 \u05dc\u05d4\u05dc\u05df.
error.pathInSubsFilename=\u05e9\u05de\u05d5 \u05e9\u05dc \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5 \u05d0\u05d9\u05e0\u05d5 \u05d9\u05db\u05d5\u05dc \u05dc\u05d4\u05db\u05d9\u05dc \u05e0\u05ea\u05d9\u05d1 \u05e1\u05e4\u05e8\u05d9\u05d9\u05ea \u05d0\u05d1 (\u05db\u05d2\u05d5\u05df, \u05d4\u05e4\u05e0\u05d9\u05d9\u05d4 \u05dc<code>..</code>).  \u05ea\u05e7\u05df \u05d0\u05d5\u05ea\u05d5 \u05dc\u05d4\u05dc\u05df.
error.checkSecondsValue=\u05e2\u05dc \u05de\u05e9\u05da \u05d4\u05d6\u05de\u05df \u05e9\u05dc \u05d4\u05de\u05d8\u05de\u05d5\u05df \u05dc\u05d4\u05d9\u05d5\u05ea \u05de\u05e1\u05e4\u05e8 \u05e9\u05dc\u05dd \u05e9\u05dc \u05e9\u05e0\u05d9\u05d5\u05ea.  \u05ea\u05e7\u05df \u05d0\u05d5\u05ea\u05d5 \u05dc\u05d4\u05dc\u05df.
error.notSaved=\u05d4\u05e9\u05d9\u05e0\u05d5\u05d9\u05d9\u05dd \u05e9\u05e2\u05e8\u05db\u05ea \u05dc\u05d0 \u05e0\u05e9\u05de\u05e8\u05d5.
#
warn.message=\u05d0\u05d6\u05d4\u05e8\u05d4:
warn.nullFile=\u05dc\u05d0 \u05e0\u05d9\u05ea\u05df \u05dc\u05d0\u05ea\u05e8 \u05d0\u05d5 \u05dc\u05e7\u05e8\u05d5\u05d0 \u05d0\u05ea \u05e7\u05d5\u05d1\u05e5 \u05d4\u05ea\u05e6\u05d5\u05d2\u05d4 \u05d4\u05de\u05d5\u05e4\u05d9\u05e2 \u05dc\u05d4\u05dc\u05df.  \u05d4\u05d0\u05dd \u05db\u05d1\u05e8 \u05d9\u05e6\u05e8\u05ea \u05d5\u05d4\u05ea\u05e7\u05e0\u05ea \u05d0\u05d5\u05ea\u05d5?
warn.nullSubsFile=\u05dc\u05d0 \u05e0\u05d9\u05ea\u05df \u05dc\u05d0\u05ea\u05e8 \u05d0\u05d5 \u05dc\u05e7\u05e8\u05d5\u05d0 \u05d0\u05ea \u05db\u05d5\u05dc\u05dc \u05e7\u05d5\u05d1\u05e5 \u05d4\u05de\u05d5\u05e4\u05d9\u05e2 \u05dc\u05d4\u05dc\u05df.  \u05d4\u05d0\u05dd \u05db\u05d1\u05e8 \u05d9\u05e6\u05e8\u05ea \u05d5\u05d4\u05ea\u05e7\u05e0\u05ea \u05d0\u05d5\u05ea\u05d5?
