# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u6aa2\u8996\u6a94\u6848\uff1a
config.viewfilename.help.title=\u7d44\u614b\u6aa2\u8996\u6a94\u6848
config.viewfilename.help.content=<p>\u8f38\u5165\u6aa2\u8996\u6a94\u6848\u7684\u4e3b\u6a94\u540d (\u5305\u62ec\u64f4\u5c55\u540d)\u3002  \u4f8b\u5982\uff0c<code>myViewFile.html</code>\u3002</p><p>\u6b64\u6a94\u6848\u5305\u542b\u60a8\u60f3\u8981 portlet \u986f\u793a\u7684\u5167\u5bb9\uff0c\u4e26\u4e14\u5176\u5fc5\u9808\u5b58\u5728\u3002  \u6b64\u6a94\u6848\u61c9\u8a72\u5b58\u5728\u65bc\u6b64\u53e2\u96c6\u4e2d\u7684\u6bcf\u90e8 portlet \u4f3a\u670d\u5668\u4e0a\u3001portlet \u8cc7\u6e90\u914d\u5957\u8cc7\u6599\u593e\u4e2d\u6216\u8005\u5176\u5b50\u8cc7\u6599\u593e\u4e2d\u3002  (\u6216\u8005\uff0c\u6b64\u6a94\u6848\u53ef\u80fd\u5b58\u5728\u65bc portlet WAR \u81ea\u8eab\u5167\u7684\u6839\u8cc7\u6599\u593e\u6216\u8005\u5176\u5b50\u8cc7\u6599\u593e\u4e2d)\u3002  \u5982\u679c\u60a8\u8981\u4f7f\u7528\u5b50\u8cc7\u6599\u593e\uff0c\u5247\u6aa2\u8996\u6a94\u6848\u540d\u7a31\u5fc5\u9808\u5305\u62ec\u6b64\u5b50\u8cc7\u6599\u593e\u8def\u5f91\u3002  \u4f8b\u5982\uff0c<code>myFiles/myViewFile.html</code>\u3002</p><p>\u6a94\u6848\u5167\u5bb9\u61c9\u8a72\u672c\u571f\u5316\u70ba\u57fa\u672c\u5730\u5340\u8a9e\u8a00\u3002  \u5982\u679c\u60a8\u5df2\u7d93\u7ffb\u8b6f\u4e86\u6a94\u6848\u5167\u5bb9\uff0c\u5247\u5df2\u7ffb\u8b6f\u7684\u6aa2\u8996\u6a94\u6848\u61c9\u8a72\u8207\u57fa\u672c\u6aa2\u8996\u6a94\u6848\u4f4d\u65bc\u76f8\u540c\u7684\u4f4d\u7f6e\uff0c\u4e26\u4e14\u76f8\u61c9\u5730\u4f7f\u7528\u5730\u5340\u8a2d\u5b9a\u5c07\u5176\u52a0\u4e0a\u6a19\u7c64\u3002</p><p>\u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u4ee5\u77ad\u89e3\u8a73\u7d30\u8cc7\u8a0a\u3002</p>
config.subsfilename=\u9078\u7528\u7684 <contextual_help>\u5305\u62ec\u6a94\u6848</contextual_help>\uff1a
config.subsfilename.help.title=\u914d\u7f6e\u5305\u62ec\u6a94\u6848
config.subsfilename.help.content=<p>\u9664\u975e\u60a8\u7684\u6aa2\u8996\u6a94\u6848\u4f7f\u7528 <code>{INCLUDE:<i>key</i>}</code> \u8a9e\u5f59\u57fa\u5143\uff0c\u5426\u5247\u53ef\u4ee5\u4fdd\u7559\u5b83\u7a7a\u767d\u3002</p><p>\u5982\u679c\u60a8\u7684\u6aa2\u8996\u6a94\u6848\u4f7f\u7528\u6b64\u8a9e\u5f59\u57fa\u5143\uff0c\u5247\u8acb\u5728\u6b64\u8655\u8f38\u5165\u5305\u62ec\u6a94\u6848\u7684\u540d\u7a31\u3002 \u4f8b\u5982\uff0c<code>myViewFileIncludes.properties</code>\u3002</p><p>\u6b64\u6a94\u6848\u5305\u542b\u5728\u6aa2\u8996\u6a94\u6848\u4e2d\u8f49\u63db <code>{INCLUDE:<i>key</i>}</code> \u8a9e\u5f59\u57fa\u5143\u6642\uff0c\u60a8\u60f3\u8981 portlet \u63d2\u5165\u7684\u9375\u503c\u5c0d\u3002  \u5982\u679c\u4e0d\u8f38\u5165\u6a94\u6848\u540d\u7a31\uff0c\u5247\u6703\u5047\u8a2d\u6a94\u6848\u540d\u7a31\u70ba <code>html_viewer_includes.properties</code>\u3002</p><p>\u6b64\u6a94\u6848\u61c9\u8a72\u5b58\u5728\u65bc\u6b64\u53e2\u96c6\u4e2d\u7684\u6bcf\u90e8 portlet \u4f3a\u670d\u5668\u4e0a\u3001classpath \u7684\u8cc7\u6599\u593e\u4e2d (\u4f8b\u5982\uff0c\u60a8\u7684\u300cglobal resources\u300d\u8cc7\u6599\u593e)\u3001portlet \u8cc7\u6e90\u914d\u5957\u8cc7\u6599\u593e\u4e0b\u6216 portlet WAR \u81ea\u8eab\u4e2d\u3002 \u5982\u679c\u60a8\u8981\u4f7f\u7528\u5b50\u8cc7\u6599\u593e\uff0c\u5247\u5305\u62ec\u6a94\u6848\u540d\u7a31\u5fc5\u9808\u4f7f\u7528\u6b64\u5b50\u8cc7\u6599\u593e\u8def\u5f91\u958b\u982d\u3002</p><p>\u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u4ee5\u77ad\u89e3\u8a73\u7d30\u8cc7\u8a0a\u3002</p>
config.launchbuttonless=\u8981\u5728<contextual_help>\u65b0\u7684\u7121\u6309\u9215\u7684\u8996\u7a97</contextual_help>\u4e2d\u958b\u555f\u9023\u7d50\uff1f
config.launchbuttonless.help.title=\u5728\u65b0\u7684\u7121\u6309\u9215\u7684\u8996\u7a97\u4e2d\u958b\u555f\u9023\u7d50
config.launchbuttonless.help.content=\u5982\u679c\u60a8\u52fe\u9078\u6b64\u9078\u9805\uff0c\u5247\u6703\u5728\u65b0\u7684\u7121\u6309\u9215\u7684\u5b50\u8996\u7a97\u4e2d\u958b\u555f portlet \u986f\u793a\u7684\u6aa2\u8996\u6a94\u6848\u5167\u5bb9\u4e2d\u7684\u6240\u6709\u8d85\u9023\u7d50\u3002  \u5982\u679c\u60a8\u4e0d\u52fe\u9078\u6b64\u9078\u9805\uff0c\u5247\u5c07\u5728\u7576\u524d\u8996\u7a97\u4e2d\u958b\u555f\u3002  \u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u4ee5\u77ad\u89e3\u8a73\u7d30\u8cc7\u8a0a\u3002
config.checkseconds.text1=<contextual_help>\u5feb\u53d6\u6301\u7e8c\u6642\u9593\uff1a</contextual_help>
config.checkseconds.text2=\u79d2\u6578
config.checkseconds.help.title=\u8a2d\u5b9a\u5feb\u53d6\u6301\u7e8c\u6642\u9593
config.checkseconds.help.content=<p>\u60a8\u53ef\u4ee5\u4f7f\u7528\u6b64\u9078\u9805\u6307\u5b9a\u4e0a\u8ff0\u8cc7\u6599\u7531 portlet \u5feb\u53d6\u4e00\u6bb5\u7279\u5b9a\u7684\u6642\u9593\u3002 \u5feb\u53d6\u5c07\u5305\u542b\u4e0a\u8ff0\u7684\u914d\u7f6e\u9078\u9805\uff0c\u4ee5\u53ca\u4e0a\u8ff0\u540d\u7a31\u4e4b\u6aa2\u8996\u548c\u5305\u62ec\u6a94\u6848\u7684\u5167\u5bb9\u3002 \u9019\u6a23\u53ef\u4ee5\u6539\u5584 portlet \u5728\u9ad8\u8ca0\u8f09\u4e0b\u7684\u6548\u80fd\u3002</p><p>\u82e5\u8981\u555f\u7528\u5feb\u53d6\u4e00\u6bb5\u7279\u5b9a\u7684\u79d2\u6578\uff0c\u8acb\u8f38\u5165\u8a72\u6578\u5b57 - \u4f8b\u5982\uff0c<code>900</code> \u4ee3\u8868 15 \u5206\u9418\u3002 \u82e5\u8981\u6c38\u9060\u555f\u7528\u5feb\u53d6\uff0c\u8f38\u5165 <code>-1</code>\u3002 \u82e5\u8981\u505c\u7528\u5feb\u53d6\uff0c\u8f38\u5165 <code>0</code> \u6216\u4fdd\u6301\u8a72\u9078\u9805\u7a7a\u767d\u3002</p><p>\u5728\u4efb\u4f55\u60c5\u6cc1\u4e0b\uff0c\u7576\u60a8\u6309\u4e00\u4e0b\u6b64\u9801\u9762\u4e0a\u7684<b>\u5132\u5b58</b>\u6642\uff0c\u73fe\u6709\u7684\u5feb\u53d6\u90fd\u6703\u906d\u5230\u6e05\u9664\u3002 \u56e0\u6b64\uff0c\u60a8\u5728\u6b64\u5132\u5b58\u7684\u8b8a\u66f4\u5c07\u7acb\u5373\u751f\u6548\u3002 \u7576\u60a8\u91cd\u65b0\u555f\u52d5 portlet \u6642\uff0c\u5feb\u53d6\u4e5f\u6703\u96a8\u4e4b\u6e05\u9664\u3002</p>
config.okbutton=\u5132\u5b58
info.saved=\u5df2\u5132\u5b58\u6240\u505a\u7684\u8b8a\u66f4\u3002

# messages for view mode 
# (none)

# messages for error handling
error.code=(\u932f\u8aa4\uff1a {0})
error.message=\u932f\u8aa4\uff1a
error.input=\u60a8\u8f38\u5165\u7684\u8cc7\u6599\u6709\u554f\u984c\u3002
error.internal=\u6b64\u6642\u7121\u6cd5\u63d0\u4f9b\u60a8\u8981\u6c42\u7684\u670d\u52d9\u6216\u8cc7\u8a0a\u3002 \u8acb\u7a0d\u5f8c\u518d\u8a66\u3002
error.nullFile=\u6b64\u6642\u7121\u6cd5\u63d0\u4f9b\u60a8\u8981\u6c42\u7684\u670d\u52d9\u6216\u8cc7\u8a0a\u3002  \u8acb\u7a0d\u5f8c\u518d\u8a66\u4e00\u6b21\u3002
error.nullFilename=\u6aa2\u8996\u6a94\u6848\u540d\u7a31\u4e0d\u80fd\u70ba\u7a7a\u767d\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u4fee\u6b63\u3002
error.pathInFilename=\u6aa2\u8996\u6a94\u6848\u540d\u7a31\u4e0d\u80fd\u5305\u542b\u4efb\u4f55\u7236\u76ee\u9304\u8def\u5f91 (\u5373 <code>..</code> \u53c3\u7167)\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u4fee\u6b63\u3002
error.pathInSubsFilename=\u5305\u62ec\u6a94\u6848\u540d\u7a31\u4e0d\u80fd\u5305\u542b\u4efb\u4f55\u7236\u76ee\u9304\u8def\u5f91 (\u5373 <code>..</code> \u53c3\u7167)\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u4fee\u6b63\u3002
error.checkSecondsValue=\u5feb\u53d6\u6301\u7e8c\u6642\u9593\u7684\u79d2\u6578\u5fc5\u9808\u662f\u6574\u6578\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u4fee\u6b63\u3002
error.notSaved=\u60a8\u6240\u505a\u7684\u8b8a\u66f4\u5c1a\u672a\u5132\u5b58\u3002
#
warn.message=\u8b66\u544a\uff1a
warn.nullFile=\u627e\u4e0d\u5230\u6216\u7121\u6cd5\u8b80\u53d6\u4e0b\u5217\u540d\u7a31\u7684\u6aa2\u8996\u6a94\u6848\u3002  \u60a8\u662f\u5426\u5df2\u5efa\u7acb\u4e26\u5b89\u88dd\u5b83\uff1f
warn.nullSubsFile=\u627e\u4e0d\u5230\u6216\u7121\u6cd5\u8b80\u53d6\u4e0b\u5217\u540d\u7a31\u7684\u5305\u62ec\u6a94\u6848\u3002  \u60a8\u662f\u5426\u5df2\u5efa\u7acb\u4e26\u5b89\u88dd\u5b83\uff1f
