# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u89c6\u56fe\u6587\u4ef6\uff1a
config.viewfilename.help.title=\u914d\u7f6e\u89c6\u56fe\u6587\u4ef6
config.viewfilename.help.content=<p>\u8f93\u5165\u89c6\u56fe\u6587\u4ef6\u7684\u57fa\u672c\u540d\u79f0\uff08\u5305\u62ec\u6269\u5c55\u540d\uff09\u3002  \u4f8b\u5982\uff0c<code>myViewFile.html</code>\u3002</p><p>\u6b64\u6587\u4ef6\u5305\u542b\u60a8\u5e0c\u671b portlet \u663e\u793a\u7684\u5185\u5bb9\uff0c\u4e14\u5176\u5fc5\u987b\u5b58\u5728\u3002  \u6b64\u6587\u4ef6\u5e94\u5b58\u5728\u4e8e\u6b64\u7fa4\u96c6\u4e2d\u6bcf\u53f0 portlet \u670d\u52a1\u5668\u4e0a\u7684 portlet \u8d44\u6e90\u5305\u6587\u4ef6\u5939\u6216\u5176\u5b50\u6587\u4ef6\u5939\u4e2d\u3002  \uff08\u6216\u8005\uff0c\u6b64\u6587\u4ef6\u53ef\u4ee5\u5b58\u5728\u4e8e portlet WAR \u81ea\u8eab\u4e2d\u7684\u6839\u6587\u4ef6\u5939\u6216\u5176\u5b50\u6587\u4ef6\u5939\u4e2d\u3002\uff09  \u5982\u679c\u60a8\u4f7f\u7528\u7684\u662f\u5b50\u6587\u4ef6\u5939\uff0c\u5219\u89c6\u56fe\u6587\u4ef6\u540d\u5e94\u5305\u542b\u8be5\u5b50\u6587\u4ef6\u5939\u7684\u8def\u5f84\u3002  \u4f8b\u5982\uff0c<code>myFiles/myViewFile.html</code>\u3002</p><p>\u6587\u4ef6\u7684\u5185\u5bb9\u5e94\u6309\u5f53\u5730\u533a\u57df\u8bed\u8a00\u8fdb\u884c\u672c\u5730\u5316\u3002  \u5982\u679c\u6587\u4ef6\u5185\u5bb9\u5df2\u7ffb\u8bd1\u5b8c\u6bd5\uff0c\u5219\u7ffb\u8bd1\u540e\u89c6\u56fe\u6587\u4ef6\u5e94\u4e0e\u57fa\u672c\u89c6\u56fe\u6587\u4ef6\u4f4d\u4e8e\u540c\u4e00\u4f4d\u7f6e\uff0c\u4e14\u4f7f\u7528\u76f8\u5e94\u6807\u7b7e\u6807\u6ce8\u8bed\u8a00\u7248\u672c\u3002</p><p>\u6709\u5173\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u7ba1\u7406\u6587\u6863\u3002</p>
config.subsfilename=\u53ef\u9009\u7684<contextual_help>\u5305\u62ec\u6587\u4ef6</contextual_help>\uff1a
config.subsfilename.help.title=\u914d\u7f6e\u5305\u62ec\u6587\u4ef6
config.subsfilename.help.content=<p>\u9664\u975e\u60a8\u7684\u89c6\u56fe\u6587\u4ef6\u4f7f\u7528 <code>{INCLUDE:<i>key</i>}</code> \u4ee4\u724c\uff0c\u5426\u5219\uff0c\u60a8\u53ef\u4ee5\u5c06\u6b64\u9879\u7559\u4e3a\u7a7a\u767d\u3002</p><p>\u5982\u679c\u60a8\u7684\u89c6\u56fe\u6587\u4ef6\u4f7f\u7528\u8be5\u4ee4\u724c\uff0c\u8bf7\u5728\u6b64\u5904\u4e3a\u5176\u8f93\u5165\u5305\u62ec\u6587\u4ef6\u7684\u540d\u79f0\u3002 \u4f8b\u5982\uff0c<code>myViewFileIncludes.properties</code>\u3002</p><p>\u6b64\u6587\u4ef6\u5305\u542b\u60a8\u5e0c\u671b portlet \u5728\u5448\u73b0\u89c6\u56fe\u6587\u4ef6\u4e2d\u7684 <code>{INCLUDE:<i>key</i>}</code> \u4ee4\u724c\u65f6\u63d2\u5165\u7684\u952e-\u503c\u5bf9\u3002  \u5982\u679c\u4e0d\u8f93\u5165\u6587\u4ef6\u540d\uff0c\u5219\u4f7f\u7528\u540d\u4e3a <code>html_viewer_includes.properties</code> \u7684\u6587\u4ef6\u3002</p><p>\u8be5\u6587\u4ef6\u5e94\u5b58\u5728\u4e8e\u6b64\u7fa4\u96c6\u4e2d\u6bcf\u53f0 portlet \u670d\u52a1\u5668\u4e0a\u7c7b\u8def\u5f84\u7684\u67d0\u4e2a\u6587\u4ef6\u5939\uff08\u4f8b\u5982\u201cglobal resources\u201d\u6587\u4ef6\u5939\uff09\u4e2d\u3001portlet \u8d44\u6e90\u5305\u6587\u4ef6\u5939\u4e0b\u6216 portlet WAR \u672c\u8eab\u4e2d\u3002 \u5982\u679c\u4f7f\u7528\u5b50\u6587\u4ef6\u5939\uff0c\u5219\u5305\u62ec\u6587\u4ef6\u540d\u5e94\u8be5\u4ee5\u8be5\u5b50\u6587\u4ef6\u5939\u8def\u5f84\u5f00\u5934\u3002</p><p>\u6709\u5173\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u8003\u7ba1\u7406\u6587\u6863\u3002</p>
config.launchbuttonless=\u662f\u5426\u5728<contextual_help>\u65e0\u6309\u94ae\u65b0\u7a97\u53e3</contextual_help>\u4e2d\u6253\u5f00\u94fe\u63a5?
config.launchbuttonless.help.title=\u5728\u65e0\u6309\u94ae\u65b0\u7a97\u53e3\u4e2d\u6253\u5f00\u94fe\u63a5
config.launchbuttonless.help.content=\u5982\u679c\u9009\u4e2d\u6b64\u9009\u9879\uff0cportlet \u5728\u89c6\u56fe\u6587\u4ef6\u5185\u5bb9\u4e2d\u663e\u793a\u7684\u6240\u6709\u8d85\u94fe\u63a5\u90fd\u5c06\u5728\u4e0d\u542b\u6309\u94ae\u7684\u5b50\u7a97\u53e3\u4e2d\u6253\u5f00\u3002  \u5982\u679c\u60a8\u4e0d\u9009\u4e2d\u6b64\u9009\u9879\uff0c\u5219\u8fd9\u4e9b\u94fe\u63a5\u5c06\u5728\u5f53\u524d\u7a97\u53e3\u4e2d\u6253\u5f00\u3002  \u6709\u5173\u8be6\u7ec6\u4fe1\u606f\uff0c\u8bf7\u53c2\u9605\u7ba1\u7406\u6587\u6863\u3002
config.checkseconds.text1=<contextual_help>\u7f13\u5b58\u6301\u7eed\u65f6\u95f4\uff1a</contextual_help>
config.checkseconds.text2=\u79d2
config.checkseconds.help.title=\u914d\u7f6e\u7f13\u5b58\u7684\u65f6\u95f4\u957f\u5ea6
config.checkseconds.help.content=<p>\u4f7f\u7528\u6b64\u9009\u9879\uff0c\u60a8\u53ef\u4ee5\u6307\u5b9a portlet \u5c06\u4e0a\u8ff0\u6570\u636e\u7f13\u5b58\u4e00\u5b9a\u957f\u5ea6\u7684\u65f6\u95f4\u3002 \u7f13\u5b58\u5c06\u5305\u62ec\u4e0a\u8ff0\u914d\u7f6e\u9009\u9879\uff0c\u4ee5\u53ca\u4e0a\u8ff0\u89c6\u56fe\u6587\u4ef6\u548c\u5305\u62ec\u6587\u4ef6\u7684\u5185\u5bb9\u3002 \u8fd9\u53ef\u4ee5\u63d0\u9ad8\u8d1f\u8f7d\u6c89\u91cd\u7684 portlet \u7684\u6027\u80fd\u3002</p><p>\u82e5\u8981\u5728\u4e00\u5b9a\u957f\u5ea6\u7684\u65f6\u95f4\uff08\u5355\u4f4d\u4e3a\u79d2\uff09\u5185\u542f\u7528\u7f13\u5b58\uff0c\u8bf7\u8f93\u5165\u8be5\u6570\u5b57\uff0c\u4f8b\u5982\uff0c<code>900</code>\uff08\u8868\u793a 15 \u5206\u949f\uff09\u3002 \u82e5\u8981\u6c38\u4e45\u542f\u7528\u7f13\u5b58\uff0c\u8bf7\u8f93\u5165 <code>-1</code>\u3002 \u82e5\u8981\u7981\u7528\u7f13\u5b58\uff0c\u8bf7\u8f93\u5165 <code>0</code> \u6216\u5c06\u8be5\u9009\u9879\u4fdd\u7559\u4e3a\u7a7a\u3002</p><p>\u5728\u4efb\u4f55\u60c5\u51b5\u4e0b\uff0c\u5982\u679c\u60a8\u5728\u6b64\u9875\u4e0a\u5355\u51fb\u201c\u4fdd\u5b58\u201d<b></b>\uff0c\u90fd\u5c06\u6e05\u9664\u73b0\u6709\u7f13\u5b58\u3002 \u56e0\u6b64\uff0c\u5728\u6b64\u5904\u4fdd\u5b58\u7684\u66f4\u6539\u5c06\u7acb\u5373\u751f\u6548\u3002 \u91cd\u65b0\u542f\u52a8 portlet \u65f6\uff0c\u4e5f\u4f1a\u6e05\u9664\u7f13\u5b58\u3002</p>
config.okbutton=\u4fdd\u5b58
info.saved=\u60a8\u7684\u66f4\u6539\u5df2\u7ecf\u4fdd\u5b58\uff01

# messages for view mode 
# (none)

# messages for error handling
error.code=\uff08\u9519\u8bef\uff1a{0}\uff09
error.message=\u9519\u8bef\uff1a
error.input=\u8f93\u5165\u7684\u6570\u636e\u6709\u95ee\u9898\u3002
error.internal=\u60a8\u8bf7\u6c42\u7684\u670d\u52a1\u6216\u4fe1\u606f\u6b64\u65f6\u4e0d\u53ef\u7528\u3002 \u8bf7\u7a0d\u540e\u91cd\u8bd5\u3002
error.nullFile=\u60a8\u8bf7\u6c42\u7684\u670d\u52a1\u6216\u4fe1\u606f\u6b64\u65f6\u4e0d\u53ef\u7528\u3002  \u8bf7\u7a0d\u540e\u518d\u8bd5\u3002
error.nullFilename=\u89c6\u56fe\u6587\u4ef6\u540d\u79f0\u4e0d\u80fd\u4e3a\u7a7a\u3002  \u8bf7\u5728\u4e0b\u9762\u5bf9\u5176\u8fdb\u884c\u66f4\u6b63\u3002
error.pathInFilename=\u89c6\u56fe\u6587\u4ef6\u540d\u79f0\u4e0d\u5305\u542b\u4efb\u610f\u7236\u76ee\u5f55\u8def\u5f84\uff08\u5982\uff0c<code>..</code> \u7d22\u5f15\uff09\u3002  \u8bf7\u5728\u4e0b\u9762\u5bf9\u5176\u8fdb\u884c\u66f4\u6b63\u3002
error.pathInSubsFilename=\u5305\u62ec\u6587\u4ef6\u540d\u4e0d\u80fd\u5305\u542b\u4efb\u4f55\u7236\u76ee\u5f55\u8def\u5f84\uff08\u5982\uff0c<code>..</code> \u7d22\u5f15\uff09\u3002  \u8bf7\u5728\u4e0b\u9762\u5bf9\u5176\u8fdb\u884c\u66f4\u6b63\u3002
error.checkSecondsValue=\u7f13\u5b58\u6301\u7eed\u65f6\u95f4\u5fc5\u987b\u4e3a\u6574\u6570\uff08\u5355\u4f4d\u4e3a\u79d2\uff09\u3002  \u8bf7\u5728\u4e0b\u9762\u5bf9\u5176\u8fdb\u884c\u66f4\u6b63\u3002
error.notSaved=\u60a8\u7684\u66f4\u6539\u5c1a\u672a\u4fdd\u5b58\u3002
#
warn.message=\u8b66\u544a\uff1a
warn.nullFile=\u627e\u4e0d\u5230\u6216\u65e0\u6cd5\u8bfb\u53d6\u4e0b\u9762\u6307\u5b9a\u7684\u89c6\u56fe\u6587\u4ef6\u3002  \u662f\u5426\u5df2\u521b\u5efa\u5e76\u5df2\u5b89\u88c5\u8be5\u6587\u4ef6\uff1f
warn.nullSubsFile=\u627e\u4e0d\u5230\u6216\u65e0\u6cd5\u8bfb\u53d6\u4e0b\u9762\u6307\u5b9a\u7684\u5305\u62ec\u6587\u4ef6\u3002  \u662f\u5426\u5df2\u521b\u5efa\u5e76\u5df2\u5b89\u88c5\u8be5\u6587\u4ef6\uff1f
