# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Plik wy\u015bwietlania:
config.viewfilename.help.title=Konfigurowanie pliku wy\u015bwietlania
config.viewfilename.help.content=<p>Wprowad\u017a nazw\u0119 podstawow\u0105 (wraz z rozszerzeniem) pliku wy\u015bwietlania.  Na przyk\u0142ad <code>M\u00f3jPlikWy\u015bwietlania.html</code>.</p><p>Ten plik zawiera okre\u015blone przez u\u017cytkownika informacje o zawarto\u015bci wy\u015bwietlanej przez portlet i jest niezb\u0119dny.  Ten plik powinien istnie\u0107 na ka\u017cdym serwerze portletu w tym klastrze, w folderze pakietu zasob\u00f3w portletu lub w jego podfolderze.  (Ewentualnie plik ten mo\u017ce zosta\u0107 umieszczony w folderze lub podfolderze wewn\u0105trz samego portletu WAR).  W przypadku zastosowania podfolderu nazwa pliku wy\u015bwietlania powinna zawiera\u0107 \u015bcie\u017ck\u0119 do tego podfolderu.  Na przyk\u0142ad <code>MojePliki/M\u00f3jPlikWy\u015bwietlania.html</code>.</p><p>Zawarto\u015b\u0107 pliku powinna uwzgl\u0119dnia\u0107 podstawow\u0105 lokalizacj\u0119.  Je\u015bli zawarto\u015b\u0107 zostanie przet\u0142umaczona, przet\u0142umaczone pliki wy\u015bwietlania powinny znajdowa\u0107 si\u0119 obok podstawowych plik\u00f3w wy\u015bwietlania, w tej samej lokalizacji oraz powinny zawiera\u0107 odpowiednie informacje dotycz\u0105ce lokalizacji.</p><p>Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.</p>
config.subsfilename=Opcjonalny plik <contextual_help>zawiera</contextual_help>:
config.subsfilename.help.title=Konfigurowanie pliku \u201ezawiera\u201d
config.subsfilename.help.content=<p>Je\u017celi plik wy\u015bwietlania nie korzysta z tokenu <code>{INCLUDE:<i>key</i>}</code>, plik ten mo\u017ce pozosta\u0107 pusty.</p><p>Je\u015bli jednak plik wy\u015bwietlania korzysta z tego tokenu, nale\u017cy wprowadzi\u0107 nazw\u0119 pliku \u201ezawiera\u201d. Na przyk\u0142ad plik <code>m\u00f3jPlikWy\u015bwietlaniaZawiera.w\u0142a\u015bciwo\u015bci</code>.</p><p>Taki plik zawiera informacje o parach klucz-warto\u015b\u0107 wstawianych przez portlet w trakcie renderowania token\u00f3w <code>{INCLUDE:<i>key</i>}</code> w pliku wy\u015bwietlania.  Je\u017celi nie podano nazwy pliku, plik przyjmuje nazw\u0119 <code>html_viewer_includes.properties</code>.</p><p>Ten plik powinien istnie\u0107 na ka\u017cdym serwerze portletu w tym klastrze, w folderze na \u015bcie\u017cce klas (na przyk\u0142ad w folderze \u201ezasoby globalne\u201d), w folderze pakietu zasob\u00f3w portletu lub wewn\u0105trz samego portletu WAR. W przypadku zastosowania podfolderu nazwa pliku \u201ezawiera\u201d powinna rozpoczyna\u0107 si\u0119 od \u015bcie\u017cki tego podfolderu.</p><p>Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.</p>
config.launchbuttonless=Otwieraj \u0142\u0105cza w <contextual_help>nowym oknie dialogowym</contextual_help>?
config.launchbuttonless.help.title=Otwieraj \u0142\u0105cza w nowym oknie dialogowym
config.launchbuttonless.help.content=Po zaznaczeniu tej opcji wszelkie hiper\u0142\u0105cza zawarte w pliku wy\u015bwietlania zostan\u0105 przez portlet wy\u015bwietlone w nowym oknie dialogowym.  Je\u015bli ta opcja nie zostanie zaznaczona, hiper\u0142\u0105cza b\u0119d\u0105 wy\u015bwietlane w bie\u017c\u0105cym oknie.  Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.
config.checkseconds.text1=<contextual_help>Czas przechowywania w pami\u0119ci podr\u0119cznej:</contextual_help>
config.checkseconds.text2=s
config.checkseconds.help.title=Konfigurowanie czasu przechowywania w pami\u0119ci podr\u0119cznej
config.checkseconds.help.content=<p>Ta opcja umo\u017cliwia okre\u015blenie czasu przechowywania powy\u017cszych danych w pami\u0119ci podr\u0119cznej przez portlet. W pami\u0119ci podr\u0119cznej zostan\u0105 uwzgl\u0119dnione powy\u017csze opcje konfiguracji, jak r\u00f3wnie\u017c zawarto\u015b\u0107 plik\u00f3w wy\u015bwietlania i plik\u00f3w \u201ezawiera\u201d wymienionych powy\u017cej. Mo\u017ce to przyspieszy\u0107 dzia\u0142anie portletu w przypadku du\u017cego obci\u0105\u017cenia.</p><p>W celu ustawienia czasu przechowywania w pami\u0119ci podr\u0119cznej wpisz okre\u015blon\u0105 liczb\u0119 sekund, np. <code>900</code>, aby ustawi\u0107 15 minut. W celu sta\u0142ego ustawienia przechowywania w pami\u0119ci podr\u0119cznej wprowad\u017a warto\u015b\u0107 <code>-1</code>. Aby wy\u0142\u0105czy\u0107 przechowywanie w pami\u0119ci podr\u0119cznej, wprowad\u017a warto\u015b\u0107 <code>0</code> lub pozostaw puste pole obok tej opcji.</p><p>Bez wzgl\u0119du na dokonany wyb\u00f3r klikni\u0119cie polecenia <b>Zapisz</b> na tej stronie spowoduje usuni\u0119cie zawarto\u015bci pami\u0119ci podr\u0119cznej. Zapisane w tym miejscu zmiany b\u0119d\u0105 zatem mia\u0142y natychmiastowy skutek. Zawarto\u015b\u0107 pami\u0119ci podr\u0119cznej jest usuwana r\u00f3wnie\u017c w przypadku ponownego uruchamiania portletu.</p>
config.okbutton=Zapisz
info.saved=Zmiany zosta\u0142y zapisane.

# messages for view mode 
# (none)

# messages for error handling
error.code=(B\u0142\u0105d: {0})
error.message=B\u0142\u0105d:
error.input=Wyst\u0105pi\u0142 b\u0142\u0105d zwi\u0105zany z wprowadzonymi danymi.
error.internal=\u017b\u0105dana us\u0142uga lub informacja nie jest w tej chwili dost\u0119pna. Spr\u00f3buj ponownie w p\u00f3\u017aniejszym czasie.
error.nullFile=\u017b\u0105dana us\u0142uga lub informacja nie jest w tej chwili dost\u0119pna.  Spr\u00f3buj ponownie p\u00f3\u017aniej.
error.nullFilename=Nazwa pliku wy\u015bwietlania nie mo\u017ce by\u0107 pusta.  Wprowad\u017a zmiany poni\u017cej.
error.pathInFilename=Nazwa pliku wy\u015bwietlania nie mo\u017ce zawiera\u0107 \u015bcie\u017cki katalogu nadrz\u0119dnego (np. odno\u015bnika <code>..</code>).  Wprowad\u017a zmiany poni\u017cej.
error.pathInSubsFilename=Nazwa pliku \u201ezawiera\u201d nie mo\u017ce zawiera\u0107 \u015bcie\u017cki katalogu nadrz\u0119dnego (np. odno\u015bnika <code>..</code>).  Wprowad\u017a zmiany poni\u017cej.
error.checkSecondsValue=Czas przechowywania w pami\u0119ci podr\u0119cznej (w sekundach) musi by\u0107 liczb\u0105 ca\u0142kowit\u0105.  Wprowad\u017a zmiany poni\u017cej.
error.notSaved=Wprowadzone zmiany nie zosta\u0142y zapisane.
#
warn.message=Uwaga:
warn.nullFile=Nie mo\u017cna odnale\u017a\u0107 lub odczyta\u0107 okre\u015blonego poni\u017cej pliku wy\u015bwietlania.  Czy plik zosta\u0142 ju\u017c utworzony i zainstalowany?
warn.nullSubsFile=Nie mo\u017cna odnale\u017a\u0107 lub odczyta\u0107 okre\u015blonego poni\u017cej pliku \u201ezawiera\u201d.  Czy plik zosta\u0142 ju\u017c utworzony i zainstalowany?
