# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Archivo de visualizaci\u00f3n:
config.viewfilename.help.title=Configuraci\u00f3n de un archivo de visualizaci\u00f3n
config.viewfilename.help.content=<p>Introduzca el nombre b\u00e1sico (incluya la extensi\u00f3n) del archivo de visualizaci\u00f3n.  Por ejemplo, <code>myViewFile.html</code>.</p><p>Este archivo tiene el contenido que desea que visualice el portlet y debe existir.  Este archivo debe existir en cada servidor portlet de este cl\u00faster, en la carpeta del conjunto de recursos portlet o una subcarpeta de la misma.  (Si no, el archivo debe existir en la carpeta ra\u00edz o una subcarpeta de la misma dentro del propio portlet WAR (Web Archive)).  Si utiliza una subcarpeta, el nombre del archivo de visualizaci\u00f3n deber\u00eda incluir la ruta de dicha subcarpeta.  Por ejemplo, <code>myFiles/myViewFile.html</code>.</p><p>El contenido del archivo se deber\u00eda localizar para la configuraci\u00f3n regional y de idioma b\u00e1sica.  Si ha traducido el contenido, los archivos de visualizaci\u00f3n traducidos deber\u00edan ir acompa\u00f1ados del archivo de visualizaci\u00f3n b\u00e1sico en la misma ubicaci\u00f3n, y estar etiquetados con la configuraci\u00f3n regional y de idioma correspondiente.</p><p>Podr\u00e1 obtener m\u00e1s informaci\u00f3n al respecto en el documento de administraci\u00f3n.</p>
config.subsfilename=Opcional <contextual_help>incluye el archivo</contextual_help>:
config.subsfilename.help.title=Configuraci\u00f3n de un archivo de inclusi\u00f3n
config.subsfilename.help.content=<p>A menos que el archivo de visualizaci\u00f3n utilice el token <code>{INCLUDE:<i>key</i>}</code>, puede dejar esto en blanco.</p><p>Si el archivo de visualizaci\u00f3n no utiliza ese token, introduzca el nombre del archivo de inclusiones apropiado aqu\u00ed. Por ejemplo, <code>myViewFileIncludes.properties</code>.</p><p>Este archivo contiene los pares de clave-valor que desea que el portlet inserte cuando se generen los tokens <code>{INCLUDE:<i>key</i>}</code> en el archivo de visualizaci\u00f3n.  Si no introduce un nombre de archivo, se supone un archivo con el nombre <code>html_viewer_includes.properties</code>.</p><p>El archivo debe existir en cada servidor de portlet de este cl\u00faster, en una carpeta de la ruta de clases(por ejemplo, la carpeta "recursos globales"), bajo la carpeta del conjunto de recursos portlet o dentro del propio portlet WAR (Web Archive). Si utiliza una subcarpeta, el nombre de archivo de inclusiones debe comenzar con la ruta de la subcarpeta.</p><p>Para obtener m\u00e1s informaci\u00f3n, consulte la documentaci\u00f3n de administraci\u00f3n.</p>
config.launchbuttonless=\u00bfEnlaces abiertos en la <contextual_help>ventana nueva sin botones</contextual_help>?
config.launchbuttonless.help.title=Enlaces de apertura en una ventana nueva sin botones
config.launchbuttonless.help.content=Si marca esta opci\u00f3n, se abrir\u00e1n en una nueva ventana auxiliar sin botones todos los hiperv\u00ednculos que haya en el archivo de visualizaci\u00f3n y se visualicen a trav\u00e9s del portlet.  Si no marca esta opci\u00f3n, se abrir\u00e1n en la ventana actual.  Podr\u00e1 obtener m\u00e1s informaci\u00f3n al respecto en el documento de administraci\u00f3n.
config.checkseconds.text1=<contextual_help>Duraci\u00f3n de cach\u00e9:</contextual_help>
config.checkseconds.text2=segundos
config.checkseconds.help.title=Configuraci\u00f3n de cu\u00e1nto tiempo para cach\u00e9
config.checkseconds.help.content=<p>Con esta opci\u00f3n puede especificar que el portlet puede almacenar en cach\u00e9 los datos anteriores durante una cantidad de tiempo espec\u00edfica. El cach\u00e9 incluir\u00e1 las opciones de configuraci\u00f3n anteriores, as\u00ed como el contenido de la visualizaci\u00f3n y los archivos de inclusi\u00f3n nombrados anteriormente. Esto podr\u00eda mejorar el rendimiento del portlet bajo carga pesada.</p><p>Para habilitar el almacenamiento en cach\u00e9 durante cierta cantidad de segundos, introduzca ese n\u00famero; por ejemplo, <code>900</code> para 15 minutos. Para habilitar el almacenamiento en cach\u00e9 para siempre, introduzca <code>-1</code>. Para deshabilitar el almacenamiento en cach\u00e9, introduzca <code>0</code> o deje la opci\u00f3n en blanco. </p><p>En cualquier caso, al hacer clic en <b>Guardar</b> en esta p\u00e1gina, el cach\u00e9 existente se borrar\u00e1. Por lo tanto, los cambios que guarde aqu\u00ed entrar\u00e1n en efecto inmediatamente. El cach\u00e9 tambi\u00e9n se borra cuando reinicia el portlet.</p>
config.okbutton=Guardar
info.saved=Los cambios se han guardado.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Error: {0})
error.message=Error:
error.input=Surgi\u00f3 un problema con los datos que introdujo.
error.internal=El servicio o informaci\u00f3n solicitada no est\u00e1 disponible en este momento. Int\u00e9ntelo nuevamente m\u00e1s tarde.
error.nullFile=El servicio o informaci\u00f3n solicitada no est\u00e1 disponible en este momento.  Int\u00e9ntelo nuevamente m\u00e1s tarde.
error.nullFilename=El nombre del archivo de visualizaci\u00f3n no puede estar en blanco.  Corr\u00edjalo a continuaci\u00f3n.
error.pathInFilename=El nombre del archivo de visualizaci\u00f3n no puede contener ninguna ruta de directorio primario (por ejemplo, referencia <code>..</code>).  Corr\u00edjalo a continuaci\u00f3n.
error.pathInSubsFilename=El nombre del archivo de inclusi\u00f3n no puede contener ninguna ruta de directorio primario (por ejemplo, referencia <code>..</code>).  Corr\u00edjalo a continuaci\u00f3n.
error.checkSecondsValue=La duraci\u00f3n de cach\u00e9 debe ser el n\u00famero entero de segundos.  Corr\u00edjalo a continuaci\u00f3n.
error.notSaved=Los cambios no se han guardado.
#
warn.message=Advertencia:
warn.nullFile=No se encontr\u00f3 ni se ley\u00f3 el archivo de visualizaci\u00f3n siguiente.  \u00bfYa lo cre\u00f3 e instal\u00f3?
warn.nullSubsFile=No se encontr\u00f3 ni se ley\u00f3 el archivo de inclusi\u00f3n siguiente.  \u00bfYa lo cre\u00f3 e instal\u00f3?
