# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Datoteka za prikaz:
config.viewfilename.help.title=Konfiguriranje datoteke za prikaz
config.viewfilename.help.content=<p>Unesite osnovni naziv (uklju\u010duju\u0107i nastavak) datoteke prikaza.  Primjerice, unesite <code>myViewFile.html</code>.</p><p>U toj datoteci nalazi se sadr\u017eaj koji \u017eelite prikazati putem portleta te ona mora postojati.  Ta bi datoteka trebala postojati na svim poslu\u017eiteljima portleta u ovom klasteru, u mapi paketa resursa portleta ili u njegovoj podmapi.  (Datoteka se mo\u017ee nalaziti i u korijenskoj mapi ili podmapi unutar samog WAR-a portleta.)  Ako koristite podmapu, naziv datoteke prikaza mora sadr\u017eavati put podmape.  Primjerice, <code>myFiles/myViewFile.html</code>.</p><p>Sadr\u017eaj datoteke mora biti lokaliziran na jezik baze.  Ako ste preveli sadr\u017eaj, prevedene datoteke prikaza moraju se nalaziti na istom mjestu kao i osnovne datoteke prikaza te biti na odgovaraju\u0107i na\u010din ozna\u010dene lokalnim postavkama.</p><p>Dodatne informacije potra\u017eite u administracijskom dokumentu.</p>
config.subsfilename=Dodatna <contextual_help>datoteka za obuhva\u0107anje</contextual_help>:
config.subsfilename.help.title=Konfiguriranje datoteke za obuhva\u0107anje
config.subsfilename.help.content=<p>Ako va\u0161a datoteka za prikaz koristi token <code>{INCLUDE:<i>key</i>}</code>, ovaj dio mo\u017eete ostaviti praznim.</p><p>Ako va\u0161a datoteka za prikaz ne koristi taj token, ovdje unesite naziv datoteke za obuhva\u0107anje. Npr., <code>myViewFileIncludes.properties</code>.</p><p>Ta datoteka sadr\u017ei parove vrijednosti klju\u010deva koje portlet mora umetnuti pri renderiranju tokena <code>{INCLUDE:<i>key</i>}</code> u datoteci prikaza.  Ako ne unesete naziv datoteke, koristi se datoteka <code>html_viewer_includes.properties</code>.</p><p>Datoteka bi trebala postojati na svakom poslu\u017eitelju portleta u ovom klasteru, i to u mapi u putu klase (npr., u mapi s globalnim resursima), u mapi paketa resursa portleta ili unutar samog WAR-a portleta. Ako koristite podmapu, naziv datoteke za obuhva\u0107anje mora zapo\u010dinjati putom te podmape.</p><p>Dodatne informacije potra\u017eite u administracijskoj dokumentaciji.</p>
config.launchbuttonless=\u017delite li otvoriti veze u <contextual_help>novom prozoru bez gumba</contextual_help>?
config.launchbuttonless.help.title=Otvaranje veza u novom prozoru bez gumba
config.launchbuttonless.help.content=Ako ozna\u010dite tu mogu\u0107nost, sve hiperveze u sadr\u017eaju datoteke prikaza prikazane putem portleta bit \u0107e otvorene u novom podre\u0111enom prozoru bez gumba.  Ako ne ozna\u010dite tu mogu\u0107nost, hiperveze \u0107e biti otvorene u trenutnom prozoru.  Dodatne informacije potra\u017eite u administracijskom dokumentu.
config.checkseconds.text1=<contextual_help>Trajanje predmemorije:</contextual_help>
config.checkseconds.text2=sekundi
config.checkseconds.help.title=Konfiguracija trajanja predmemorije
config.checkseconds.help.content=<p>Uz tu mogu\u0107nost mo\u017eete navesti da gore navedeni podaci mogu biti predmemorirani putem portleta za odre\u0111eno vremensko razdoblje. Predmemorija \u0107e obuhvatiti gore navedene mogu\u0107nosti konfiguracije te sadr\u017eaj gore navedenih datoteka za prikaz i obuhva\u0107anje. Na taj na\u010din mo\u017eete unaprijediti performanse portleta pod velikim optere\u0107enjem.</p><p>Da biste omogu\u0107ili predmemoriranje za odre\u0111eni broj sekundi, unesite taj broj, na primjer, <code>900</code> za 15 minuta. Da biste omogu\u0107ili trajno predmemoriranje, unesite <code>-1</code>. Da biste onemogu\u0107ili predmemoriranje, unesite <code>0</code> ili mogu\u0107nost ostavite prazno.</p><p>U svakom slu\u010daju, kada na toj stranici kliknete <b>Spremi</b>, postoje\u0107a \u0107e se predmemorija isprazniti. Stoga \u0107e promjene koje ovdje spremite odmah biti primijenjene. Predmemorija \u0107e se isprazniti i kada ponovno pokrenete portlet.</p>
config.okbutton=Spremi
info.saved=Va\u0161e su promjene spremljene.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Pogre\u0161ka: {0})
error.message=Pogre\u0161ka:
error.input=Do\u0161lo je do problema s unesenim podacima.
error.internal=Usluga ili informacija koju ste zatra\u017eili trenutno nije dostupna. Poku\u0161ajte ponovno kasnije.
error.nullFile=Usluga ili informacija koju ste zatra\u017eili trenutno nije dostupna.  Poku\u0161ajte ponovno kasnije.
error.nullFilename=Naziv datoteke prikaza ne mo\u017ee biti prazan.  Ispravite to u nastavku.
error.pathInFilename=Naziv datoteke prikaza ne mo\u017ee sadr\u017eavati put nadre\u0111enog direktorija (tj., referenca <code>..</code>).  Ispravite to u nastavku.
error.pathInSubsFilename=Naziv datoteke za obuhva\u0107anje ne mo\u017ee sadr\u017eavati put nadre\u0111enog direktorija (tj., referenca <code>..</code>).  Ispravite to u nastavku.
error.checkSecondsValue=Trajanje predmemorije mora biti cijeli broj sekundi.  Ispravite to u nastavku.
error.notSaved=Va\u0161e promjene nisu spremljene.
#
warn.message=Upozorenje:
warn.nullFile=Dolje navedenu datoteku za prikaz nije mogu\u0107e prona\u0107i ili pro\u010ditati.  Jeste li je ve\u0107 stvorili i instalirali?
warn.nullSubsFile=Dolje navedenu datoteku za obuhva\u0107anje nije mogu\u0107e prona\u0107i ili pro\u010ditati.  Jeste li je ve\u0107 stvorili i instalirali?
