# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Visningsfil:
config.viewfilename.help.title=Konfigurering af visningsfil
config.viewfilename.help.content=<p>Skriv basisnavnet (inklusive filtype) p\u00e5 visningsfilen.  F.eks. <code>minvisningsfil.html</code>.</p><p>Denne fil indeholder det indhold, som portlet'en skal vise og skal findes.  Filen skal findes p\u00e5 alle portlet-servere i dette cluster, i portlet ressource-bundle mappen eller i en mappe derunder.  (Alternativt kan filen ligge i rodmappen eller i en mappe derunder inde i selve portlet WAR'en).  Hvis du bruger en undermappe, skal visningsfilnavnet inkludere stien til undermappen.  F.eks. <code>minefiler/minvisningsfil.html</code>.</p><p>Filindholdet skal lokaliseres til basislandestandard.  Hvis du har oversat indholdet, skal de oversatte visningsfiler f\u00f8lge basisvisningsfilen i samme placering og v\u00e6re m\u00e6rket med relevant landestandard.</p><p>Se administrationsdokumentet for yderligere oplysninger.</p>
config.subsfilename=Valgfri <contextual_help>includes-fil</contextual_help>:
config.subsfilename.help.title=Konfigurering af en includes-fil
config.subsfilename.help.content=<p>Medmindre visningsfilen benytter <code>{INCLUDE:<i>key</i>}</code> token'et, kan du lade dette v\u00e6re blankt.</p><p>Hvis visningsfilen bruger dette token, skal du skrive navnet p\u00e5 dets includes-fil her. For eksempel <code>minvisningsfilinkluderer.properties</code>.</p><p>Filen indeholder de n\u00f8glev\u00e6rdipar, som portlet'en skal inds\u00e6tte, n\u00e5r <code>{INCLUDE:<i>key</i>}</code> tokens i visningsfilen gengives.  Hvis ikke du angiver et filnavn, bruges filnavnet <code>html_viewer_includes.properties</code>.</p><p>Filen skal findes p\u00e5 alle portlet-servere i dette cluster, i en mappe i classpath (for eksempel mappen med "globale ressourcer"), i portlet ressource-bundle mappen eller i selve portlet-WAR'en. Hvis du benytter en undermappe, skal includes-filnavnet starte med stien til den p\u00e5g\u00e6ldende undermappe.</p><p>Der er flere oplysninger i administrationsdokumentationen.</p>
config.launchbuttonless=\u00c5bn linkene i <contextual_help>nyt vindue uden knapper</contextual_help>?
config.launchbuttonless.help.title=\u00c5bner links i et nyt vindue uden knapper
config.launchbuttonless.help.content=Hvis du markerer denne indstilling, vil hyperlink i det visningsfilindhold, der vises af portlet'en, blive \u00e5bnet i et nyt undervindue uden knapper.  Hvis ikke du markerer dette punkt, \u00e5bnes de i det aktuelle vindue.  Se administrationsdokumentet for yderligere oplysninger.
config.checkseconds.text1=<contextual_help>Cache-varighed:</contextual_help>
config.checkseconds.text2=sekunder
config.checkseconds.help.title=Konfiguration af tid i cache
config.checkseconds.help.content=<p>Med denne indstilling kan du angive, at ovenst\u00e5ende data skal l\u00e6gges i cache af porlet'en i et specifikt tidsrum. Cachen inkluderer ovenst\u00e5ende konfigurationsindstillinger samt indholdet i ovenn\u00e6vnte visnings- og includes-filer. Det kan forbedre ydelsen for porlet'en under kraftig belastning.</p><p>Du aktiverer opbevaring i cache for et specifikt tidsrum ved at skrive et tal, f.eks. <code>900</code> for 15 minutter. Skriv code>-1</code>, hvis caching skal aktiveres for altid. Du deaktiverer caching ved at skrive <code>0</code> eller igenting.</p><p>N\u00e5r du klikker p\u00e5 <b>Gem</b> p\u00e5 denne side, ryddes den eksisterende cache. De \u00e6ndringer, du foretager her, tr\u00e6der derfor i kraft med det samme. Cachen ryddes ogs\u00e5, hvis du genstarter portlet'en.</p>
config.okbutton=Gem
info.saved=Dine \u00e6ndringer er gemt.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Fejl: {0})
error.message=Fejl:
error.input=Der var et problem med de angivne data.
error.internal=Den tjeneste eller de oplysninger, du har bedt om, er i \u00f8jeblikket ikke tilg\u00e6ngelige. Pr\u00f8v igen senere.
error.nullFile=Den tjeneste eller de oplysninger, du har bedt om, er i \u00f8jeblikket ikke tilg\u00e6ngelige.  Pr\u00f8v igen senere.
error.nullFilename=Visningsfilens navn m\u00e5 ikke v\u00e6re tomt.  Ret det nedenfor.
error.pathInFilename=Visningsfilens navn m\u00e5 ikke indeholde en sti til overordnet bibliotek (dvs. <code>..</code> reference).  Ret det nedenfor.
error.pathInSubsFilename=Includes-filens navn m\u00e5 ikke indeholde en sti til overordnet bibliotek (dvs. <code>..</code> reference).  Ret det nedenfor.
error.checkSecondsValue=Cache-varigheden skal v\u00e6re et helt antal sekunder.  Ret det nedenfor.
error.notSaved=Dine \u00e6ndringer blev ikke gemt.
#
warn.message=Advarsel:
warn.nullFile=Nedenst\u00e5ende visningsfil findes ikke eller kan ikke l\u00e6ses.  Har du oprettet og installeret filen?
warn.nullSubsFile=Nedenst\u00e5ende includes-fil findes ikke eller kan ikke l\u00e6ses.  Har du oprettet og installeret filen?
