# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Fi\u015fier vizualizare:
config.viewfilename.help.title=Configurarea unui fi\u015fier de vizualizare
config.viewfilename.help.content=<p>Introduce\u0163i numele de baz\u0103 (inclusiv extensia) pentru fi\u015fierul de vizualizare.  De exemplu, <code>myViewFile.html</code>.</p><p>\u00cen acest fi\u015fier, care trebuie s\u0103 existe, se g\u0103se\u015fte con\u0163inutul care dori\u0163i s\u0103 fie afi\u015fat de portlet.  Acest fi\u015fier trebuie s\u0103 existe pe fiecare server de portlet din acest cluster, \u00een folderul pachetului de resurse pentru portlet sau \u00eentr-un subfolder corespunz\u0103tor.  (\u00cen mod alternativ, fi\u015fierul poate s\u0103 existe \u00een folderul r\u0103d\u0103cin\u0103 sau \u00eentr-un subfolder corespunz\u0103tor din arhiva WAR a portletului.)  Dac\u0103 utiliza\u0163i un subfolder, numele fi\u015fierului de vizualizare trebuie s\u0103 includ\u0103 calea acelui subfolder.  De exemplu, <code>myFiles/myViewFile.html</code>.</p><p>Con\u0163inutul fi\u015fierului trebuie s\u0103 fie localizat \u00een corela\u0163ie cu set\u0103rile locale de baz\u0103.  Dac\u0103 a\u0163i tradus con\u0163inutul, fi\u015fierele de vizualizare traduse trebuie s\u0103 \u00eenso\u0163easc\u0103 fi\u015fierul de vizualizare de baz\u0103 \u00een aceea\u015fi loca\u0163ie \u015fi s\u0103 fie etichetate corespunz\u0103tor cu set\u0103rile locale.</p><p>Pentru informa\u0163ii suplimentare, consulta\u0163i documentul de administrare.</p>
config.subsfilename=<contextual_help>Fi\u015fier de includeri</contextual_help> op\u0163ional:
config.subsfilename.help.title=Configurarea unui fi\u015fier de includeri
config.subsfilename.help.content=<p>Dac\u0103 fi\u015fierul de vizualizare nu utilizeaz\u0103 tokenul <code>{INCLUDE:<i>key</i>}</code>, pute\u0163i s\u0103-l l\u0103sa\u0163i necompletat.</p><p>Dac\u0103 fi\u015fierul de vizualizare utilizeaz\u0103 acel token, introduce\u0163i aici numele fi\u015fierului de includeri corespunz\u0103tor. De exemplu, <code>myViewFileIncludes.properties</code>.</p><p>Acest fi\u015fier con\u0163ine perechile cheie-valoare pe care dori\u0163i s\u0103 le insereze portletul la redarea tokenurilor <code>{INCLUDE:<i>key</i>}</code> \u00een fi\u015fierul de vizualizare.  Dac\u0103 nu introduce\u0163i un nume de fi\u015fier, se asociaz\u0103 fi\u015fierul cu numele <code>html_viewer_includes.properties</code>.</p><p>Fi\u015fierul trebuie s\u0103 existe pe fiecare server de portlet din acest cluster, \u00eentr-un folder din calea clasei (de exemplu, folderul \u201eresurse globale\u201d), \u00een folderul pachetului de resurse pentru portlet sau \u00een arhiva WAR a portletului. Dac\u0103 utiliza\u0163i un subfolder, numele fi\u015fierului de includeri trebuie s\u0103 \u00eenceap\u0103 cu calea acelui subfolder.</p><p>Pentru informa\u0163ii suplimentare, consulta\u0163i documenta\u0163ia de administrare.</p>
config.launchbuttonless=Deschide\u0163i leg\u0103turile \u00eentr-o <contextual_help>nou\u0103 fereastr\u0103 f\u0103r\u0103 butoane</contextual_help>?
config.launchbuttonless.help.title=Deschidere leg\u0103turi \u00eentr-o nou\u0103 fereastr\u0103 f\u0103r\u0103 butoane
config.launchbuttonless.help.content=Dac\u0103 bifa\u0163i aceast\u0103 op\u0163iune, toate hyperlinkurile din con\u0163inutul fi\u015fierului de vizualizare afi\u015fat de portlet se vor deschide \u00eentr-o nou\u0103 fereastr\u0103 copil, f\u0103r\u0103 butoane.  Dac\u0103 nu bifa\u0163i aceast\u0103 op\u0163iune, se vor deschide \u00een fereastra curent\u0103.  Pentru informa\u0163ii suplimentare, consulta\u0163i documentul de administrare.
config.checkseconds.text1=<contextual_help>Durat\u0103 cache:</contextual_help>
config.checkseconds.text2=secunde
config.checkseconds.help.title=Configurarea duratei de memorare \u00een cache
config.checkseconds.help.content=<p>Cu aceast\u0103 op\u0163iune pute\u0163i s\u0103 specifica\u0163i ca datele de mai sus s\u0103 fie memorate de portlet \u00een cache pentru o anumit\u0103 perioad\u0103 de timp. \u00cen cache vor fi incluse op\u0163iunile de configurare de mai sus, precum \u015fi ce con\u0163in fi\u015fierul de vizualizare \u015fi fi\u015fierul de includeri numite mai sus. Astfel se pot \u00eembun\u0103t\u0103\u0163i performan\u0163ele portletului la o \u00eenc\u0103rcare mare.</p><p>Pentru a activa memorarea \u00een cache pentru un anumit num\u0103r de secunde, introduce\u0163i acel num\u0103r \u2013 de exemplu <code>900</code> pentru 15 minute. Pentru a activa memorarea permanent\u0103 \u00een cache, introduce\u0163i <code>-1</code>. Pentru a dezactiva memorarea \u00een cache, introduce\u0163i <code>0</code> sau l\u0103sa\u0163i op\u0163iunea necompletat\u0103.</p><p>\u00cen orice caz, c\u00e2nd face\u0163i clic pe <b>Salvare</b> \u00een aceast\u0103 pagin\u0103, memoria cache existent\u0103 va fi \u015ftears\u0103. Astfel, modific\u0103rile pe care le salva\u0163i aici vor avea efect imediat. De asemenea, con\u0163inutul din cache este \u015fters c\u00e2nd reporni\u0163i portletul.</p>
config.okbutton=Salvare
info.saved=Modific\u0103rile au fost salvate.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Eroare: {0})
error.message=Eroare:
error.input=A existat o problem\u0103 cu datele introduse.
error.internal=Serviciul sau informa\u0163iile solicitate nu sunt disponibile \u00een acest moment. Re\u00eencerca\u0163i mai t\u00e2rziu.
error.nullFile=Serviciul sau informa\u0163iile solicitate nu sunt disponibile \u00een acest moment.  Re\u00eencerca\u0163i mai t\u00e2rziu.
error.nullFilename=Numele fi\u015fierului de vizualizare nu poate r\u0103m\u00e2ne necompletat.  Corecta\u0163i-l mai jos.
error.pathInFilename=Numele fi\u015fierului de vizualizare nu poate con\u0163ine nicio cale de director p\u0103rinte (adic\u0103 o referin\u0163\u0103 <code>...</code>).  Corecta\u0163i-l mai jos.
error.pathInSubsFilename=Numele fi\u015fierului de includeri nu poate con\u0163ine nicio cale de director p\u0103rinte (adic\u0103 o referin\u0163\u0103 <code>...</code>).  Corecta\u0163i-l mai jos.
error.checkSecondsValue=Timpul de memorare \u00een cache trebuie s\u0103 fie un num\u0103r \u00eentreg de secunde.  Corecta\u0163i-l mai jos.
error.notSaved=Modific\u0103rile nu au fost salvate.
#
warn.message=Avertisment:
warn.nullFile=Fi\u015fierul de vizualizare cu numele de mai jos nu poate fi g\u0103sit sau citit.  \u00cenc\u0103 nu l-a\u0163i creat \u015fi instalat?
warn.nullSubsFile=Fi\u015fierul de includeri cu numele de mai jos nu poate fi g\u0103sit sau citit.  \u00cenc\u0103 nu l-a\u0163i creat \u015fi instalat?
