# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb:
config.viewfilename.help.title=\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u306e\u8a2d\u5b9a
config.viewfilename.help.content=<p>\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u306e\u30d9\u30fc\u30b9\u540d (\u62e1\u5f35\u5b50\u3092\u542b\u3080) \u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u305f\u3068\u3048\u3070\u3001<code>myViewFile.html</code> \u306e\u3088\u3046\u306b\u5165\u529b\u3057\u307e\u3059\u3002</p><p>\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3067\u8868\u793a\u3059\u308b\u30b3\u30f3\u30c6\u30f3\u30c4\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u5fc5\u9808\u3067\u3059\u3002  \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u3053\u306e\u30af\u30e9\u30b9\u30bf\u306e\u5404\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 \u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 \u30ea\u30bd\u30fc\u30b9 \u30d0\u30f3\u30c9\u30eb \u30d5\u30a9\u30eb\u30c0\u307e\u305f\u306f\u305d\u306e\u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u306b\u7f6e\u304f\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  (\u307e\u305f\u306f\u3001\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 WAR \u5185\u306e\u30eb\u30fc\u30c8 \u30d5\u30a9\u30eb\u30c0\u307e\u305f\u306f\u305d\u306e\u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u306b\u7f6e\u304f\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002)  \u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306b\u306f\u3001\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u540d\u306b\u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u306e\u30d1\u30b9\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  \u305f\u3068\u3048\u3070\u3001<code>myFiles/myViewFile.html</code> \u306e\u3088\u3046\u306b\u6307\u5b9a\u3057\u307e\u3059\u3002\u30d5\u30a1\u30a4\u30eb\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306f\u30d9\u30fc\u30b9 \u30ed\u30b1\u30fc\u30eb\u306b\u5408\u308f\u305b\u3066\u30ed\u30fc\u30ab\u30e9\u30a4\u30ba\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  \u30b3\u30f3\u30c6\u30f3\u30c4\u3092\u7ffb\u8a33\u3057\u305f\u5834\u5408\u3001\u7ffb\u8a33\u6e08\u307f\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u3068\u30d9\u30fc\u30b9 \u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u3092\u540c\u3058\u5834\u6240\u306b\u7f6e\u3044\u3066\u3001\u30ed\u30b1\u30fc\u30eb\u306b\u5fdc\u3058\u305f\u30bf\u30b0\u3092\u4ed8\u3051\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002</p><p>\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u7ba1\u7406\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
config.subsfilename=\u30aa\u30d7\u30b7\u30e7\u30f3\u306e<contextual_help>\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb</contextual_help>:
config.subsfilename.help.title=\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u306e\u8a2d\u5b9a
config.subsfilename.help.content=<p>\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u3067 <code>{INCLUDE:<i>key</i>}</code> \u30c8\u30fc\u30af\u30f3\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u3092\u9664\u304d\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7a7a\u767d\u306e\u307e\u307e\u3067\u69cb\u3044\u307e\u305b\u3093\u3002</p><p>\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u3067\u3053\u306e\u30c8\u30fc\u30af\u30f3\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u306e\u540d\u524d\u3092\u3053\u3053\u306b\u5165\u529b\u3057\u307e\u3059\u3002 \u305f\u3068\u3048\u3070\u3001<code>myViewFileIncludes.properties</code> \u306e\u3088\u3046\u306b\u5165\u529b\u3057\u307e\u3059\u3002</p><p>\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306b\u306f\u3001\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u306e <code>{INCLUDE:<i>key</i>}</code> \u30c8\u30fc\u30af\u30f3\u3092\u8868\u793a\u3059\u308b\u3068\u304d\u306b\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3067\u633f\u5165\u3059\u308b\u30ad\u30fc\u5024\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u3059\u3002  \u30d5\u30a1\u30a4\u30eb\u540d\u3092\u5165\u529b\u3057\u306a\u3044\u3068\u3001<code>html_viewer_includes.properties</code> \u3068\u3044\u3046\u540d\u524d\u306e\u30d5\u30a1\u30a4\u30eb\u304c\u4f7f\u7528\u3055\u308c\u308b\u3082\u306e\u3068\u307f\u306a\u3055\u308c\u307e\u3059\u3002</p><p>\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 \u30ea\u30bd\u30fc\u30b9 \u30d0\u30f3\u30c9\u30eb \u30d5\u30a9\u30eb\u30c0\u306e\u4e0b\u307e\u305f\u306f\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 WAR \u5185\u306e\u3001\u3053\u306e\u30af\u30e9\u30b9\u30bf\u306e\u5404\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8 \u30b5\u30fc\u30d0\u30fc\u306e\u30af\u30e9\u30b9\u30d1\u30b9\u4e0a\u306e\u30d5\u30a9\u30eb\u30c0 (\u300c\u30b0\u30ed\u30fc\u30d0\u30eb \u30ea\u30bd\u30fc\u30b9\u300d\u30d5\u30a9\u30eb\u30c0\u306a\u3069) \u306b\u7f6e\u304f\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306b\u306f\u3001\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u540d\u306e\u5148\u982d\u306b\u305d\u306e\u30b5\u30d6\u30d5\u30a9\u30eb\u30c0\u306e\u30d1\u30b9\u3092\u542b\u3081\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002</p><p>\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u7ba1\u7406\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</p>
config.launchbuttonless=\u30ea\u30f3\u30af\u3092<contextual_help>\u65b0\u3057\u3044\u30dc\u30bf\u30f3\u306e\u306a\u3044\u30a6\u30a3\u30f3\u30c9\u30a6</contextual_help>\u3067\u958b\u304d\u307e\u3059\u304b?
config.launchbuttonless.help.title=\u65b0\u3057\u3044\u30dc\u30bf\u30f3\u306e\u306a\u3044\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u30ea\u30f3\u30af\u3092\u958b\u304f
config.launchbuttonless.help.content=\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30aa\u30f3\u306b\u3057\u305f\u5834\u5408\u3001\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3067\u8868\u793a\u3055\u308c\u308b\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb \u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u30cf\u30a4\u30d1\u30fc\u30ea\u30f3\u30af\u306f\u3059\u3079\u3066\u3001\u30dc\u30bf\u30f3\u306e\u306a\u3044\u65b0\u3057\u3044\u5b50\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u958b\u304d\u307e\u3059\u3002  \u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30aa\u30d5\u306b\u3059\u308b\u3068\u3001\u73fe\u5728\u306e\u30a6\u30a3\u30f3\u30c9\u30a6\u3067\u958b\u304d\u307e\u3059\u3002  \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u7ba1\u7406\u30de\u30cb\u30e5\u30a2\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
config.checkseconds.text1=<contextual_help>\u30ad\u30e3\u30c3\u30b7\u30e5\u6642\u9593:</contextual_help>
config.checkseconds.text2=\u79d2
config.checkseconds.help.title=\u30ad\u30e3\u30c3\u30b7\u30e5\u3059\u308b\u6642\u9593\u306e\u8a2d\u5b9a
config.checkseconds.help.content=<p>\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u306f\u3001\u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3067\u4e0a\u8a18\u306e\u30c7\u30fc\u30bf\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u3059\u308b\u6642\u9593\u3092\u6307\u5b9a\u3067\u304d\u307e\u3059\u3002 \u30ad\u30e3\u30c3\u30b7\u30e5\u306f\u4e0a\u8a18\u306e\u8a2d\u5b9a\u30aa\u30d7\u30b7\u30e7\u30f3\u3060\u3051\u3067\u306f\u306a\u304f\u3001\u4e0a\u8a18\u3067\u6307\u5b9a\u3057\u305f\u30d3\u30e5\u30fc\u3068\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u3092\u542b\u307f\u307e\u3059\u3002 \u3053\u306e\u3053\u3068\u306b\u3088\u308a\u3001\u904e\u8ca0\u8377\u306e\u4e0b\u3067\u306e\u30dd\u30fc\u30c8\u30ec\u30fc\u30c8\u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u304c\u5411\u4e0a\u3057\u307e\u3059\u3002</p><p>\u6307\u5b9a\u3057\u305f\u79d2\u6570\u3001\u30ad\u30e3\u30c3\u30b7\u30f3\u30b0\u3092\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u3001\u305f\u3068\u3048\u3070\u300115 \u5206\u306e\u5834\u5408\u306f\u3001<code>900</code> \u3068\u3044\u3046\u3088\u3046\u306b\u6570\u5b57\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30ad\u30e3\u30c3\u30b7\u30f3\u30b0\u3092\u6052\u4e45\u7684\u306b\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u3001<code>-1</code> \u3068\u5165\u529b\u3057\u307e\u3059\u3002 \u30ad\u30e3\u30c3\u30b7\u30f3\u30b0\u3092\u7121\u52b9\u306b\u3059\u308b\u306b\u306f\u3001<code>0</code> \u3092\u5165\u529b\u3059\u308b\u304b\u3001\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u7a7a\u767d\u306e\u307e\u307e\u306b\u3057\u307e\u3059\u3002</p><p>\u3044\u304b\u306a\u308b\u5834\u5408\u3067\u3082\u3001\u3053\u306e\u30da\u30fc\u30b8\u3067 <b>[\u4fdd\u5b58]</b> \u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u65e2\u5b58\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002 \u3057\u305f\u304c\u3063\u3066\u3001\u3053\u3053\u3067\u4fdd\u5b58\u3057\u305f\u5909\u66f4\u306f\u305f\u3060\u3061\u306b\u6709\u52b9\u306b\u306a\u308a\u307e\u3059\u3002 \u30dd\u30fc\u30c8\u30ec\u30c3\u30c8\u3092\u518d\u958b\u3059\u308b\u3068\u304d\u306b\u306f\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u3082\u30af\u30ea\u30a2\u3055\u308c\u307e\u3059\u3002</p>
config.okbutton=[\u4fdd\u5b58]
info.saved=\u5909\u66f4\u5185\u5bb9\u304c\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f\u3002

# messages for view mode 
# (none)

# messages for error handling
error.code=(\u30a8\u30e9\u30fc: {0})
error.message=\u30a8\u30e9\u30fc:
error.input=\u5165\u529b\u3057\u305f\u30c7\u30fc\u30bf\u306b\u554f\u984c\u304c\u3042\u308a\u307e\u3057\u305f\u3002
error.internal=\u8981\u6c42\u3057\u305f\u30b5\u30fc\u30d3\u30b9\u307e\u305f\u306f\u60c5\u5831\u306f\u305f\u3060\u3044\u307e\u3054\u5229\u7528\u306b\u306a\u308c\u307e\u305b\u3093\u3002 \u5f8c\u307b\u3069\u3001\u6539\u3081\u3066\u304a\u8a66\u3057\u304f\u3060\u3055\u3044\u3002
error.nullFile=\u8981\u6c42\u3057\u305f\u30b5\u30fc\u30d3\u30b9\u307e\u305f\u306f\u60c5\u5831\u306f\u305f\u3060\u3044\u307e\u3054\u5229\u7528\u306b\u306a\u308c\u307e\u305b\u3093\u3002  \u3057\u3070\u3089\u304f\u3057\u3066\u304b\u3089\u3082\u3046\u4e00\u5ea6\u304a\u8a66\u3057\u304f\u3060\u3055\u3044\u3002
error.nullFilename=\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u540d\u3092\u7a7a\u767d\u306b\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002  \u4ee5\u4e0b\u3067\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.pathInFilename=\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u540d\u306b\u306f\u89aa\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9 (\u3064\u307e\u308a\u3001<code>..</code> \u53c2\u7167) \u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002  \u4ee5\u4e0b\u3067\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.pathInSubsFilename=\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u540d\u306b\u306f\u89aa\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u306e\u30d1\u30b9 (\u4f8b\u3001<code>..</code> \u53c2\u7167) \u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002  \u4ee5\u4e0b\u3067\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.checkSecondsValue=\u30ad\u30e3\u30c3\u30b7\u30e5\u6642\u9593\u306b\u306f\u3001\u79d2\u6570\u3092\u6574\u6570\u3067\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  \u4ee5\u4e0b\u3067\u4fee\u6b63\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.notSaved=\u5909\u66f4\u5185\u5bb9\u304c\u4fdd\u5b58\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
#
warn.message=\u8b66\u544a\uff1a
warn.nullFile=\u4ee5\u4e0b\u306b\u6307\u5b9a\u3055\u308c\u305f\u30d3\u30e5\u30fc \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u304b\u3001\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002  \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3057\u3066\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3042\u308a\u307e\u3059\u304b?
warn.nullSubsFile=\u4ee5\u4e0b\u306b\u6307\u5b9a\u3055\u308c\u305f\u30a4\u30f3\u30af\u30eb\u30fc\u30c9 \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u3089\u306a\u3044\u304b\u3001\u8aad\u307f\u53d6\u308c\u307e\u305b\u3093\u3002  \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3057\u3066\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3042\u308a\u307e\u3059\u304b?
