# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Skat\u012b\u0161anas fails:
config.viewfilename.help.title=Skat\u012b\u0161anas faila konfigur\u0113\u0161ana
config.viewfilename.help.content=<p>Ievadiet skat\u012b\u0161an\u0101s faila pamata nosaukumu (ieskaitot papla\u0161in\u0101jumu).  Piem\u0113ram, <code>myViewFile.html</code>.</p><p>\u0160is fails satur saturu, kuru v\u0113laties, lai port\u0101la komponents r\u0101d\u012btu, un tas nedr\u012bkst neeksist\u0113t.  \u0160\u012bm failam j\u0101eksist\u0113 katr\u0101 \u0161\u012b klastera port\u0101la komponentu server\u012b, port\u0101la komponentu resursu sai\u0161\u0137a map\u0113 vai nor\u0101d\u012btaj\u0101 apak\u0161map\u0113.  (K\u0101 alternat\u012bva, \u0161is fails var eksist\u0113t pamatmap\u0113 vai \u0161eit nor\u0101d\u012btaj\u0101 map\u0113 pa\u0161\u0101 port\u0101la komponent\u0101 WAR.)  Ja izmantojat apak\u0161mapi, skat\u012b\u0161anas faila nosaukumam j\u0101satur apak\u0161mapes ce\u013c\u0161.  Piem\u0113ram, <code>myFiles/myViewFile.html</code>.</p><p>Faila saturam j\u0101b\u016bt lokaliz\u0113tam pamata lokaliz\u0101cijai.  Ja saturs ir tulkots, tulkotajiem skat\u012b\u0161anas failiem j\u0101atrodas taj\u0101 pa\u0161\u0101 lok\u0101cij\u0101, kur pamata skat\u012b\u0161anas failam, un tiem j\u0101b\u016bt atz\u012bm\u0113tiem ar atbilsto\u0161o lokaliz\u0101ciju.</p><p>L\u016bdzu, lai ieg\u016btu papildinform\u0101ciju, skatiet administr\u0101cijas dokumentu.</p>
config.subsfilename=Papildus <contextual_help>pievienotais fails</contextual_help>:
config.subsfilename.help.title=Konfigur\u0113\u0161anas pievienotais failu
config.subsfilename.help.content=<p>Ja vien j\u016bsu skat\u012b\u0161an\u0101s fails neizmanto <code>{INCLUDE:<i>key</i>}</code> pilnvaru, varat atst\u0101t \u0161o lauku tuk\u0161u.</p><p>Ja j\u016bsu skat\u012b\u0161an\u0101s fails izmanto \u0161\u0101du pilnvaru, tad \u0161eit ievadiet pievienot\u0101 faila nosaukumu. Piem\u0113ram, <code>myViewFileIncludes.properties</code>.</p><p>\u0160is fails satur atsl\u0113gu-v\u0113rt\u012bbu p\u0101rus, kurus v\u0113laties, lai port\u0101la komponents ievietotu, kad tiek apstr\u0101d\u0101tas <code>{INCLUDE:<i>key</i>}</code> pilnvaras j\u016bsu skat\u012b\u0161an\u0101s fail\u0101.  Ja neievad\u0101t faila nosaukumu, tad tiek uzskat\u012bts, ka ievad\u012bts <code>html_viewer_includes.properties</code> fails.</p><p>\u0160im failam ir j\u0101eksist\u0113 uz katra port\u0101la komponentu servera \u0161aj\u0101 klaster\u012b, map\u0113, kas nor\u0101d\u012bta kla\u0161u ce\u013c\u0101 (piem\u0113ram, "glob\u0101lo resursu" map\u0113), port\u0101la komponentu resursu sai\u0161\u0137a map\u0113 vai pa\u0161\u0101 port\u0101la komponent\u0101 WAR. Ja izmantojat apak\u0161mapi, pievienot\u0101 faila nosaukumam ir j\u0101s\u0101kas ar \u0161\u012bs apak\u0161mapes ce\u013cu.</p><p>Lai ieg\u016btu papildinform\u0101ciju, l\u016bdzu, skatiet administr\u0113\u0161anas dokument\u0101ciju.</p>
config.launchbuttonless=Atv\u0113rt saites <contextual_help>jaun\u0101 log\u0101 bez pog\u0101m</contextual_help>?
config.launchbuttonless.help.title=Sai\u0161u atv\u0113r\u0161ana jaun\u0101 log\u0101 bez pog\u0101m
config.launchbuttonless.help.content=Ja atz\u012bm\u0113jat \u0161o opciju, jebkuras port\u0101la komponenta par\u0101d\u012bt\u0101 skat\u012b\u0161anas faila satur\u0101 eso\u0161\u0101s hipersaites tiks atv\u0113rtas jaun\u0101 atvasin\u0101taj\u0101 log\u0101 bez pog\u0101m.  Ja neatz\u012bm\u0113jat \u0161o opciju, t\u0101s tiks atv\u0113rtas pa\u0161reiz\u0113j\u0101 log\u0101.  Lai ieg\u016btu papildinform\u0101ciju, l\u016bdzu skatiet administr\u0113\u0161anas dokumentu.
config.checkseconds.text1=<contextual_help>Ke\u0161atmi\u0146as ilgums:</contextual_help>
config.checkseconds.text2=sekundes
config.checkseconds.help.title=Uzst\u0101diet, cik ilgi uztur\u0113t ke\u0161atmi\u0146u
config.checkseconds.help.content=<p>Izmantojot \u0161o iesp\u0113ju, J\u016bs varat nor\u0101d\u012bt, ka iepriek\u0161 min\u0113tie dati ir ierakst\u012bti ke\u0161atmi\u0146\u0101 ar port\u0101lu uz noteiktu laiku. Ke\u0161atmi\u0146a satur\u0113s iepriek\u0161\u0113j\u0101s konfigur\u0101cijas iesp\u0113jas, k\u0101 ar\u012b skatu saturu un iepriek\u0161 pievienotos failus. Tas var pal\u012bdz\u0113t uzlabot port\u0101la veiktsp\u0113ju pie lielas noslodzes.</p><p>Lai aktiviz\u0113tu ke\u0161o\u0161anu uz da\u017e\u0101m sekund\u0113m, ievadiet \u0161o numuru - piem\u0113ram, <code>900</code> 15 min\u016bt\u0113m. Lai aktiviz\u0113tu ke\u0161o\u0161anu uz viesiem laikiem, ievadiet <code>-1</code>. Lai atsl\u0113gtu ke\u0161o\u0161anu, ievadiet <code>0</code> vai atst\u0101jiet iesp\u0113ju tuk\u0161u.</p><p>Jebkur\u0101 gad\u012bjum\u0101, kad noklik\u0161\u0137iniet <b>Saglab\u0101t</b> \u0161aj\u0101 lap\u0101, eso\u0161\u0101 ke\u0161atmi\u0146a tiks izdz\u0113sta. T\u0101d\u0113\u013c izmai\u0146as, kuras j\u016bs \u0161eit saglab\u0101jat, st\u0101sies sp\u0113k\u0101 nekav\u0113joties. Ke\u0161atmi\u0146a tiek ar\u012b izdz\u0113sta, kad j\u016bs restart\u0113jat port\u0101lu.</p>
config.okbutton=Saglab\u0101t
info.saved=J\u016bsu veikt\u0101s izmai\u0146as tika saglab\u0101tas.

# messages for view mode 
# (none)

# messages for error handling
error.code=(K\u013c\u016bda: {0})
error.message=K\u013c\u016bda:
error.input=Bija probl\u0113ma ar j\u016bsu ievad\u012btajiem datiem.
error.internal=J\u016bsu piepras\u012btais pakalpojums vai inform\u0101cija \u0161obr\u012bd nav pieejama. L\u016bdzu, m\u0113\u0123iniet v\u0113lreiz v\u0113l\u0101k.
error.nullFile=J\u016bsu piepras\u012btais pakalpojums vai inform\u0101cija \u0161obr\u012bd nav pieejama.  L\u016bdzu, m\u0113\u0123iniet v\u0113lreiz v\u0113l\u0101k.
error.nullFilename=Skat\u012b\u0161anas faila nosaukums nevar b\u016bt tuk\u0161s.  L\u016bdzu to izlabojiet zem\u0101k.
error.pathInFilename=Skat\u012b\u0161anas faila nosaukums nevar satur\u0113t saturo\u0161\u0101s mapes ce\u013cu (t.i. , <code>..</code> atsauce).  L\u016bdzu, to izlabojiet zem\u0101k.
error.pathInSubsFilename=Pievienot\u0101 faila nosaukums nevar satur\u0113t saturo\u0161\u0101s mapes ce\u013cu (t.i. , <code>..</code> atsauce).  L\u016bdzu, to izlabojiet zem\u0101k.
error.checkSecondsValue=Ke\u0161atmi\u0146as ilgumam ir j\u0101b\u016bt veselam skaitlim sekund\u0113s.  L\u016bdzu, to izlabojiet zem\u0101k.
error.notSaved=J\u016bsu veikt\u0101s izmai\u0146as netika saglab\u0101tas.
#
warn.message=Br\u012bdin\u0101jums:
warn.nullFile=Zem\u0101k nor\u0101d\u012btais skat\u012b\u0161an\u0101s fails nav atrodams vai las\u0101ms.  Vai esat to izveidojis un instal\u0113jis?
warn.nullSubsFile=Zem\u0101k nor\u0101d\u012btais pievienotais fails nav atrodams vai las\u0101ms.  Vai esat to izveidojis un instal\u0113jis?
