# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=G\u00f6r\u00fcn\u00fcm dosyas\u0131:
config.viewfilename.help.title=G\u00f6r\u00fcn\u00fcm dosyas\u0131 yap\u0131land\u0131rma
config.viewfilename.help.content=<p>G\u00f6r\u00fcn\u00fcm dosyas\u0131n\u0131n taban ad\u0131n\u0131 (uzant\u0131 dahil) girin.  \u00d6rne\u011fin, <code>myViewFile.html</code>.</p><p>Bu dosya, portlet'in g\u00f6r\u00fcnt\u00fclemesini istedi\u011finiz i\u00e7erikleri bar\u0131nd\u0131r\u0131r ve bulunmak zorundad\u0131r.  Bu dosya, bu k\u00fcmedeki her portlet sunucusunda, portlet kaynak grubu <code>html</code> klas\u00f6r\u00fcnde veya bunun bir alt klas\u00f6r\u00fcnde bulunmal\u0131d\u0131r.  (Alternatif olarak dosya, <code>html</code> klas\u00f6r\u00fcnde veya portlet WAR i\u00e7inde bunun bir alt klas\u00f6r\u00fcnde bulunabilir.)  Alt klas\u00f6r kullan\u0131yorsan\u0131z, g\u00f6r\u00fcn\u00fcm dosyas\u0131 ad\u0131 bu alt klas\u00f6r yolunu i\u00e7ermelidir.  \u00d6rne\u011fin, <code>myFiles/myViewFile.html</code>.</p><p>Taban yerel ayarlar\u0131 i\u00e7in dosya i\u00e7eri\u011fi yerelle\u015ftirilmelidir.  \u0130\u00e7eri\u011fi \u00e7evirdiyseniz, \u00e7evrilen g\u00f6r\u00fcn\u00fcm dosyalar\u0131, ayn\u0131 konumda taban g\u00f6r\u00fcn\u00fcm dosyas\u0131yla birlikte bulunmal\u0131 ve uygun \u015fekilde yerel ayarlarla etiketlenmelidir.</p><p>L\u00fctfen daha fazla bilgi i\u00e7in y\u00f6netim belgesine ba\u015fvurun.</p>
config.subsfilename=<contextual_help>Belirte\u00e7 de\u011fi\u015fimleri dosyas\u0131</contextual_help> (iste\u011fe ba\u011fl\u0131):
config.subsfilename.help.title=Belirte\u00e7 de\u011fi\u015fimleri dosyas\u0131 yap\u0131land\u0131rma
config.subsfilename.help.content=<p>G\u00f6r\u00fcn\u00fcm dosyan\u0131z <code>{INCLUDE:<i>anahtar</i>}</code> belirteci kullanm\u0131yorsa, bunu bo\u015f b\u0131rakabilirsiniz.</p><p>G\u00f6r\u00fcn\u00fcm dosyan\u0131z bu belirteci kullan\u0131yorsa, bu belirtecin belirte\u00e7 de\u011fi\u015fimleri dosyas\u0131 ad\u0131n\u0131 buraya girin. \u00d6rne\u011fin, <code>myViewFileIncludes.properties</code>.</p><p>Bu dosya portlet'in g\u00f6r\u00fcn\u00fcm dosyan\u0131zdaki <code>{INCLUDE:<i>anahtar</i>}</code> belirte\u00e7lerini olu\u015ftururken eklemesini istedi\u011finiz anahtar-de\u011fer \u00e7iftlerini i\u00e7erir.  Bir dosya ad\u0131 girmezseniz, <code>html_viewer_includes.properties</code> dosya ad\u0131 kullan\u0131l\u0131r.</p><p>Dosya bu k\u00fcmedeki her portlet sunucusunda, s\u0131n\u0131f yolundaki bir klas\u00f6rde (\u00f6rne\u011fin, "genel kaynaklar" klas\u00f6r\u00fcn\u00fczde) var olmal\u0131d\u0131r. (Alternatif olarak dosya <code>/WEB-INF/classes</code> klas\u00f6r\u00fcndeki portlet WAR i\u00e7inde yer alabilir.) Bir alt klas\u00f6r kullan\u0131yorsan\u0131z, belirte\u00e7 de\u011fi\u015fimleri dosya ad\u0131 s\u00f6z konusu alt klas\u00f6r yoluyla ba\u015flamal\u0131d\u0131r.</p><p>L\u00fctfen daha fazla bilgi i\u00e7in y\u00f6netim belgelerine bak\u0131n.</p>
config.launchbuttonless=<contextual_help>Yeni d\u00fc\u011fmesiz pencerede</contextual_help> ba\u011flant\u0131lar\u0131 a\u00e7?
config.launchbuttonless.help.title=Yeni d\u00fc\u011fmesiz pencerede ba\u011flant\u0131lar\u0131 a\u00e7ma
config.launchbuttonless.help.content=Bu se\u00e7ene\u011fi i\u015faretlerseniz, portlet taraf\u0131ndan g\u00f6r\u00fcnt\u00fclenen g\u00f6r\u00fcn\u00fcm dosyas\u0131 i\u00e7eri\u011findeki t\u00fcm k\u00f6pr\u00fcler, d\u00fc\u011fmelerin olmad\u0131\u011f\u0131 yeni bir alt pencerede a\u00e7\u0131l\u0131r.  Bu se\u00e7ene\u011fi i\u015faretlemezseniz, ge\u00e7erli pencerede a\u00e7\u0131l\u0131r.  L\u00fctfen daha fazla bilgi i\u00e7in y\u00f6netim belgesine ba\u015fvurun.
config.okbutton=Kaydet
info.saved=De\u011fi\u015fiklikleriniz kaydedildi.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Hata: {0})
error.message=Hata:
error.internal=\u0130stedi\u011finiz hizmet veya bilgiler \u015fu anda kullan\u0131lam\u0131yor. L\u00fctfen daha sonra yeniden deneyin.
error.nullFile=\u0130stedi\u011finiz hizmet veya bilgiler \u015fu anda kullan\u0131lam\u0131yor.  L\u00fctfen daha sonra yeniden deneyin.
error.nullFilename=G\u00f6r\u00fcn\u00fcm dosyas\u0131 ad\u0131 bo\u015f olamaz.  L\u00fctfen a\u015fa\u011f\u0131da d\u00fczeltin.
error.pathInFilename=G\u00f6r\u00fcn\u00fcm dosyas\u0131 ad\u0131, \u00fcst dizin yolu (\u00f6rn. <code>..</code> ba\u015fvurusu) i\u00e7eremez.  L\u00fctfen a\u015fa\u011f\u0131da d\u00fczeltin.
#
warn.message=Uyar\u0131:
warn.nullFile=A\u015fa\u011f\u0131daki ada sahip g\u00f6r\u00fcn\u00fcm dosyas\u0131 bulunamad\u0131.  Olu\u015fturup y\u00fcklediniz mi?
warn.nullSubsFile=A\u015fa\u011f\u0131daki ada sahip belirte\u00e7 de\u011fi\u015fimleri dosyas\u0131 bulunamad\u0131.  Olu\u015fturup y\u00fcklediniz mi?
