# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Ficheiro de visualiza\u00e7\u00e3o:
config.viewfilename.help.title=Configurar um ficheiro de visualiza\u00e7\u00e3o
config.viewfilename.help.content=<p>Introduza o nome base (incluindo a extens\u00e3o) do ficheiro de visualiza\u00e7\u00e3o.  Por exemplo, <code>myViewFile.html</code>.</p><p>Este ficheiro cont\u00e9m o conte\u00fado que pretende que o portlet apresente e tem de existir.  Este ficheiro deve existir em cada servidor de portlet neste cluster, na pasta <code>html</code> do conjunto de recursos do portlet ou uma sub-pasta.  (Em alternativa, o ficheiro pode existir na pasta <code>html</code> ou sub-pasta no interior do pr\u00f3prio portlet WAR.)  Se utilizar uma sub-pasta, o nome do ficheiro de visualiza\u00e7\u00e3o inclui o caminho dessa sub-pasta.  Por exemplo, <code>myFiles/myViewFile.html</code>.</p><p>O conte\u00fado do ficheiro deve estar localizado para o local base.  Se traduziu o conte\u00fado, os ficheiros de visualiza\u00e7\u00e3o traduzidos devem acompanhar o ficheiro de visualiza\u00e7\u00e3o base na mesma localiza\u00e7\u00e3o, e serem identificados com o local respectivamente.</p><p>Consulte o documento de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.</p>
config.subsfilename=<contextual_help>Ficheiro de substitui\u00e7\u00f5es de token</contextual_help> (opcional):
config.subsfilename.help.title=Configurar um ficheiro de substitui\u00e7\u00f5es de token
config.subsfilename.help.content=<p>A menos que o ficheiro de visualiza\u00e7\u00e3o utilize o token <code>{INCLUDE:<i>key</i>}</code>, pode deixar em branco.</p><p>Se o ficheiro de visualiza\u00e7\u00e3o n\u00e3o utilizar esse token, introduza o nome do ficheiro de substitui\u00e7\u00f5es de token aqui. Por exemplo, <code>myViewFileIncludes.properties</code>.</p><p>Este ficheiro cont\u00e9m os pares do valor-chave que pretende que o portlet introduza ao devolver os tokens <code>{INCLUDE:<i>key</i>}</code> no ficheiro de visualiza\u00e7\u00e3o.  Se n\u00e3o introduzir um nome de ficheiro, um ficheiro denominado <code>html_viewer_includes.properties</code> \u00e9 assumido.</p><p>O ficheiro deve existir em cada servidor de portlet neste cluster, numa pasta no caminho de classe - por exemplo, a pasta "recursos globais". (Em alternativa, o ficheiro pode existir no interior do portlet WAR na pasta <code>/WEB-INF/classes</code>.) Se utilizar uma sub-pasta, o nome do ficheiro de sunstitui\u00e7\u00f5es de token deve come\u00e7ar com esse caminho de sub-pasta.</p><p>Consulte a documenta\u00e7\u00e3o de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.</p>
config.launchbuttonless=Abrir as hiperliga\u00e7\u00f5es em <contextual_help>nova janela sem bot\u00f5es</contextual_help>?
config.launchbuttonless.help.title=Abrir hiperliga\u00e7\u00f5es numa nova janela sem bot\u00f5es
config.launchbuttonless.help.content=Se seleccionar esta op\u00e7\u00e3o, quaisquer hiperliga\u00e7\u00f5es no conte\u00fado do ficheiro de visualiza\u00e7\u00e3o apresentado pelo portlet ser\u00e3o abertas numa nova janela secund\u00e1ria sem bot\u00f5es.  Se n\u00e3o seleccionar esta op\u00e7\u00e3o, ser\u00e3o abertas na janela actual.  Consulte o documento de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.
config.okbutton=Guardar
info.saved=As altera\u00e7\u00f5es foram guardadas.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Erro: {0})
error.message=Erro:
error.internal=O servi\u00e7o ou informa\u00e7\u00e3o solicitado n\u00e3o est\u00e1 dispon\u00edvel neste momento. Tente novamente mais tarde.
error.nullFile=O servi\u00e7o ou informa\u00e7\u00e3o solicitado n\u00e3o est\u00e1 dispon\u00edvel neste momento.  Tente novamente mais tarde.
error.nullFilename=O nome do ficheiro de visualiza\u00e7\u00e3o n\u00e3o pode ser em branco.  Corrija-o abaixo.
error.pathInFilename=O nome do ficheiro de visualiza\u00e7\u00e3o n\u00e3o pode ter qualquer caminho do direct\u00f3rio principal (por ex., refer\u00eancia <code>..</code>).  Corrija-o abaixo.
#
warn.message=Aviso:
warn.nullFile=N\u00e3o \u00e9 poss\u00edvel localizar o nome do ficheiro de visualiza\u00e7\u00e3o.  J\u00e1 o criou e instalou?
warn.nullSubsFile=N\u00e3o \u00e9 poss\u00edvel localizar o ficheiro de substitui\u00e7\u00f5es de token denominado abaixo.  J\u00e1 o criou e instalou?
