# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Soubor zobrazen\u00ed:
config.viewfilename.help.title=Konfigurace souboru zobrazen\u00ed
config.viewfilename.help.content=<p>Zadejte z\u00e1kladn\u00ed n\u00e1zev (v\u010detn\u011b p\u0159\u00edpony) souboru zobrazen\u00ed.  Nap\u0159. <code>myViewFile.html</code>.</p><p>V tomto souboru jsou obsa\u017eeny \u00fadaje, kter\u00e9 chcete zobrazit pomoc\u00ed portletu. Soubor mus\u00ed existovat.  Tento soubor by m\u011bl existovat na ka\u017ed\u00e9m portletov\u00e9m serveru v tomto clusteru, ve slo\u017ece s bal\u00ed\u010dkem zdroj\u016f portletu nebo jej\u00ed podslo\u017ece.  (Soubor m\u016f\u017ee tak\u00e9 existovat v ko\u0159enov\u00e9 slo\u017ece nebo v jej\u00ed podslo\u017ece uvnit\u0159 samotn\u00e9ho souboru WAR portletu.)  Pokud pou\u017e\u00edv\u00e1te podslo\u017eku, n\u00e1zev souboru zobrazen\u00ed by m\u011bl obsahovat cestu k dan\u00e9 podslo\u017ece.  Nap\u0159. <code>myFiles/myViewFile.html</code>.</p><p>Obsah souboru by m\u011bl b\u00fdt lokalizov\u00e1n pro z\u00e1kladn\u00ed jazykovou variantu.  Pokud jste p\u0159elo\u017eili obsah, m\u011bli by b\u00fdt p\u0159elo\u017een\u00e9 soubory zobrazen\u00ed ulo\u017eeny v\u00a0m\u00edst\u011b ulo\u017een\u00ed z\u00e1kladn\u00edho souboru zobrazen\u00ed. Je t\u0159eba pou\u017e\u00edt zna\u010dky locale.</p><p>Dal\u0161\u00ed informace naleznete v\u00a0dokumentu spr\u00e1vy.</p>
config.subsfilename=Voliteln\u00e9 <contextual_help>soubory k inkluzi</contextual_help>:
config.subsfilename.help.title=Konfigurace soubor\u016f k inkluzi
config.subsfilename.help.content=<p>Jestli\u017ee v souboru zobrazen\u00ed nen\u00ed pou\u017eita zna\u010dka <code>{INCLUDE:<i>key</i>}</code>, m\u016f\u017eete tuto mo\u017enost ponechat pr\u00e1zdnou.</p><p>Pokud soubor zobrazen\u00ed tuto zna\u010dku obsahuje, zadejte zde n\u00e1zev souboru k inkluzi. Nap\u0159. <code>myViewFileIncludes.properties</code>.</p><p>Tento soubor obsahuje p\u00e1ry kl\u00ed\u010de a hodnoty, kter\u00e9 m\u00e1 portlet vkl\u00e1dat p\u0159i vytv\u00e1\u0159en\u00ed zna\u010dek <code>{INCLUDE:<i>key</i>}</code> v souboru zobrazen\u00ed.  Pokud nezad\u00e1te n\u00e1zev souboru, bude pou\u017eit soubor s n\u00e1zvem <code>html_viewer_includes.properties</code>.</p><p>Tento soubor mus\u00ed existovat na ka\u017ed\u00e9m portletov\u00e9m serveru tohoto clusteru ve slo\u017ece v cest\u011b dan\u00e9 t\u0159\u00eddy (nap\u0159. ve slo\u017ece "global resources"), ve slo\u017ece s bal\u00ed\u010dkem zdroj\u016f portletu nebo uvnit\u0159 samotn\u00e9ho souboru WAR portletu. Pou\u017eijete-li podslo\u017eku, mus\u00ed n\u00e1zev souboru k inkluzi za\u010d\u00ednat cestou p\u0159\u00edslu\u0161n\u00e9 podslo\u017eky.</p><p>Dal\u0161\u00ed informace naleznete v dokumentaci spr\u00e1vy.</p>
config.launchbuttonless=Chcete otev\u0159\u00edt odkazy v\u00a0<contextual_help>nov\u00e9m okn\u011b bez tla\u010d\u00edtek</contextual_help>?
config.launchbuttonless.help.title=Otev\u0159\u00edt odkazy v\u00a0nov\u00e9m okn\u011b bez tla\u010d\u00edtek
config.launchbuttonless.help.content=Pokud za\u0161krtnete tuto mo\u017enost, otev\u0159ou se v\u0161echny hypertextov\u00e9 odkazy v souboru zobrazen\u00ed zobrazen\u00e9ho portletem v\u00a0nov\u00e9m dce\u0159in\u00e9m okn\u011b bez tla\u010d\u00edtek.  Pokud tuto mo\u017enost neza\u0161krtnete, otev\u0159ou se p\u0159\u00edslu\u0161n\u00e9 odkazy v\u00a0aktu\u00e1ln\u00edm okn\u011b.  Dal\u0161\u00ed informace naleznete v\u00a0dokumentu spr\u00e1vy.
config.checkseconds.text1=<contextual_help>Doba ulo\u017een\u00ed v mezipam\u011bti:</contextual_help>
config.checkseconds.text2=sekund
config.checkseconds.help.title=Konfigurace doby ulo\u017een\u00ed v mezipam\u011bti
config.checkseconds.help.content=<p>Pomoc\u00ed t\u00e9to mo\u017enosti m\u016f\u017eete ur\u010dit, zda portlet ulo\u017e\u00ed v\u00fd\u0161e uveden\u00e1 data do mezipam\u011bti a po jak dlouhou dobu. Obsah mezipam\u011bti bude zahrnovat vedle mo\u017enost\u00ed konfigurace zm\u00edn\u011bn\u00fdch v\u00fd\u0161e i obsah v\u00fd\u0161e uveden\u00fdch soubor\u016f zobrazen\u00ed a soubor\u016f k inkluzi. M\u016f\u017ee se tak zv\u00fd\u0161it v\u00fdkon portletu p\u0159i jeho vysok\u00e9m zat\u00ed\u017eeni.</p><p>Pokud chcete umo\u017enit ukl\u00e1d\u00e1n\u00ed do mezipam\u011bti po ur\u010ditou dobu, zadejte tento \u010das v sekund\u00e1ch (nap\u0159. v p\u0159\u00edpad\u011b 15 minut zadejte hodnotu <code>900</code>). Chceteli nastavit trval\u00e9 ukl\u00e1d\u00e1n\u00ed do mezipam\u011bti, zadejte hodnotu <code>-1</code>. Pokud chcete mo\u017enost ukl\u00e1d\u00e1n\u00ed do mezipam\u011bti zak\u00e1zat, zadejte hodnotu <code>0</code> nebo ponechte toto nastaven\u00ed nevypln\u011bn\u00e9.</p><p>Ka\u017ed\u00fdm klepnut\u00edm na tla\u010d\u00edtko <b>Save</b> (Ulo\u017eit) na t\u00e9to str\u00e1nce bude st\u00e1vaj\u00edc\u00ed mezipam\u011b\u0165 vymaz\u00e1na. Zde ulo\u017een\u00e9 zm\u011bny tak budou platn\u00e9 okam\u017eit\u011b. K vymaz\u00e1n\u00ed mezipam\u011bti dojde tak\u00e9 p\u0159i restartov\u00e1n\u00ed portletu.</p>
config.okbutton=Ulo\u017een\u00ed
info.saved=Zm\u011bny byly ulo\u017eeny.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Chyba: {0})
error.message=Chyba:
error.input=U zadan\u00fdch dat do\u0161lo k probl\u00e9mu.
error.internal=Slu\u017eba nebo informace, o kterou jste za\u017e\u00e1dali, nen\u00ed v sou\u010dasn\u00e9 dob\u011b dostupn\u00e1. Opakujte akci pozd\u011bji.
error.nullFile=Slu\u017eba nebo informace, o kterou jste za\u017e\u00e1dali, nen\u00ed v sou\u010dasn\u00e9 dob\u011b dostupn\u00e1.  Opakujte akci pozd\u011bji.
error.nullFilename=N\u00e1zev souboru zobrazen\u00ed je nutn\u00e9 zadat.  Opravte tuto chybu n\u00ed\u017ee.
error.pathInFilename=N\u00e1zev souboru zobrazen\u00ed nem\u016f\u017ee obsahovat cestu k\u00a0nad\u0159azen\u00e9mu adres\u00e1\u0159i (tj. odkaz <code>..</code>).  Opravte tuto chybu n\u00ed\u017ee.
error.pathInSubsFilename=N\u00e1zev souboru k inkluzi nem\u016f\u017ee obsahovat cestu k\u00a0nad\u0159azen\u00e9mu adres\u00e1\u0159i (tj. odkaz <code>..</code>).  Opravte tuto chybu n\u00ed\u017ee.
error.checkSecondsValue=D\u00e9lka ulo\u017een\u00ed do mezipam\u011bti mus\u00ed b\u00fdt zad\u00e1na v cel\u00fdch \u010d\u00edslech a v sekund\u00e1ch.  Opravte tuto chybu n\u00ed\u017ee.
error.notSaved=Zm\u011bny nebyly ulo\u017eeny.
#
warn.message=Upozorn\u011bn\u00ed:
warn.nullFile=N\u00ed\u017ee uveden\u00fd soubor zobrazen\u00ed nebyl nalezen nebo nelze p\u0159e\u010d\u00edst.  U\u017e jste jej vytvo\u0159ili a nainstalovali?
warn.nullSubsFile=N\u00ed\u017ee uveden\u00fd soubor k inkluzi nebyl nalezen nebo nelze p\u0159e\u010d\u00edst.  U\u017e jste jej vytvo\u0159ili a nainstalovali?
