# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Soubor zobrazen\u00ed:
config.viewfilename.help.title=Konfigurace souboru zobrazen\u00ed
config.viewfilename.help.content=<p>Zadejte z\u00e1kladn\u00ed n\u00e1zev (v\u010detn\u011b p\u0159\u00edpony) souboru zobrazen\u00ed.  Nap\u0159. <code>myViewFile.html</code>.</p><p>V tomto souboru jsou obsa\u017eeny \u00fadaje, kter\u00e9 chcete zobrazit pomoc\u00ed portletu. Soubor mus\u00ed existovat.  Tento soubor by m\u011bl existovat na ka\u017ed\u00e9m portletov\u00e9m serveru v clusteru, ve slo\u017ece <code>html</code> bal\u00ed\u010dku zdroj\u016f portletu nebo jej\u00ed podslo\u017ece.  (Soubor m\u016f\u017ee tak\u00e9 existovat ve slo\u017ece <code>html</code> nebo v jej\u00ed podslo\u017ece uvnit\u0159 samotn\u00e9ho souboru WAR portletu.)  Pokud pou\u017e\u00edv\u00e1te podslo\u017eku, n\u00e1zev souboru zobrazen\u00ed by m\u011bl obsahovat cestu k dan\u00e9 podslo\u017ece.  Nap\u0159. <code>myFiles/myViewFile.html</code>.</p><p>Obsah souboru by m\u011bl b\u00fdt lokalizov\u00e1n pro z\u00e1kladn\u00ed jazykovou variantu.  Pokud jste p\u0159elo\u017eili obsah, m\u011bli by b\u00fdt p\u0159elo\u017een\u00e9 soubory zobrazen\u00ed ulo\u017eeny v\u00a0m\u00edst\u011b ulo\u017een\u00ed z\u00e1kladn\u00edho souboru zobrazen\u00ed. Je t\u0159eba pou\u017e\u00edt zna\u010dky locale.</p><p>Dal\u0161\u00ed informace naleznete v\u00a0dokumentu spr\u00e1vy.</p>
config.subsfilename=<contextual_help>Soubor n\u00e1hradn\u00edch zna\u010dek</contextual_help> (voliteln\u00fd):
config.subsfilename.help.title=Konfigurace souboru n\u00e1hradn\u00edch zna\u010dek
config.subsfilename.help.content=<p>Jestli\u017ee v souboru zobrazen\u00ed nen\u00ed pou\u017eita zna\u010dka <code>{INCLUDE:<i>key</i>}</code>, m\u016f\u017eete tuto mo\u017enost ponechat pr\u00e1zdnou.</p><p>Pokud soubor zobrazen\u00ed tuto zna\u010dku obsahuje, zadejte zde n\u00e1zev p\u0159\u00edslu\u0161n\u00e9ho souboru n\u00e1hradn\u00edch zna\u010dek. Nap\u0159. <code>myViewFileIncludes.properties</code>.</p><p>Tento soubor obsahuje p\u00e1ry kl\u00ed\u010de a hodnoty, kter\u00e9 m\u00e1 portlet vkl\u00e1dat p\u0159i vytv\u00e1\u0159en\u00ed zna\u010dek <code>{INCLUDE:<i>key</i>}</code> v souboru zobrazen\u00ed.  Pokud nezad\u00e1te n\u00e1zev souboru, bude pou\u017eit soubor <code>html_viewer_includes.properties</code>.</p><p>Tento soubor mus\u00ed existovat na ka\u017ed\u00e9m portletov\u00e9m serveru tohoto clusteru ve slo\u017ece v cest\u011b dan\u00e9 t\u0159\u00eddy (nap\u0159. ve slo\u017ece "global resources"). (Soubor se m\u016f\u017ee nach\u00e1zet tak\u00e9 v souboru WAR portletu ve slo\u017ece <code>/WEB-INF/classes</code>.) Pou\u017eijete-li podslo\u017eku, mus\u00ed n\u00e1zev souboru n\u00e1hradn\u00edch zna\u010dek za\u010d\u00ednat cestou p\u0159\u00edslu\u0161n\u00e9 podslo\u017eky.</p><p>Dal\u0161\u00ed informace naleznete v dokumentu spr\u00e1vy.</p>
config.launchbuttonless=Chcete otev\u0159\u00edt odkazy v\u00a0<contextual_help>nov\u00e9m okn\u011b bez tla\u010d\u00edtek</contextual_help>?
config.launchbuttonless.help.title=Otev\u0159\u00edt odkazy v\u00a0nov\u00e9m okn\u011b bez tla\u010d\u00edtek
config.launchbuttonless.help.content=Pokud za\u0161krtnete tuto mo\u017enost, otev\u0159ou se v\u0161echny hypertextov\u00e9 odkazy v souboru zobrazen\u00ed zobrazen\u00e9ho portletem v\u00a0nov\u00e9m dce\u0159in\u00e9m okn\u011b bez tla\u010d\u00edtek.  Pokud tuto mo\u017enost neza\u0161krtnete, otev\u0159ou se p\u0159\u00edslu\u0161n\u00e9 odkazy v\u00a0aktu\u00e1ln\u00edm okn\u011b.  Dal\u0161\u00ed informace naleznete v\u00a0dokumentu spr\u00e1vy.
config.okbutton=Ulo\u017een\u00ed
info.saved=Zm\u011bny byly ulo\u017eeny.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Chyba: {0})
error.message=Chyba:
error.internal=Slu\u017eba nebo informace, o kterou jste za\u017e\u00e1dali, nen\u00ed v sou\u010dasn\u00e9 dob\u011b dostupn\u00e1. Opakujte akci pozd\u011bji.
error.nullFile=Slu\u017eba nebo informace, o kterou jste za\u017e\u00e1dali, nen\u00ed v sou\u010dasn\u00e9 dob\u011b dostupn\u00e1.  Opakujte akci pozd\u011bji.
error.nullFilename=N\u00e1zev souboru zobrazen\u00ed je nutn\u00e9 zadat.  Opravte tuto chybu n\u00ed\u017ee.
error.pathInFilename=N\u00e1zev souboru zobrazen\u00ed nem\u016f\u017ee obsahovat cestu k\u00a0nad\u0159azen\u00e9mu adres\u00e1\u0159i (tj. odkaz <code>..</code>).  Opravte tuto chybu n\u00ed\u017ee.
#
warn.message=Upozorn\u011bn\u00ed:
warn.nullFile=N\u00ed\u017ee uveden\u00fd soubor zobrazen\u00ed nebyl nalezen.  U\u017e jste jej vytvo\u0159ili a nainstalovali?
warn.nullSubsFile=N\u00ed\u017ee uveden\u00fd soubor n\u00e1hradn\u00edch zna\u010dek nebyl nalezen.  U\u017e jste jej vytvo\u0159ili a nainstalovali?
