# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Rodinio failas
config.viewfilename.help.title=Rodinio failo konfig\u016bravimas
config.viewfilename.help.content=<p>\u012eveskite rodinio failo pagrindo pavadinim\u0105 (su pl\u0117tiniu).  Pavyzd\u017eiui, <code>myViewFile.html</code>.</p><p>\u0160iame faile yra turinys, rodytinas portalo elemente, tod\u0117l \u0161is failas reikalingas ir turi b\u016bti.  \u0160is failas turi b\u016bti kiekviename \u0161io klasterio portalo element\u0173 serveryje, portalo element\u0173 i\u0161tekli\u0173 paketo <code>html</code> aplanke arba jo poaplankyje.  (\u0160is failas gali b\u016bti ir <code>html</code> aplanke arba jo poaplankyje paties portalo elemento viduje.)  Jei naudojate poaplank\u012f, su rodinio failu turi b\u016bti nurodytas \u0161io poaplankio mar\u0161rutas.  Pavyzd\u017eiui, <code>myFiles/myViewFile.html</code>.</p><p>Failo turinys turi b\u016bti lokalizuotas pagal pagrindin\u0119 lokal\u0119.  Jeigu i\u0161vert\u0117te turin\u012f, i\u0161versti rodinio failai turi b\u016bti pateikiami toje pa\u010dioje vietoje, kaip ir pagrindinis rodinio failas, be to, turi b\u016bti atitinkamai pa\u017eym\u0117ta j\u0173 lokal\u0117.</p><p>Daugiau informacijos \u017er. administravimo dokumente.</p>
config.subsfilename=<contextual_help>Pakaitini\u0173 \u017eenkl\u0173 failas</contextual_help> (neb\u016btinas)
config.subsfilename.help.title=Pakaitini\u0173 \u017eenkl\u0173 failo konfig\u016bravimas
config.subsfilename.help.content=<p>Jeigu j\u016bs\u0173 rodinio faile nenaudojamas <code>{INCLUDE:<i>key</i>}</code> atpa\u017einties \u017eenklas, \u010dia galite nieko nenurodyti.</p><p>Jeigu j\u016bs\u0173 rodinio faile \u0161is atpa\u017einties \u017eenklas naudojamas, \u010dia \u012fveskite jo pakaitini\u0173 \u017eenkl\u0173 fail\u0105. Pavyzd\u017eiui, <code>myViewFileIncludes.properties</code>.</p><p>\u0160iame faile yra rakto \u2013 reik\u0161m\u0117s poros, kurios turi b\u016bti \u012fterpiamos vietoje j\u016bs\u0173 rodinio failo <code>{INCLUDE:<i>key</i>}</code> atpa\u017einties \u017eenkl\u0173, juos apdorojant portalo elemente.  Ne\u012fra\u0161ius failo pavadinimo, automati\u0161kai naudojamas failas <code>html_viewer_includes.properties</code>.</p><p>Jis turi b\u016bti kiekviename \u0161io klasterio portal\u0173 element\u0173 serveryje, klasi\u0173 apibr\u0117\u017eim\u0173 mar\u0161rute esan\u010diame aplanke, pavyzd\u017eiui \u201eglobali\u0173j\u0173 i\u0161tekli\u0173\u201c aplanke. (\u0160is failas gali b\u016bti ir portalo elemento WAR, aplanke <code>/WEB-INF/classes</code>.) Jei naudojate poaplank\u012f, pakaitini\u0173 \u017eenkl\u0173 failo pavadinimas turi b\u016bti pradedamas \u0161io poaplankio mar\u0161rutu.</p><p>Daugiau informacijos \u017er. administravimo dokumentacijoje.</p>
config.launchbuttonless=Atidaryti saitus <contextual_help>naujame lange be mygtuk\u0173</contextual_help>?
config.launchbuttonless.help.title=Sait\u0173 atidarymas naujame lange be mygtuk\u0173
config.launchbuttonless.help.content=Pa\u017eym\u0117jus \u0161i\u0105 parinkt\u012f, visi portalo elemente rodomo rodinio failo turinio saitai bus atidaromi naujame i\u0161vestiniame lange be mygtuk\u0173.  Nepa\u017eym\u0117jus \u0161ios parinkties saitai atidaromi esamame lange.  Daugiau informacijos \u017er. administravimo dokumente.
config.okbutton=\u012era\u0161yti
info.saved=J\u016bs\u0173 keitimai \u012fra\u0161yti.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Klaida: {0})
error.message=Klaida:
error.internal=J\u016bs\u0173 reikalaujama paslauga arba informacija \u0161iuo metu nepasiekiama. Pra\u0161ome pam\u0117ginti v\u0117liau.
error.nullFile=J\u016bs\u0173 reikalaujama paslauga arba informacija \u0161iuo metu nepasiekiama.  Pra\u0161ome pam\u0117ginti v\u0117liau.
error.nullFilename=Rodinio failo pavadinimas negali b\u016bti tu\u0161\u010dias.  Pataisykite j\u012f \u017eemiau.
error.pathInFilename=Rodinio failo pavadinime negali b\u016bti jokio vir\u0161esnio katalogo mar\u0161ruto (t. y. nuorodos <code>..</code>).  Pataisykite j\u012f \u017eemiau.
#
warn.message=Persp\u0117jimas:
warn.nullFile=Nerastas \u017eemiau nurodytas rodinio failas.  Ar jis sukurtas ir \u012fdiegtas?
warn.nullSubsFile=Nerastas \u017eemiau nurodytas pakaitini\u0173 \u017eenkl\u0173 failas.  Ar jis sukurtas ir \u012fdiegtas?
