# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Plik wy\u015bwietlania:
config.viewfilename.help.title=Konfigurowanie pliku wy\u015bwietlania
config.viewfilename.help.content=<p>Wprowad\u017a nazw\u0119 podstawow\u0105 (wraz z rozszerzeniem) pliku wy\u015bwietlania.  Na przyk\u0142ad <code>M\u00f3jPlikWy\u015bwietlania.html</code>.</p><p>Ten plik zawiera okre\u015blone przez u\u017cytkownika informacje o zawarto\u015bci wy\u015bwietlanej przez portlet i jest niezb\u0119dny.  Ten plik powinien istnie\u0107 na ka\u017cdym serwerze portletu w tym klastrze, w folderze <code>html</code> pakietu zasob\u00f3w portletu lub w jego podfolderze.  (Ewentualnie plik ten mo\u017ce zosta\u0107 umieszczony w folderze lub podfolderze <code>html</code> wewn\u0105trz samego portletu WAR). W przypadku zastosowania podfolderu nazwa pliku wy\u015bwietlania powinna zawiera\u0107 \u015bcie\u017ck\u0119 do tego podfolderu.  Na przyk\u0142ad <code>MojePliki/M\u00f3jPlikWy\u015bwietlania.html</code>.</p><p>Zawarto\u015b\u0107 pliku powinna uwzgl\u0119dnia\u0107 podstawow\u0105 lokalizacj\u0119.  Je\u015bli zawarto\u015b\u0107 zostanie przet\u0142umaczona, przet\u0142umaczone pliki wy\u015bwietlania powinny znajdowa\u0107 si\u0119 obok podstawowych plik\u00f3w wy\u015bwietlania, w tej samej lokalizacji oraz powinny zawiera\u0107 odpowiednie informacje dotycz\u0105ce lokalizacji.</p><p>Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.</p>
config.subsfilename=<contextual_help>Plik token\u00f3w zamiennych</contextual_help> (opcjonalny):
config.subsfilename.help.title=Konfigurowanie pliku token\u00f3w zamiennych
config.subsfilename.help.content=<p>Je\u017celi plik wy\u015bwietlania nie korzysta z tokenu <code>{INCLUDE:<i>key</i>}</code>, plik ten mo\u017ce pozosta\u0107 pusty.</p><p>Je\u015bli jednak plik wy\u015bwietlania korzysta z tego tokenu, nale\u017cy wprowadzi\u0107 nazw\u0119 pliku token\u00f3w zamiennych. Na przyk\u0142ad plik <code>m\u00f3jPlikWy\u015bwietlaniaZawiera.w\u0142a\u015bciwo\u015bci</code>.</p><p>Taki plik zawiera informacje o parach klucz-warto\u015b\u0107 wstawianych przez portlet w trakcie renderowania token\u00f3w <code>{INCLUDE:<i>key</i>}</code> w pliku wy\u015bwietlania.  Je\u017celi nie podano nazwy pliku, plik przyjmuje nazw\u0119 <code>przegl\u0105darka_html_zawiera.w\u0142a\u015bciwo\u015bci</code>.</p><p>Ten plik powinien istnie\u0107 na ka\u017cdym serwerze portletu w tym klastrze, w folderze na \u015bcie\u017cce klas, na przyk\u0142ad w folderze \u201ezasoby globalne\u201d. (Ewentualnie plik ten mo\u017ce zosta\u0107 umieszczony wewn\u0105trz portletu WAR w folderze <code>/WEB-INF/klasy</code>). W przypadku zastosowania podfolderu nazwa pliku token\u00f3w zamiennych powinna rozpoczyna\u0107 si\u0119 od \u015bcie\u017cki tego podfolderu.</p><p>Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.</p>
config.launchbuttonless=Otwieraj \u0142\u0105cza w <contextual_help>nowym oknie dialogowym</contextual_help>?
config.launchbuttonless.help.title=Otwieraj \u0142\u0105cza w nowym oknie dialogowym
config.launchbuttonless.help.content=Po zaznaczeniu tej opcji wszelkie hiper\u0142\u0105cza zawarte w pliku wy\u015bwietlania zostan\u0105 przez portlet wy\u015bwietlone w nowym oknie dialogowym.  Je\u015bli ta opcja nie zostanie zaznaczona, hiper\u0142\u0105cza b\u0119d\u0105 wy\u015bwietlane w bie\u017c\u0105cym oknie.  Wi\u0119cej informacji znajduje si\u0119 w dokumentacji dla administrator\u00f3w.
config.okbutton=Zapisz
info.saved=Zmiany zosta\u0142y zapisane.

# messages for view mode 
# (none)

# messages for error handling
error.code=(B\u0142\u0105d: {0})
error.message=B\u0142\u0105d:
error.internal=\u017b\u0105dana us\u0142uga lub informacja nie jest w tej chwili dost\u0119pna. Spr\u00f3buj ponownie w p\u00f3\u017aniejszym czasie.
error.nullFile=\u017b\u0105dana us\u0142uga lub informacja nie jest w tej chwili dost\u0119pna.  Spr\u00f3buj ponownie w p\u00f3\u017aniejszym czasie.
error.nullFilename=Nazwa pliku wy\u015bwietlania nie mo\u017ce by\u0107 pusta.  Wprowad\u017a zmiany poni\u017cej.
error.pathInFilename=Nazwa pliku wy\u015bwietlania nie mo\u017ce zawiera\u0107 \u015bcie\u017cki katalogu nadrz\u0119dnego (np. odno\u015bnika <code>..</code>).  Wprowad\u017a zmiany poni\u017cej.
#
warn.message=Uwaga:
warn.nullFile=Nie mo\u017cna odnale\u017a\u0107 pliku wy\u015bwietlania okre\u015blonego poni\u017cej.  Czy plik zosta\u0142 ju\u017c utworzony i zainstalowany?
warn.nullSubsFile=Nie mo\u017cna odnale\u017a\u0107 pliku token\u00f3w zamiennych okre\u015blonego poni\u017cej.  Czy plik zosta\u0142 ju\u017c utworzony i zainstalowany?
