# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u8996\u5716\u6a94\u6848\uff1a
config.viewfilename.help.title=\u914d\u7f6e\u8996\u5716\u6a94\u6848
config.viewfilename.help.content=<p>\u8acb\u8f38\u5165\u8996\u5716\u6a94\u6848\u7684\u57fa\u672c\u540d\uff08\u5305\u62ec\u64f4\u5c55\u540d\uff09\u3002  \u4f8b\u5982\uff0c<code>myViewFile.html</code>\u3002</p><p>\u8a72\u6a94\u6848\u542b Portlet \u9700\u986f\u793a\u7684\u5167\u5bb9\uff0c\u4e14\u8a72\u6a94\u6848\u5fc5\u9808\u5b58\u5728\u3002  \u8a72\u6a94\u6848\u61c9\u5b58\u5728\u65bc\u8a72\u53e2\u96c6\u4e2d\u7684\u6bcf\u500b Portlet \u4f3a\u670d\u5668\uff0c\u6216\u5728 Portlet \u8cc7\u6e90\u5305 <code>html</code> \u6587\u4ef6\u593e\u6216\u5176\u5b50\u6587\u4ef6\u593e\u4e2d\u3002  \uff08\u6216\u8005\uff0c\u8a72\u6a94\u6848\u53ef\u4ee5\u5b58\u5728\u65bc Portlet WAR \u81ea\u8eab\u4e2d\u7684 <code>html</code> \u6587\u4ef6\u593e\u6216\u5176\u5b50\u6587\u4ef6\u593e\u3002\uff09  \u82e5\u60a8\u4f7f\u7528\u5b50\u6587\u4ef6\u593e\uff0c\u8996\u5716\u6a94\u6848\u540d\u7a31\u61c9\u5305\u62ec\u5b50\u6587\u4ef6\u593e\u8def\u5f91\u3002  \u4f8b\u5982\uff0c<code>myFiles/myViewFile.html</code>\u3002</p><p>\u6a94\u6848\u5167\u5bb9\u61c9\u6309\u7576\u5730\u5340\u57df\u8a9e\u8a00\u9032\u884c\u672c\u571f\u5316\u3002  \u82e5\u60a8\u5df2\u7ffb\u8b6f\u5167\u5bb9\uff0c\u7d93\u904e\u7ffb\u8b6f\u7684\u8996\u5716\u6a94\u6848\u61c9\u5728\u76f8\u540c\u4f4d\u7f6e\u914d\u4ee5\u57fa\u672c\u8996\u5716\u6a94\u6848\uff0c\u4e26\u6309\u4f4d\u7f6e\u52a0\u4e0a\u6a19\u7c3d\u3002</p><p>\u6b32\u4e86\u89e3\u8a73\u7d30\u8cc7\u8a0a\uff0c\u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u3002</p>
config.subsfilename=<contextual_help>\u6b0a\u6a19\u7f6e\u63db\u6a94\u6848</contextual_help>\uff08\u53ef\u9078\uff09\uff1a
config.subsfilename.help.title=\u914d\u7f6e\u6b0a\u6a19\u7f6e\u63db\u6a94\u6848
config.subsfilename.help.content=<p>\u9664\u975e\u8996\u5716\u6a94\u6848\u4f7f\u7528 <code>{INCLUDE:<i>key</i>}</code> \u6b0a\u6a19\uff0c\u6b64\u8655\u53ef\u4fdd\u7559\u7a7a\u767d\u3002</p><p>\u82e5\u8996\u5716\u6a94\u6848\u672a\u4f7f\u7528\u6b64\u6b0a\u6a19\uff0c\u5247\u8acb\u65bc\u6b64\u8655\u8f38\u5165\u6b0a\u6a19\u7f6e\u63db\u6a94\u6848\u7684\u540d\u7a31\u3002 \u4f8b\u5982\uff0c<code>myViewFileIncludes.properties</code>\u3002</p><p>\u6b64\u6a94\u6848\u542b\u8996\u5716\u6a94\u6848\u4e2d\u751f\u6210 <code>{INCLUDE:<i>key</i>}</code> \u6b0a\u6a19\u6642 portlet \u9700\u63d2\u5165\u7684\u95dc\u9375\u503c\u5c0d\u3002  \u82e5\u60a8\u672a\u8f38\u5165\u6a94\u6848\u540d\u7a31\uff0c\u7cfb\u7d71\u5c07\u4f7f\u7528\u547d\u540d\u70ba <code>html_viewer_includes.properties</code> \u7684\u6a94\u6848\u3002</p><p>\u6a94\u6848\u61c9\u5b58\u5728\u65bc\u8a72\u53e2\u96c6\u4e2d\u7684\u6bcf\u500b portlet \u4f3a\u670d\u5668\uff0c\u53ca\u985e\u9014\u5f91\u4e0a\u7684\u6587\u4ef6\u593e\u4e2d \u2014 \u4f8b\u5982\uff0c\u60a8\u7684\u300c\u5168\u7403\u8cc7\u6e90\u300d\u6587\u4ef6\u593e\u3002 \uff08\u6216\u8005\uff0c\u6a94\u6848\u53ef\u4ee5\u5b58\u5728\u65bc <code>/WEB-INF/classes</code> \u6587\u4ef6\u593e\u4e2d\u7684 portlet WAR \u4e4b\u5167\u3002\uff09 \u82e5\u60a8\u4f7f\u7528\u5b50\u6587\u4ef6\u593e\uff0c\u6b0a\u6a19\u7f6e\u63db\u6a94\u6848\u540d\u7a31\u61c9\u4ee5\u5b50\u6587\u4ef6\u593e\u9014\u5f91\u70ba\u958b\u982d\u3002</p><p>\u8a73\u7d30\u8cc7\u8a0a\u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u3002</p>
config.launchbuttonless=\u662f\u5426\u6253\u958b<contextual_help>\u65b0\u7684\u7121\u6309\u9215\u8996\u7a97</contextual_help>\u4e2d\u7684\u93c8\u63a5\uff1f
config.launchbuttonless.help.title=\u6253\u958b\u65b0\u7684\u7121\u6309\u9215\u8996\u7a97\u4e2d\u7684\u93c8\u63a5
config.launchbuttonless.help.content=\u82e5\u60a8\u9078\u4e2d\u8a72\u9078\u9805\uff0c\u5c07\u5728\u65b0\u7684\u7121\u6309\u9215\u5b50\u8996\u7a97\u4e2d\u6253\u958b Portlet \u986f\u793a\u7684\u8996\u5716\u6a94\u6848\u5167\u5bb9\u4e2d\u7684\u4efb\u4f55\u8d85\u93c8\u63a5\u3002  \u82e5\u60a8\u672a\u9078\u4e2d\u8a72\u9078\u9805\uff0c\u5b83\u5011\u5c07\u5728\u7576\u524d\u8996\u7a97\u4e2d\u6253\u958b\u3002  \u6b32\u4e86\u89e3\u8a73\u7d30\u8cc7\u8a0a\uff0c\u8acb\u53c3\u95b1\u7ba1\u7406\u6587\u4ef6\u3002
config.okbutton=Save\uff08\u4fdd\u5b58\uff09
info.saved=\u60a8\u6240\u4f5c\u7684\u66f4\u6539\u5df2\u4fdd\u5b58\u3002

# messages for view mode 
# (none)

# messages for error handling
error.code=\uff08\u932f\u8aa4\uff1a {0})
error.message=\u6253\u5370\u6a5f\u63a7\u5236\u53f0\u4e0a\u986f\u793a\u300c\u932f\u8aa4\uff1a
error.internal=\u60a8\u6240\u8981\u6c42\u7684\u670d\u52d9\u6216\u8cc7\u8a0a\u76ee\u524d\u4e0d\u53ef\u7528\u3002 \u8acb\u7a0d\u5f8c\u91cd\u8a66\u3002
error.nullFile=\u60a8\u6240\u8981\u6c42\u7684\u670d\u52d9\u6216\u8cc7\u8a0a\u76ee\u524d\u4e0d\u53ef\u7528\u3002  \u8acb\u7a0d\u5f8c\u91cd\u8a66\u3002
error.nullFilename=\u8996\u5716\u6a94\u6848\u540d\u7a31\u4e0d\u5f97\u70ba\u7a7a\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u66f4\u6539\u3002
error.pathInFilename=\u8996\u5716\u6a94\u6848\u4e0d\u5f97\u542b\u4efb\u4f55\u7236\u76ee\u9304\u8def\u5f91\uff08\u5373\uff0c<code>..</code> \u7d22\u5f15\uff09\u3002  \u8acb\u65bc\u4e0b\u65b9\u9032\u884c\u66f4\u6539\u3002
#
warn.message=\u63d0\u793a\uff1a
warn.nullFile=\u672a\u80fd\u627e\u5230\u4e0b\u8ff0\u540d\u7a31\u7684\u8996\u5716\u6a94\u6848\u3002  \u60a8\u662f\u5426\u5df2\u5efa\u7acb\u4e26\u5b89\u88dd\u8a72\u6a94\u6848\uff1f
warn.nullSubsFile=\u672a\u80fd\u627e\u5230\u4e0b\u8ff0\u540d\u7a31\u7684\u6b0a\u6a19\u7f6e\u63db\u6a94\u6848\u3002  \u60a8\u662f\u5426\u5df2\u5efa\u7acb\u4e26\u5b89\u88dd\u8a72\u6a94\u6848\uff1f
