# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=\u0420\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b:
config.viewfilename.help.title=\u041a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u0430\u043d\u0435 \u043d\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b
config.viewfilename.help.content=<p>\u0412\u044a\u0432\u0435\u0434\u0435\u0442\u0435 \u0431\u0430\u0437\u043e\u0432\u043e\u0442\u043e \u0438\u043c\u0435 (\u0432\u043a\u043b\u044e\u0447\u0438\u0442\u0435\u043b\u043d\u043e \u0440\u0430\u0437\u0448\u0438\u0440\u0435\u043d\u0438\u0435\u0442\u043e) \u043d\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0438\u044f \u0444\u0430\u0439\u043b.  \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, <code>myViewFile.html</code>.</p><p>\u0422\u043e\u0437\u0438 \u0444\u0430\u0439\u043b \u0432\u043a\u043b\u044e\u0447\u0432\u0430 \u0441\u044a\u0434\u044a\u0440\u0436\u0430\u043d\u0438\u0435\u0442\u043e, \u043a\u043e\u0435\u0442\u043e \u0438\u0441\u043a\u0430\u0442\u0435 \u0434\u0430 \u043f\u043e\u043a\u0430\u0436\u0435 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u044a\u0442 \u0438 \u0442\u043e \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0441\u044a\u0449\u0435\u0441\u0442\u0432\u0443\u0432\u0430.  \u0422\u043e\u0437\u0438 \u0444\u0430\u0439\u043b \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0441\u044a\u0449\u0435\u0441\u0442\u0432\u0443\u0432\u0430 \u043d\u0430 \u0432\u0441\u0435\u043a\u0438 \u0441\u044a\u0440\u0432\u044a\u0440 \u043d\u0430 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u0438 \u0432 \u0442\u043e\u0437\u0438 \u043a\u043b\u044a\u0441\u0442\u0435\u0440, \u0432 \u043f\u0430\u043f\u043a\u0430\u0442\u0430 \u043d\u0430 \u043f\u0430\u043a\u0435\u0442\u0430 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u043d\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0438 \u0438\u043b\u0438 \u0432 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430 \u043d\u0430 \u0441\u044a\u0449\u0430\u0442\u0430.  (\u0410\u043b\u0442\u0435\u0440\u043d\u0430\u0442\u0438\u0432\u043d\u043e, \u0444\u0430\u0439\u043b\u044a\u0442 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u044a\u0449\u0435\u0441\u0442\u0432\u0443\u0432\u0430 \u0432 \u0433\u043b\u0430\u0432\u043d\u0430\u0442\u0430 \u043f\u0430\u043f\u043a\u0430 \u0438\u043b\u0438 \u0432 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430 \u043d\u0430 \u0441\u044a\u0449\u0430\u0442\u0430 \u0432 \u0441\u0430\u043c\u0438\u044f \u043f\u043e\u0440\u0442\u043b\u0435\u0442 WAR.)  \u0410\u043a\u043e \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430\u0442\u0435 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430, \u0438\u043c\u0435\u0442\u043e \u043d\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0438\u044f \u0444\u0430\u0439\u043b \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0432\u043a\u043b\u044e\u0447\u0432\u0430 \u043f\u044a\u0442\u044f \u043d\u0430 \u0442\u0430\u0437\u0438 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430.  \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, <code>myFiles/myViewFile.html</code>.</p><p>\u0421\u044a\u0434\u044a\u0440\u0436\u0430\u043d\u0438\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0431\u044a\u0434\u0435 \u0443\u0441\u0442\u0430\u043d\u043e\u0432\u0435\u043d\u043e \u0437\u0430 \u043b\u043e\u043a\u0430\u043b\u043d\u0430\u0442\u0430 \u0431\u0430\u0437\u0430.  \u0410\u043a\u043e \u0438\u043c\u0430\u0442\u0435 \u043f\u0440\u0435\u0432\u0435\u0434\u0435\u043d\u043e \u0441\u044a\u0434\u044a\u0440\u0436\u0430\u043d\u0438\u0435, \u043f\u0440\u0435\u0432\u0435\u0434\u0435\u043d\u0438\u0442\u0435 \u0444\u0430\u0439\u043b\u043e\u0432\u0435 \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0441\u044a\u043f\u044a\u0442\u0441\u0442\u0432\u0430\u0442 \u043e\u0441\u043d\u043e\u0432\u043d\u0438\u044f \u0444\u0430\u0439\u043b \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0430 \u0441\u044a\u0449\u043e\u0442\u043e \u043c\u044f\u0441\u0442\u043e \u0438 \u0434\u0430 \u0431\u044a\u0434\u0430\u0442 \u0441\u044a\u043e\u0442\u0432\u0435\u0442\u043d\u043e \u043c\u0430\u0440\u043a\u0438\u0440\u0430\u043d\u0438 \u0441 \u043b\u043e\u043a\u0430\u043b\u043d\u043e.</p><p>\u041c\u043e\u043b\u044f \u043e\u0431\u044a\u0440\u043d\u0435\u0442\u0435 \u0441\u0435 \u0437\u0430 \u043f\u043e\u0432\u0435\u0447\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043a\u044a\u043c \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430 \u0437\u0430 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0438\u0440\u0430\u043d\u0435.</p>
config.subsfilename=\u0414\u043e\u043f\u044a\u043b\u043d\u0438\u0442\u0435\u043b\u043d\u043e <contextual_help>\u0432\u043a\u043b\u044e\u0447\u0432\u0430 \u0444\u0430\u0439\u043b</contextual_help>:
config.subsfilename.help.title=\u041a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u0430\u043d\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0441\u044a\u0441 \u0437\u0430\u043c\u0435\u0441\u0442\u0432\u0430\u043d\u0438\u044f
config.subsfilename.help.content=<p>\u0410\u043a\u043e \u0432\u0430\u0448\u0435\u0442\u043e \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b \u043d\u0435 \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430 \u0441\u0438\u043c\u0432\u043e\u043b\u0430 <code>{INCLUDE:<i>key</i>}</code> , \u043c\u043e\u0436\u0435\u0442\u0435 \u0434\u0430 \u0433\u043e \u043e\u0441\u0442\u0430\u0432\u0438\u0442\u0435 \u043f\u0440\u0430\u0437\u043d\u043e.</p><p>\u0410\u043a\u043e \u0432\u0430\u0448\u0435\u0442\u043e \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430 \u0442\u043e\u0437\u0438 \u0441\u0438\u043c\u0432\u043e\u043b, \u0442\u043e\u0433\u0430\u0432\u0430 \u0432\u043c\u0435\u0441\u0442\u043e \u043d\u0435\u0433\u043e \u0432\u044a\u0432\u0435\u0434\u0435\u0442\u0435 \u0442\u0443\u043a \u0438\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0441\u044a\u0441 \u0437\u0430\u043c\u0435\u0441\u0442\u0432\u0430\u043d\u0438\u044f. \u041d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, <code>myViewFileIncludes.properties</code>.</p><p>\u0422\u043e\u0437\u0438 \u0444\u0430\u0439\u043b \u0432\u043a\u043b\u044e\u0447\u0432\u0430 \u0434\u0432\u043e\u0439\u043a\u0438\u0442\u0435 \u043a\u043b\u044e\u0447\u043e\u0432\u0438 \u0441\u0442\u043e\u0439\u043d\u043e\u0441\u0442\u0438, \u043a\u043e\u0438\u0442\u043e \u0438\u0441\u043a\u0430\u0442\u0435 \u0432\u044a\u0432\u0435\u0434\u0435 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u044a\u0442 \u043a\u043e\u0433\u0430\u0442\u043e \u0441\u0435 \u0432\u044a\u0437\u043f\u0440\u043e\u0438\u0437\u0432\u0435\u0436\u0434\u0430\u0442 \u0437\u043d\u0430\u0446\u0438\u0442\u0435  <code>{INCLUDE:<i>key</i>}</code> \u0432\u044a\u0432 \u0432\u0430\u0448\u0435\u0442\u043e \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b.  \u0410\u043a\u043e \u043d\u0435 \u0432\u044a\u0432\u0435\u0434\u0435\u0442\u0435 \u0438\u043c\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b, \u0442\u043e\u0433\u0430\u0432\u0430 \u0441\u0435 \u043f\u0440\u0438\u0435\u043c\u0430 \u0444\u0430\u0439\u043b \u0441 \u0438\u043c\u0435\u0442\u043e <code>html_viewer_includes.properties</code>.</p><p>\u0424\u0430\u0439\u043b\u044a\u0442 \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0441\u044a\u0449\u0435\u0441\u0442\u0432\u0443\u0432\u0430 \u0432\u044a\u0432 \u0432\u0441\u0435\u043a\u0438 \u0441\u044a\u0440\u0432\u044a\u0440 \u043d\u0430 \u043f\u043e\u0440\u0442\u043b\u0435\u0442 \u0432 \u0442\u043e\u0437\u0438 \u043a\u043b\u044a\u0441\u0442\u0435\u0440, \u0432 \u043f\u0430\u043f\u043a\u0430 \u043d\u0430 \u043f\u044a\u0442\u044f \u043a\u044a\u043c \u043a\u043b\u0430\u0441\u043e\u0432\u0435\u0442\u0435 (\u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, \u0432\u0430\u0448\u0430\u0442\u0430 \u043f\u0430\u043f\u043a\u0430 "\u043e\u0431\u0449\u0438 \u0440\u0435\u0441\u0443\u0440\u0441\u0438"). \u0410\u043a\u043e \u0438\u0437\u043f\u043e\u043b\u0437\u0432\u0430\u0442\u0435 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430, \u0438\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0441\u044a\u0441 \u0437\u0430\u043c\u0435\u0441\u0442\u0432\u0430\u043d\u0438\u044f \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0437\u0430\u043f\u043e\u0447\u0432\u0430 \u0441 \u043f\u044a\u0442 \u043d\u0430 \u043f\u043e\u0434\u043f\u0430\u043f\u043a\u0430.</p><p>\u041c\u043e\u043b\u044f \u043e\u0431\u044a\u0440\u043d\u0435\u0442\u0435 \u0441\u0435 \u0437\u0430 \u043f\u043e\u0432\u0435\u0447\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043a\u044a\u043c \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430\u0446\u0438\u044f\u0442\u0430 \u0437\u0430 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0438\u0440\u0430\u043d\u0435.</p>
config.launchbuttonless=\u041e\u0442\u0432\u043e\u0440\u0435\u0442\u0435 \u043b\u0438\u043d\u043a\u043e\u0432\u0435\u0442\u0435 \u0432 <contextual_help>\u043d\u043e\u0432 \u043f\u0440\u043e\u0437\u043e\u0440\u0435\u0446 \u0431\u0435\u0437 \u0431\u0443\u0442\u043e\u043d\u0438</contextual_help>?
config.launchbuttonless.help.title=\u041e\u0442\u0432a\u0440\u044f\u043d\u0435\u0442\u043e \u0432\u043e\u0434\u0438 \u0432 \u043d\u043e\u0432 \u043f\u0440\u043e\u0437\u043e\u0440\u0435\u0446 \u0431\u0435\u0437 \u0431\u0443\u0442\u043e\u043d\u0438
config.launchbuttonless.help.content=\u0410\u043a\u043e \u043e\u0442\u043c\u0435\u0442\u043d\u0435\u0442\u0435 \u0442\u0430\u0437\u0438 \u043e\u043f\u0446\u0438\u044f, \u0432\u0441\u0438\u0447\u043a\u0438 \u0445\u0438\u043f\u0435\u0440\u043b\u0438\u043d\u043a\u043e\u0432\u0435 \u0432 \u043f\u043e\u043a\u0430\u0437\u0432\u0430\u043d\u043e\u0442\u043e \u043e\u0442 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u0430 \u0441\u044a\u0434\u044a\u0440\u0436\u0430\u043d\u0438\u0435 \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u0449\u0435 \u0441\u0435 \u043e\u0442\u0432\u043e\u0440\u044f\u0442 \u0432 \u043d\u043e\u0432 \u0434\u044a\u0449\u0435\u0440\u0435\u043d \u043f\u0440\u043e\u0437\u043e\u0440\u0435\u0446 \u0431\u0435\u0437 \u0431\u0443\u0442\u043e\u043d\u0438.  \u0410\u043a\u043e \u043d\u0435 \u043e\u0442\u043c\u0435\u0442\u043d\u0435\u0442\u0435 \u0442\u0430\u0437\u0438 \u043e\u043f\u0446\u0438\u044f, \u0442\u0435 \u0449\u0435 \u0441\u0435 \u043e\u0442\u0432\u043e\u0440\u044f\u0442 \u0432 \u0442\u0435\u043a\u0443\u0449\u0438\u044f \u043f\u0440\u043e\u0437\u043e\u0440\u0435\u0446.  \u041c\u043e\u043b\u044f \u043e\u0431\u044a\u0440\u043d\u0435\u0442\u0435 \u0441\u0435 \u0437\u0430 \u043f\u043e\u0432\u0435\u0447\u0435 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043a\u044a\u043c \u0434\u043e\u043a\u0443\u043c\u0435\u043d\u0442\u0430 \u0437\u0430 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0438\u0440\u0430\u043d\u0435.
config.checkseconds.text1=<contextual_help>\u0412\u0440\u0435\u043c\u0435 \u043d\u0430 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435:</contextual_help>
config.checkseconds.text2=\u0441\u0435\u043a\u0443\u043d\u0434\u0438
config.checkseconds.help.title=\u041a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0438\u0440\u0430\u043d\u0435 \u043d\u0430 \u0432\u0440\u0435\u043c\u0435\u0442\u043e \u043d\u0430 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435
config.checkseconds.help.content=<p>\u0427\u0440\u0435\u0437 \u0442\u0430\u0437\u0438 \u043e\u043f\u0446\u0438\u044f \u043c\u043e\u0436\u0435\u0442\u0435 \u0434\u0430 \u0437\u0430\u0434\u0430\u0432\u0430\u0442\u0435 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435 \u043d\u0430 \u0433\u043e\u0440\u043d\u0438\u0442\u0435 \u0434\u0430\u043d\u043d\u0438 \u043e\u0442 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u0430 \u0437\u0430 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d\u043e \u0432\u0440\u0435\u043c\u0435. \u0417\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435\u0442\u043e \u0449\u0435 \u0432\u043a\u043b\u044e\u0447\u0432\u0430 \u043e\u043f\u0446\u0438\u0438\u0442\u0435 \u043d\u0430 \u0433\u043e\u0440\u043d\u0430\u0442\u0430 \u043a\u043e\u043d\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044f, \u0430 \u0442\u0430\u043a\u0430 \u0441\u044a\u0449\u043e \u0441\u044a\u0434\u044a\u0440\u0436\u0430\u043d\u0438\u0435\u0442\u043e \u043d\u0430 \u0438\u0437\u043e\u0431\u0440\u0430\u0436\u0435\u043d\u0438\u0435\u0442\u043e \u0438 \u0444\u0430\u0439\u043b\u043e\u0432\u0435\u0442\u0435 \u0441 \u0446\u0438\u0442\u0438\u0440\u0430\u043d\u0438\u0442\u0435 \u043f\u043e-\u0433\u043e\u0440\u0435 \u0438\u043c\u0435\u043d\u0430. \u0422\u043e\u0432\u0430 \u043c\u043e\u0436\u0435 \u0434\u0430 \u043f\u043e\u0432\u0438\u0448\u0438 \u043f\u0440\u043e\u0438\u0437\u0432\u043e\u0434\u0438\u0442\u0435\u043b\u043d\u043e\u0441\u0442\u0442\u0430 \u043d\u0430 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u0430 \u043f\u0440\u0438 \u0433\u043e\u043b\u044f\u043c\u043e \u043d\u0430\u0442\u043e\u0432\u0430\u0440\u0432\u0430\u043d\u0435.</p><p>\u0417\u0430 \u0434\u0430 \u0440\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u0435 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435 \u0437\u0430 \u043e\u043f\u0440\u0435\u0434\u0435\u043b\u0435\u043d \u0431\u0440\u043e\u0439 \u0441\u0435\u043a\u0443\u043d\u0434\u0438, \u0432\u044a\u0432\u0435\u0434\u0435\u0442\u0435 \u0447\u0438\u0441\u043b\u043e - \u043d\u0430\u043f\u0440\u0438\u043c\u0435\u0440, <code>900</code> \u0437\u0430 15 \u043c\u0438\u043d\u0443\u0442\u0438. \u0417\u0430 \u0434\u0430 \u0440\u0430\u0437\u0440\u0435\u0448\u0438\u0442\u0435 \u0431\u0435\u0437\u0441\u0440\u043e\u0447\u043d\u043e \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435, \u0432\u044a\u0432\u0435\u0434\u0435\u0442\u0435 <code>-1</code>. \u0417\u0430 \u0434\u0430 \u0437\u0430\u0431\u0440\u0430\u043d\u0438\u0442\u0435 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435\u0442\u043e, \u0432\u044a\u0432\u0435\u0434\u0435\u0442\u0435 <code>0</code> \u0438\u043b\u0438 \u043e\u0441\u0442\u0430\u0432\u0435\u0442\u0435 \u043e\u043f\u0446\u0438\u044f\u0442\u0430 \u043f\u0440\u0430\u0437\u043d\u0430.</p><p>\u0412\u044a\u0432 \u0432\u0441\u0435\u043a\u0438 \u0441\u043b\u0443\u0447\u0430\u0439, \u043a\u043e\u0433\u0430\u0442\u043e \u043a\u043b\u0438\u043a\u0432\u0430\u0442\u0435 \u0432\u044a\u0440\u0445\u0443 <b>Save</b> \u043d\u0430 \u0442\u0430\u0437\u0438 \u0441\u0442\u0440\u0430\u043d\u0438\u0446\u0430, \u0442\u0435\u043a\u0443\u0449\u0430\u0442\u0430 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u0435\u043d\u0430 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u0449\u0435 \u0441\u0435 \u0438\u0437\u0447\u0438\u0441\u0442\u0432\u0430. \u041f\u043e\u0440\u0430\u0434\u0438 \u0442\u043e\u0432\u0430, \u043f\u0440\u043e\u043c\u0435\u043d\u0438\u0442\u0435, \u043a\u043e\u0438\u0442\u043e \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u0442\u0435 \u0442\u0443\u043a, \u0449\u0435 \u043e\u043a\u0430\u0437\u0432\u0430\u0442 \u043d\u0435\u0437\u0430\u0431\u0430\u0432\u043d\u043e \u0432\u044a\u0437\u0434\u0435\u0439\u0441\u0442\u0432\u0438\u0435. \u0417\u0430\u043f\u0430\u043c\u0435\u0442\u0435\u043d\u0430\u0442\u0430 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u0441\u0435 \u0438\u0437\u0447\u0438\u0441\u0442\u0432\u0430 \u0441\u044a\u0449\u043e, \u043a\u043e\u0433\u0430\u0442\u043e \u0440\u0435\u0441\u0442\u0430\u0440\u0442\u0438\u0440\u0430\u0442\u0435 \u043f\u043e\u0440\u0442\u043b\u0435\u0442\u0430.</p>
config.okbutton=\u0417\u0430\u043f\u0438\u0441
info.saved=\u0412\u0430\u0448\u0438\u0442\u0435 \u043f\u0440\u043e\u043c\u0435\u043d\u0438 \u0441\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u0438.

# messages for view mode 
# (none)

# messages for error handling
error.code=(\u0413\u0440\u0435\u0448\u043a\u0430: {0})
error.message=\u0413\u0440\u0435\u0448\u043a\u0430:
error.input=\u041d\u0430\u043b\u0438\u0446\u0435 \u0435 \u043f\u0440\u043e\u0431\u043b\u0435\u043c \u0441 \u0432\u044a\u0432\u0435\u0434\u0435\u043d\u0438\u0442\u0435 \u043e\u0442 \u0432\u0430\u0441 \u0434\u0430\u043d\u043d\u0438.
error.internal=\u0417\u0430\u044f\u0432\u0435\u043d\u0430\u0442\u0430 \u043e\u0442 \u0432\u0430\u0441 \u0443\u0441\u043b\u0443\u0433\u0430 \u0438\u043b\u0438 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043d\u0435 \u0435 \u0434\u043e\u0441\u0442\u044a\u043f\u043d\u0430 \u0432 \u043c\u043e\u043c\u0435\u043d\u0442\u0430. \u041c\u043e\u043b\u044f, \u043e\u043f\u0438\u0442\u0430\u0439\u0442\u0435 \u043e\u0442\u043d\u043e\u0432\u043e \u043f\u043e-\u043a\u044a\u0441\u043d\u043e.
error.nullFile=\u0417\u0430\u044f\u0432\u0435\u043d\u0430\u0442\u0430 \u043e\u0442 \u0432\u0430\u0441 \u0443\u0441\u043b\u0443\u0433\u0430 \u0438\u043b\u0438 \u0438\u043d\u0444\u043e\u0440\u043c\u0430\u0446\u0438\u044f \u043d\u0435 \u0435 \u0434\u043e\u0441\u0442\u044a\u043f\u043d\u0430 \u0432 \u043c\u043e\u043c\u0435\u043d\u0442\u0430.  \u041c\u043e\u043b\u044f, \u043e\u043f\u0438\u0442\u0430\u0439\u0442\u0435 \u043e\u0442\u043d\u043e\u0432\u043e \u043f\u043e-\u043a\u044a\u0441\u043d\u043e.
error.nullFilename=\u0418\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u043f\u0440\u0430\u0437\u043d\u043e.  \u041c\u043e\u043b\u044f \u043a\u043e\u0440\u0438\u0433\u0438\u0440\u0430\u0439\u0442\u0435 \u0433\u043e \u043f\u043e-\u0434\u043e\u043b\u0443.
error.pathInFilename=\u0418\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u044a\u0434\u044a\u0440\u0436\u0430 \u043f\u044a\u0442 \u043d\u0430 \u0441\u0442\u0430\u0440\u0448\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f (\u0442.\u0435., <code>..</code> \u043e\u0442\u043f\u0440\u0430\u0432\u043a\u0430).  \u041c\u043e\u043b\u044f \u043a\u043e\u0440\u0438\u0433\u0438\u0440\u0430\u0439\u0442\u0435 \u0433\u043e \u043f\u043e-\u0434\u043e\u043b\u0443.
error.pathInSubsFilename=\u0418\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0441\u044a\u0441 \u0437\u0430\u043c\u0435\u0441\u0442\u0432\u0430\u043d\u0438\u044f \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0441\u044a\u0434\u044a\u0440\u0436\u0430 \u043f\u044a\u0442 \u043d\u0430 \u0441\u0442\u0430\u0440\u0448\u0430 \u0434\u0438\u0440\u0435\u043a\u0442\u043e\u0440\u0438\u044f (\u0442.\u0435., <code>..</code> \u043e\u0442\u043f\u0440\u0430\u0432\u043a\u0430).  \u041c\u043e\u043b\u044f \u043a\u043e\u0440\u0438\u0433\u0438\u0440\u0430\u0439\u0442\u0435 \u0433\u043e \u043f\u043e-\u0434\u043e\u043b\u0443.
error.checkSecondsValue=\u0412\u0440\u0435\u043c\u0435\u0442\u043e \u043d\u0430 \u0437\u0430\u043f\u0430\u043c\u0435\u0442\u044f\u0432\u0430\u043d\u0435 \u0442\u0440\u044f\u0431\u0432\u0430 \u0434\u0430 \u0431\u044a\u0434\u0435 \u0446\u044f\u043b\u043e \u0447\u0438\u0441\u043b\u043e \u0441\u0435\u043a\u0443\u043d\u0434\u0438.  \u041c\u043e\u043b\u044f \u043a\u043e\u0440\u0438\u0433\u0438\u0440\u0430\u0439\u0442\u0435 \u0433\u043e \u043f\u043e-\u0434\u043e\u043b\u0443.
error.notSaved=\u0412\u0430\u0448\u0438\u0442\u0435 \u043f\u0440\u043e\u043c\u0435\u043d\u0438 \u043d\u0435 \u0441\u0430 \u0437\u0430\u043f\u0438\u0441\u0430\u043d\u0438.
#
warn.message=\u041f\u0440\u0435\u0434\u0443\u043f\u0440\u0435\u0436\u0434\u0435\u043d\u0438\u0435:
warn.nullFile=\u0418\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0437\u0430 \u0440\u0430\u0437\u0433\u043b\u0435\u0436\u0434\u0430\u043d\u0435 \u043f\u043e-\u0434\u043e\u043b\u0443 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u043d\u0430\u043c\u0435\u0440\u0435\u043d\u043e \u0438\u043b\u0438 \u043f\u0440\u043e\u0447\u0435\u0442\u0435\u043d\u043e.  \u0421\u044a\u0437\u0434\u0430\u0434\u043e\u0445\u0442\u0435 \u0438 \u0438\u043d\u0441\u0442\u0430\u043b\u0438\u0440\u0430\u0439\u0445\u0435 \u043b\u0438 \u0433\u043e \u0432\u0435\u0447\u0435?
warn.nullSubsFile=\u0418\u043c\u0435\u0442\u043e \u043d\u0430 \u0444\u0430\u0439\u043b\u0430 \u0441\u044a\u0441 \u0437\u0430\u043c\u0435\u0441\u0442\u0432\u0430\u043d\u0438\u044f \u043f\u043e-\u0434\u043e\u043b\u0443 \u043d\u0435 \u043c\u043e\u0436\u0435 \u0434\u0430 \u0431\u044a\u0434\u0435 \u043d\u0430\u043c\u0435\u0440\u0435\u043d\u043e \u0438\u043b\u0438 \u043f\u0440\u043e\u0447\u0435\u0442\u0435\u043d\u043e.  \u0421\u044a\u0437\u0434\u0430\u0434\u043e\u0445\u0442\u0435 \u0438 \u0438\u043d\u0441\u0442\u0430\u043b\u0438\u0440\u0430\u0439\u0445\u0435 \u043b\u0438 \u0433\u043e \u0432\u0435\u0447\u0435?
