# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Archivo de visualizaci\u00f3n:
config.viewfilename.help.title=Configuraci\u00f3n de un archivo de visualizaci\u00f3n
config.viewfilename.help.content=<p>Escriba el nombre base (incluida la extensi\u00f3n) del archivo de visualizaci\u00f3n.  Por ejemplo, <code>myViewFile.html</code>.</p><p>Este archivo incluye el contenido que quiere que muestre el portlet y debe existir.  Este archivo debe existir en cada servidor de portlets de este cluster, en la carpeta del conjunto de recursos de portlets o en una de sus subcarpetas.  (Como alternativa, el archivo puede encontrarse en la carpeta ra\u00edz o en una de sus subcarpetas dentro del propio portlet WAR).  Si utiliza una subcarpeta, el nombre del archivo de visualizaci\u00f3n deber\u00e1 incluir la ruta de esa subcarpeta.  Por ejemplo, <code>myFiles/myViewFile.html</code>.</p><p>El contenido del archivo deber\u00e1 localizarse para la configuraci\u00f3n regional y de idioma b\u00e1sica.  Si ha traducido el contenido, los archivos de visualizaci\u00f3n traducidos deber\u00e1n acompa\u00f1ar al archivo de visualizaci\u00f3n b\u00e1sico en la misma ubicaci\u00f3n y llevar la etiqueta del lugar correspondiente.</p><p>Para obtener m\u00e1s informaci\u00f3n, consulte el documento de administraci\u00f3n.</p>
config.subsfilename=<contextual_help>Archivo de inclusi\u00f3n</contextual_help> opcional:
config.subsfilename.help.title=Configuraci\u00f3n de un archivo de inclusi\u00f3n
config.subsfilename.help.content=<p>A no ser que el archivo de visualizaci\u00f3n utilice el token <code>{INCLUDE:<i>key</i>}</code>, puede dejar esto en blanco.</p><p>Si el archivo de visualizaci\u00f3n utiliza realmente ese token, introduzca aqu\u00ed el nombre del archivo de inclusi\u00f3n pertinente. Por ejemplo, <code>myViewFileIncludes.properties</code>.</p><p>Este archivo contiene los pares clave-valor que quiere que el portlet inserte al generar los tokens <code>{INCLUDE:<i>key</i>}</code> en el archivo de visualizaci\u00f3n.  Si no introduce un nombre de archivo, se tomar\u00e1 por supuesto un archivo llamado <code>html_viewer_includes.properties</code>.</p><p>Este archivo debe existir en cada servidor de portlet de este cl\u00faster, en una carpeta de la ruta de clase (por ejemplo, su carpeta de "recursos globales"), en la carpeta del conjunto de recursos de portlets, o bien en el propio portlet WAR. Si utiliza una subcarpeta, el archivo de inclusi\u00f3n debe comenzar con la ruta de esa subcarpeta.</p><p>Consulte la documentaci\u00f3n de administraci\u00f3n para obtener m\u00e1s informaci\u00f3n.</p>
config.launchbuttonless=\u00bfAbrir los v\u00ednculos de <contextual_help>nueva ventana sin botones</contextual_help>?
config.launchbuttonless.help.title=Apertura de v\u00ednculos en una nueva ventana sin botones
config.launchbuttonless.help.content=Si marca esta opci\u00f3n, todos los hiperv\u00ednculos del contenido del archivo de visualizaci\u00f3n mostrados por el portlet se abrir\u00e1n en una nueva ventana secundaria sin botones.  Si no marca esta opci\u00f3n, se abrir\u00e1n en la ventana actual.  Consulte el documento de administraci\u00f3n para obtener m\u00e1s informaci\u00f3n:
config.checkseconds.text1=<contextual_help>Duraci\u00f3n de la cach\u00e9:</contextual_help>
config.checkseconds.text2=segundos
config.checkseconds.help.title=Configuraci\u00f3n de la duraci\u00f3n de la cach\u00e9
config.checkseconds.help.content=<p>Con esta opci\u00f3n puede especificar que el portlet almacene los datos anteriores en la cach\u00e9 durante un periodo de tiempo determinado. La cach\u00e9 incluir\u00e1 las opciones de configuraci\u00f3n anteriores, adem\u00e1s del contenido de la visualizaci\u00f3n y los archivos de inclusi\u00f3n antes mencionados. Esto puede mejorar el rendimiento del portlet durante una sobrecarga.</p><p>Para activar el almacenamiento en cach\u00e9 durante un n\u00famero de segundos determinado, introduzca el n\u00famero en cuesti\u00f3n: por ejemplo <code>900</code> para 15 minutos. Para activar el almacenamiento en cach\u00e9 indefinido, introduzca <code>-1</code>. Para desactivar el almacenamiento en cach\u00e9, introduzca <code>0</code> o deje esta opci\u00f3n en blanco.</p><p>En cualquier caso, al hacer clic en <b>Guardar</b> en esta p\u00e1gina, la cach\u00e9 existente se borrar\u00e1. En consecuencia, los cambios que guarde aqu\u00ed tendr\u00e1n un efecto inmediato. La cach\u00e9 tambi\u00e9n se borrar\u00e1 al reiniciar el portlet.</p>
config.okbutton=Salvar
info.saved=Se han guardado sus cambios.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Error: {0})
error.message=Aparece el mensaje de Error:
error.input=Hay un problema con los datos que ha introducido.
error.internal=El servicio o la informaci\u00f3n solicitada no est\u00e1 disponible en este momento. Vuelva a intentarlo m\u00e1s tarde.
error.nullFile=El servicio o la informaci\u00f3n solicitada no est\u00e1 disponible en este momento.  Vuelva a intentarlo m\u00e1s tarde.
error.nullFilename=El nombre del archivo de visualizaci\u00f3n no puede estar en blanco.  Corr\u00edjalo a continuaci\u00f3n.
error.pathInFilename=El nombre del archivo de visualizaci\u00f3n no puede incluir ninguna ruta de directorio principal (es decir, <code>..</code> referencia).  Corr\u00edjalo a continuaci\u00f3n.
error.pathInSubsFilename=El nombre del archivo de inclusi\u00f3n no puede contener ninguna ruta de directorio principal (es decir, <code>..</code> referencia).  Corr\u00edjalo a continuaci\u00f3n.
error.checkSecondsValue=La duraci\u00f3n de la cach\u00e9 debe ser el n\u00famero total de segundos.  Corr\u00edjalo a continuaci\u00f3n.
error.notSaved=No se han guardado sus cambios.
#
warn.message=Warning: (Advertencia)
warn.nullFile=No se encuentra ni se puede leer el archivo de visualizaci\u00f3n especificado a continuaci\u00f3n.  \u00bfLo ha creado e instalado ya?
warn.nullSubsFile=No se encuentra ni se puede leer el archivo de inclusi\u00f3n especificado a continuaci\u00f3n.  \u00bfLo ha creado e instalado ya?
