# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Anzeigedatei:
config.viewfilename.help.title=Anzeigedatei konfigurieren
config.viewfilename.help.content=<p>Geben Sie den Basisnamen (einschlie\u00dflich Erweiterung) der Anzeigedatei ein.  Beispiel: <code>myViewFile.html</code>.</p><p>Diese Datei enth\u00e4lt den Inhalt, den das Portlet anzeigen soll, und sie muss vorhanden sein.  Diese Datei muss auf jedem Portlet-Server in diesem Cluster im Ordner des Pakets f\u00fcr Portlet-Ressourcen oder in einem Unterordner dieses Ordners existieren.  (Alternativ kann die Datei im root-Ordner oder in einem Unterordner dieses Ordners in der Portlet-WAR selbst gespeichert sein.)  Wenn Sie einen Unterordner verwenden, muss der Name der Anzeigedatei diesen Unterordnerpfad enthalten.  Beispiel: <code>myFiles/myViewFile.html</code>.</p><p>Der Dateiinhalt sollte entsprechend der Basisl\u00e4ndereinstellung lokalisiert sein.  Wenn der Inhalt \u00fcbersetzt wurde, sollten die \u00fcbersetzten Anzeigedateien an derselben Position wie die Basisanzeigedatei gespeichert und mit derselben L\u00e4ndereinstellung gekennzeichnet sein.</p><p>Weitere Informationen finden Sie im Verwaltungsdokument.</p>
config.subsfilename=Optionale <contextual_help>includes-Datei</contextual_help>:
config.subsfilename.help.title=includes-Datei konfigurieren
config.subsfilename.help.content=<p>Sie brauchen dieses Feld nur auszuf\u00fcllen, wenn in Ihrer Anzeigedatei das Token <code>{INCLUDE:<i>key</i>}</code> verwendet wird.</p><p>Wird dieses Token in Ihrer Anzeigedatei verwendet, geben Sie den Namen der includes-Datei f\u00fcr dieses Token hier ein. Beispiel: <code>myViewFileIncludes.properties</code>.</p><p>Diese Datei enth\u00e4lt die Schl\u00fcssel-Wert-Paare, die das Portlet einf\u00fcgen soll, wenn die Tokens <code>{INCLUDE:<i>key</i>}</code> in Ihrer Anzeigedatei gerendert werden.  Wenn Sie keinen Dateinamen eingeben, wird der Dateiname <code>html_viewer_includes.properties</code> angenommen.</p><p>Die Datei muss auf jedem Portlet-Server in diesem Cluster in einem Ordner im Klassenpfad vorhanden sein \u2013 beispielsweise in Ihrem Ordner f\u00fcr globale Ressourcen \u2013 im Ordner des Pakets f\u00fcr Portlet-Ressourcen oder in der Portlet-WAR selbst. Wenn Sie einen Unterordner verwenden, muss der Name der includes-Datei mit diesem Unterordnerpfad beginnen.</p><p>Weitere Informationen finden Sie im Verwaltungsdokument.</p>
config.launchbuttonless=Links in einem <contextual_help>neuen Fenster ohne Schaltfl\u00e4chen</contextual_help> \u00f6ffnen?
config.launchbuttonless.help.title=Links in einem neuen Fenster ohne Schaltfl\u00e4chen \u00f6ffnen
config.launchbuttonless.help.content=Wenn Sie diese Option ausw\u00e4hlen, werden die Hyperlinks im Inhalt der vom Portlet angezeigten Datei in einem neuen untergeordneten Fenster ohne Schaltfl\u00e4chen ge\u00f6ffnet.  Wenn Sie diese Option nicht ausw\u00e4hlen, werden sie im aktuellen Fenster ge\u00f6ffnet.  Weitere Informationen enth\u00e4lt das Verwaltungsdokument.
config.checkseconds.text1=<contextual_help>Cache-Dauer:</contextual_help>
config.checkseconds.text2=Sekunden
config.checkseconds.help.title=Cache-Dauer konfigurieren
config.checkseconds.help.content=<p>Mit dieser Option k\u00f6nnen Sie angeben, dass die oben genannten Daten vom Portlet f\u00fcr eine bestimmte Zeitdauer im Cache gespeichert werden. Der Cache umfasst die oben genannten Konfigurationsoptionen sowie den Inhalt der oben genannten Anzeige- und der includes-Datei. Dadurch kann sich die Leistung eines stark ausgelasteten Portlets verbessern.</p><p>Geben Sie den entsprechenden Wert, z. B. <code>900</code> f\u00fcr 15 Minuten ein, um die Speicherung im Cache f\u00fcr die angegebene Sekundenanzahl zu aktivieren. Geben Sie <code>-1</code> ein, um eine unbegrenzte Speicherung im Cache zu aktivieren. Geben Sie <code>0</code> oder keinen Wert f\u00fcr diese Option ein, um die Speicherung im Cache zu deaktivieren.</p><p>Wenn Sie auf dieser Seite auf <b>Speichern</b> klicken, werden auf jeden Fall die Daten aus dem vorhandenen Cache entfernt. Daher werden die hier vorgenommenen \u00c4nderungen sofort wirksam. Der Cache wird auch bereinigt, wenn Sie das Portlet neu starten.</p>
config.okbutton=Speichern
info.saved=Ihre \u00c4nderungen wurden gespeichert.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Fehler: {0})
error.message=Fehler:
error.input=Problem mit den von Ihnen eingegebenen Daten.
error.internal=Der angeforderte Service oder die angeforderte Information ist derzeit nicht verf\u00fcgbar. Bitte versuchen Sie es sp\u00e4ter erneut.
error.nullFile=Der angeforderte Service oder die angeforderte Information ist derzeit nicht verf\u00fcgbar.  Bitte versuchen Sie es sp\u00e4ter erneut.
error.nullFilename=Der Name der Anzeigedatei muss angegeben werden.  Bitte unten korrigieren.
error.pathInFilename=Der Name der Anzeigedatei kann keinen Pfad f\u00fcr ein \u00fcbergeordnetes Verzeichnis enthalten (d. h. die Angabe <code>..</code>).  Bitte unten korrigieren.
error.pathInSubsFilename=Der Name der includes-Datei kann keinen Pfad f\u00fcr ein \u00fcbergeordnetes Verzeichnis enthalten (d. h. die Angabe <code>..</code>).  Bitte unten korrigieren.
error.checkSecondsValue=F\u00fcr die Cache-Dauer in Sekunden muss eine ganze Zahl eingeben werden.  Bitte unten korrigieren.
error.notSaved=Ihre \u00c4nderungen wurden nicht gespeichert.
#
warn.message=Warnung:
warn.nullFile=Die unten angegebene Anzeigedatei wurde nicht gefunden/gelesen.  Haben Sie diese schon erstellt und installiert?
warn.nullSubsFile=Die unten angegebene includes-Datei wurde nicht gefunden/gelesen.  Haben Sie diese schon erstellt und installiert?
