# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=N\u00e9zet f\u00e1jl:
config.viewfilename.help.title=N\u00e9zet f\u00e1jl konfigur\u00e1l\u00e1sa
config.viewfilename.help.content=<p>\u00cdrja be a n\u00e9zet f\u00e1jl alapnev\u00e9t (kiterjeszt\u00e9ssel egy\u00fctt).  P\u00e9ld\u00e1ul: <code>saj\u00e1tN\u00e9zetF\u00e1jl.html</code>.</p><p>Ez a f\u00e1jl tartalmazza a portlet \u00e1ltal megjelen\u00edtend\u0151 tartalmat, \u00e9s k\u00f6telez\u0151 l\u00e9trehozni.  Ennek a f\u00e1jlnak meg kell jelennie a f\u00fcrt \u00f6sszes portletkiszolg\u00e1l\u00f3j\u00e1n, a portlet er\u0151forr\u00e1sk\u00f6teg\u00e9nek <code>html</code> mapp\u00e1j\u00e1ban vagy annak egyik almapp\u00e1j\u00e1ban.  (Az is megfelel\u0151 megold\u00e1s, ha a f\u00e1jl a portlet WAR \u00e1llom\u00e1ny\u00e1n bel\u00fcl a <code>html</code> mapp\u00e1ban vagy annak almapp\u00e1j\u00e1ban m\u00e1r l\u00e9tezik.)  Almappa alkalmaz\u00e1sa eset\u00e9n a n\u00e9zet f\u00e1jl nev\u00e9nek tartalmaznia kell az adott almappa el\u00e9r\u00e9si \u00fatvonal\u00e1t.  P\u00e9ld\u00e1ul: <code>saj\u00e1tF\u00e1jlok/saj\u00e1tN\u00e9zetF\u00e1jl.html</code>.</p><p>A f\u00e1jl tartalm\u00e1t az alap nyelvi ter\u00fcletnek megfelel\u0151en honos\u00edtani kell.  A tartalom leford\u00edt\u00e1sa eset\u00e9n, a leford\u00edtott n\u00e9zet f\u00e1jlt az alap n\u00e9zet f\u00e1jllal egy\u00fctt, azonos helyen kell elhelyezni \u00e9s a nyelvi ter\u00fcletnek megfelel\u0151en kell c\u00edmk\u00e9zni.</p><p>Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.</p>
config.subsfilename=<contextual_help>Helyettes\u00edt\u0151 vez\u00e9rjeleket tartalmaz\u00f3 f\u00e1jl</contextual_help> (v\u00e1laszthat\u00f3):
config.subsfilename.help.title=Helyettes\u00edt\u0151 vez\u00e9rjeleket tartalmaz\u00f3 f\u00e1jl
config.subsfilename.help.content=<p>Amennyiben a n\u00e9zet f\u00e1jl nem haszn\u00e1lja a <code>{INCLUDE:<i>kulcs</i>}</code> tokent, akkor \u00fcresen hagyhatja.</p><p>Ha a f\u00e1jl m\u00e9gis haszn\u00e1lja a tokent, k\u00e9rj\u00fck itt adja meg a helyettes\u00edt\u0151 vez\u00e9rjeleket tartalmaz\u00f3 f\u00e1jlt. P\u00e9lda: <code>myViewFileIncludes.properties</code>.</p><p>Ebben a f\u00e1jlban tal\u00e1lhat\u00f3k azok a kulcs\u00e9rt\u00e9kp\u00e1rok, amelyeket a portletnek be kell illesztenie a n\u00e9zet f\u00e1jlban a <code>{INCLUDE:<i>kulcs</i>}</code> vez\u00e9rjelek renderel\u00e9sekor.  Ha nincs f\u00e1jln\u00e9v megadva, a szoftver a(z) <code>html_viewer_includes.properties</code> f\u00e1jlt haszn\u00e1lja.</p><p>A f\u00e1jlnak a f\u00fcrt\u00f6n bel\u00fcl minden portletszerveren fenn kell lennie a megfelel\u0151 oszt\u00e1lyel\u00e9r\u00e9si \u00fatvonalon, \u00edgy p\u00e9ld\u00e1ul a "glob\u00e1lis h\u00e1tt\u00e9ranyagok" mapp\u00e1ban. (A f\u00e1jl a portlet WAR-on bel\u00fcl a <code>/WEB-INF/classes</code> mapp\u00e1ban is lehet.) Ha almapp\u00e1t is haszn\u00e1l, akkor a behelyettes\u00edt\u0151 vez\u00e9rjeleket tartalmaz\u00f3 f\u00e1jl nev\u00e9nek erre az almapp\u00e1ra mutat\u00f3 el\u00e9r\u00e9si \u00fattal kell kezd\u0151dnie.</p><p>Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.</p>
config.launchbuttonless=Hivatkoz\u00e1sok megnyit\u00e1sa <contextual_help>gombok n\u00e9lk\u00fcli \u00faj ablakban</contextual_help>?
config.launchbuttonless.help.title=Hivatkoz\u00e1sok megnyit\u00e1sa gombok n\u00e9lk\u00fcli \u00faj ablakban
config.launchbuttonless.help.content=Ennek a lehet\u0151s\u00e9gnek a bejel\u00f6l\u00e9se eset\u00e9n a n\u00e9zet f\u00e1jlnak a portlet \u00e1ltal megjelen\u00edtett tartalm\u00e1ban szerepl\u0151 b\u00e1rmely hiperhivatkoz\u00e1s \u00faj, gombok n\u00e9lk\u00fcli ut\u00f3dablakban fog megny\u00edlni.  Ha nem jel\u00f6li be ezt a lehet\u0151s\u00e9get, a hivatkoz\u00e1sok a jelenlegi ablakban ny\u00edlnak meg.  Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.
config.okbutton=Ment\u00e9s
info.saved=M\u00f3dos\u00edt\u00e1sok elmentve.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Error: {0})
error.message=Error:
error.internal=A keresett szolg\u00e1ltat\u00e1s vagy inform\u00e1ci\u00f3 jelenleg nem \u00e9rhet\u0151 el. K\u00e9rj\u00fck, pr\u00f3b\u00e1lja meg k\u00e9s\u0151bb.
error.nullFile=A keresett szolg\u00e1ltat\u00e1s vagy inform\u00e1ci\u00f3 jelenleg nem \u00e9rhet\u0151 el.  K\u00e9rj\u00fck, pr\u00f3b\u00e1lja meg k\u00e9s\u0151bb.
error.nullFilename=A n\u00e9zet f\u00e1jl neve nem lehet \u00fcres.  K\u00e9rj\u00fck, adja meg a f\u00e1jlnevet al\u00e1bb.
error.pathInFilename=A n\u00e9zet f\u00e1jl neve nem tartalmazhat semmilyen sz\u00fcl\u0151k\u00f6nyvt\u00e1ri hivatkoz\u00e1st (pl.: <code>..</code>).  K\u00e9rj\u00fck, adja meg a f\u00e1jlnevet al\u00e1bb.
#
warn.message=Figyelmeztet\u00e9s:
warn.nullFile=Az al\u00e1bbi n\u00e9zet f\u00e1jl nem tal\u00e1lhat\u00f3.  L\u00e9trehozta \u00e9s telep\u00edtette m\u00e1r?
warn.nullSubsFile=Az al\u00e1bbi vez\u00e9rjeleket tartalmaz\u00f3 f\u00e1jl nem tal\u00e1lhat\u00f3.  L\u00e9trehozta \u00e9s telep\u00edtette m\u00e1r?
