# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Ficheiro de visualiza\u00e7\u00e3o:
config.viewfilename.help.title=Configurar um ficheiro de visualiza\u00e7\u00e3o
config.viewfilename.help.content=<p>Introduza o nome base (incluindo a extens\u00e3o) do ficheiro de visualiza\u00e7\u00e3o.  Por exemplo, <code>myViewFile.html</code>.</p><p>Este ficheiro cont\u00e9m o conte\u00fado que pretende que o portlet apresente e tem de existir.  Este ficheiro deve existir em cada servidor de portlet neste cluster, na pasta do conjunto de recursos do portlet ou numa sub-pasta.  (Em alternativa, o ficheiro pode existir na pasta raiz ou numa sub-pasta no interior do pr\u00f3prio portlet WAR.)  Se utilizar uma sub-pasta, o nome do ficheiro de visualiza\u00e7\u00e3o inclui o caminho dessa sub-pasta.  Por exemplo, <code>myFiles/myViewFile.html</code>.</p><p>O conte\u00fado do ficheiro deve estar localizado para o local base.  Se traduziu o conte\u00fado, os ficheiros de visualiza\u00e7\u00e3o traduzidos devem acompanhar o ficheiro de visualiza\u00e7\u00e3o base na mesma localiza\u00e7\u00e3o, e serem identificados com o local respectivamente.</p><p>Consulte o documento de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.</p>
config.subsfilename=<contextual_help>Ficheiro de inclus\u00e3o</contextual_help> opcional:
config.subsfilename.help.title=Configurar um ficheiro de inclus\u00e3o
config.subsfilename.help.content=<p>A menos que o ficheiro de visualiza\u00e7\u00e3o utilize o token <code>{INCLUDE:<i>key</i>}</code>, pode deixar em branco.</p><p>Se o ficheiro de visualiza\u00e7\u00e3o utilizar esse token, introduza aqui o nome do ficheiro de inclus\u00e3o desse token. Por exemplo, <code>myViewFileIncludes.properties</code>.</p><p>Este ficheiro cont\u00e9m os pares do valor-chave que pretende que o portlet introduza ao devolver os tokens <code>{INCLUDE:<i>key</i>}</code> no ficheiro de visualiza\u00e7\u00e3o.  Se n\u00e3o introduzir um nome de ficheiro, um ficheiro denominado <code>html_viewer_includes.properties</code> \u00e9 assumido.</p><p>O ficheiro deve existir em cada servidor de portlet neste cluster, numa pasta no caminho de classe (por exemplo, na pasta "recursos globais") dentro da pasta do conjunto de recursos do portlet ou no pr\u00f3prio portlet WAR. Se utilizar uma sub-pasta, o nome do ficheiro de inclus\u00e3o deve come\u00e7ar com esse caminho de sub-pasta.</p><p>Consulte a documenta\u00e7\u00e3o de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.</p>
config.launchbuttonless=Abrir as hiperliga\u00e7\u00f5es em <contextual_help>nova janela sem bot\u00f5es</contextual_help>?
config.launchbuttonless.help.title=Abrir hiperliga\u00e7\u00f5es numa nova janela sem bot\u00f5es
config.launchbuttonless.help.content=Se seleccionar esta op\u00e7\u00e3o, quaisquer hiperliga\u00e7\u00f5es no conte\u00fado do ficheiro de visualiza\u00e7\u00e3o apresentado pelo portlet ser\u00e3o abertas numa nova janela secund\u00e1ria sem bot\u00f5es.  Se n\u00e3o seleccionar esta op\u00e7\u00e3o, ser\u00e3o abertas na janela actual.  Consulte o documento de administra\u00e7\u00e3o para obter mais informa\u00e7\u00f5es.
config.checkseconds.text1=<contextual_help>Dura\u00e7\u00e3o do cache:</contextual_help>
config.checkseconds.text2=segundos
config.checkseconds.help.title=Configurar a dura\u00e7\u00e3o do cache
config.checkseconds.help.content=<p>Com esta op\u00e7\u00e3o \u00e9 poss\u00edvel especificar que os dados acima sejam colocados em cache pelo portlet durante um determinado per\u00edodo de tempo. O cache incluir\u00e1 as op\u00e7\u00f5es de configura\u00e7\u00e3o acima, assim como o conte\u00fado da visualiza\u00e7\u00e3o e os ficheiros de inclus\u00e3o referidos acima. Isto poder\u00e1 melhorar o desempenho do portlet sob carga pesada.</p><p>Para activar o cache para um determinado n\u00famero de de segundos, introduza esse n\u00famero - por exemplo, <code>900</code> para um per\u00edodo de 15 minutos. Para activar o chache permanentemente, introduza <code>-1</code>. Para desactivar o cache, introduza <code>0</code> ou deixe a op\u00e7\u00e3o em branco.</p><p>De qualquer modo, quando clica em <b>Guardar</b> nesta p\u00e1gina, o cache existente ser\u00e1 apagado. Deste modo as altera\u00e7\u00f5es que guardar aqui entrar\u00e3o imediatamente em efeito. O cache \u00e9 igualmente apagado se reiniciar o portlet.</p>
config.okbutton=Guardar
info.saved=As altera\u00e7\u00f5es foram guardadas.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Erro: {0})
error.message=Erro:
error.input=Ocorreu um problema com os dados que introduziu.
error.internal=O servi\u00e7o ou informa\u00e7\u00e3o solicitado n\u00e3o est\u00e1 dispon\u00edvel neste momento. Tente novamente mais tarde.
error.nullFile=O servi\u00e7o ou informa\u00e7\u00e3o solicitado n\u00e3o est\u00e1 dispon\u00edvel neste momento.  Tente novamente mais tarde.
error.nullFilename=O nome do ficheiro de visualiza\u00e7\u00e3o n\u00e3o pode ser em branco.  Corrija-o abaixo.
error.pathInFilename=O nome do ficheiro de visualiza\u00e7\u00e3o n\u00e3o pode ter qualquer caminho do direct\u00f3rio principal (por ex., refer\u00eancia <code>..</code>).  Corrija-o abaixo.
error.pathInSubsFilename=O nome do ficheiro de inclus\u00e3o n\u00e3o pode conter qualquer caminho do direct\u00f3rio principal (por ex., refer\u00eancia <code>..</code>).  Corrija-o abaixo.
error.checkSecondsValue=A dura\u00e7\u00e3o do cache deve ser um n\u00famero inteiro de segundos.  Corrija-o abaixo.
error.notSaved=As altera\u00e7\u00f5es n\u00e3o foram guardadas.
#
warn.message=Aviso:
warn.nullFile=N\u00e3o \u00e9 poss\u00edvel localizar nem ler o ficheiro de visualiza\u00e7\u00e3o referido abaixo.  J\u00e1 o criou e instalou?
warn.nullSubsFile=N\u00e3o \u00e9 poss\u00edvel localizar nem ler o ficheiro de inclus\u00e3o referido abaixo.  J\u00e1 o criou e instalou?
