# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=N\u00e9zet f\u00e1jl:
config.viewfilename.help.title=N\u00e9zet f\u00e1jl konfigur\u00e1l\u00e1sa
config.viewfilename.help.content=<p>\u00cdrja be a n\u00e9zet f\u00e1jl alapnev\u00e9t (kiterjeszt\u00e9ssel egy\u00fctt).  P\u00e9ld\u00e1ul: <code>saj\u00e1tN\u00e9zetF\u00e1jl.html</code>.</p><p>Ez a f\u00e1jl tartalmazza a portlet \u00e1ltal megjelen\u00edtend\u0151 tartalmat, \u00e9s k\u00f6telez\u0151 l\u00e9trehozni.  Ennek a f\u00e1jlnak meg kell jelennie a f\u00fcrt \u00f6sszes portletkiszolg\u00e1l\u00f3j\u00e1n, a portlet er\u0151forr\u00e1sk\u00f6teg (resource bundle) mapp\u00e1j\u00e1ban vagy annak egyik almapp\u00e1j\u00e1ban.  (Az is megfelel\u0151 megold\u00e1s, ha a f\u00e1jl a portlet WAR f\u00e1jlon bel\u00fcl a gy\u00f6k\u00e9rmapp\u00e1ban vagy annak almapp\u00e1j\u00e1ban m\u00e1r l\u00e9tezik.)  Almappa alkalmaz\u00e1sa eset\u00e9n a n\u00e9zet f\u00e1jl nev\u00e9nek tartalmaznia kell az adott almappa el\u00e9r\u00e9si \u00fatvonal\u00e1t.  P\u00e9ld\u00e1ul: <code>saj\u00e1tF\u00e1jlok/saj\u00e1tN\u00e9zetF\u00e1jl.html</code>.</p><p>A f\u00e1jl tartalm\u00e1t az alap nyelvi ter\u00fcletnek megfelel\u0151en honos\u00edtani kell.  A tartalom leford\u00edt\u00e1sa eset\u00e9n, a leford\u00edtott n\u00e9zet f\u00e1jlt az alap n\u00e9zet f\u00e1jllal egy\u00fctt, azonos helyen kell elhelyezni \u00e9s a nyelvi ter\u00fcletnek megfelel\u0151en kell c\u00edmk\u00e9zni.</p><p>Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.</p>
config.subsfilename=Opcion\u00e1lis <contextual_help>beszerkeszthet\u0151 f\u00e1jl</contextual_help>:
config.subsfilename.help.title=Beszerkeszthet\u0151 (includes) f\u00e1jl konfigur\u00e1l\u00e1sa
config.subsfilename.help.content=<p>Amennyiben a n\u00e9zet f\u00e1jl nem haszn\u00e1lja a <code>{INCLUDE:<i>key</i>}</code> vez\u00e9rjelet (tokent), akkor nem kell kit\u00f6lteni.</p><p>Ha a f\u00e1jl m\u00e9gis haszn\u00e1lja a vez\u00e9rjelet, akkor \u00edrja be ide a beszerkeszthet\u0151 f\u00e1jl nev\u00e9t. P\u00e9lda: <code>myViewFileIncludes.properties</code>.</p><p>Ebben a f\u00e1jlban tal\u00e1lhat\u00f3k azok a kulcs\u00e9rt\u00e9kp\u00e1rok, amelyeket a portletnek be kell illesztenie a n\u00e9zet f\u00e1jlban a <code>{INCLUDE:<i>key</i>}</code> vez\u00e9rjelek renderel\u00e9sekor.  Ha nem ad meg f\u00e1jlnevet, akkor a szoftver felt\u00e9telezi a <code>html_viewer_includes.properties</code> nev\u0171 f\u00e1jl megl\u00e9t\u00e9t.</p><p>A f\u00e1jlnak ezen a f\u00fcrt\u00f6n bel\u00fcl mindegyik portletkiszolg\u00e1l\u00f3n l\u00e9teznie kell a megfelel\u0151 oszt\u00e1lyel\u00e9r\u00e9si (classpath) \u00fatvonalon (pl. a "glob\u00e1lis er\u0151forr\u00e1sok" mapp\u00e1ban), a portlet er\u0151forr\u00e1sk\u00f6teg-mappa alatt vagy mag\u00e1ban a portlet WAR f\u00e1jlban. Ha almapp\u00e1t haszn\u00e1l, akkor a beszerkeszthet\u0151 f\u00e1jl nev\u00e9nek arra az almapp\u00e1ra mutat\u00f3 el\u00e9r\u00e9si \u00fattal kell kezd\u0151dnie.</p><p>Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.</p>
config.launchbuttonless=Hivatkoz\u00e1sok megnyit\u00e1sa <contextual_help>gombok n\u00e9lk\u00fcli \u00faj ablakban</contextual_help>?
config.launchbuttonless.help.title=Hivatkoz\u00e1sok megnyit\u00e1sa gombok n\u00e9lk\u00fcli \u00faj ablakban
config.launchbuttonless.help.content=Ennek a lehet\u0151s\u00e9gnek a bejel\u00f6l\u00e9se eset\u00e9n a n\u00e9zet f\u00e1jlnak a portlet \u00e1ltal megjelen\u00edtett tartalm\u00e1ban szerepl\u0151 b\u00e1rmely hiperhivatkoz\u00e1s \u00faj, gombok n\u00e9lk\u00fcli ut\u00f3dablakban fog megny\u00edlni.  Ha nem jel\u00f6li be ezt a lehet\u0151s\u00e9get, a hivatkoz\u00e1sok a jelenlegi ablakban ny\u00edlnak meg.  Tov\u00e1bbi inform\u00e1ci\u00f3 az adminisztr\u00e1ci\u00f3s dokumentumban tal\u00e1lhat\u00f3.
config.checkseconds.text1=<contextual_help>Gyors\u00edt\u00f3t\u00e1raz\u00e1s id\u0151tartama:</contextual_help>
config.checkseconds.text2=m\u00e1sodperc
config.checkseconds.help.title=A gyors\u00edt\u00f3t\u00e1raz\u00e1s id\u0151tartam\u00e1nak konfigur\u00e1l\u00e1sa
config.checkseconds.help.content=<p>Ezzel a be\u00e1ll\u00edt\u00e1ssal meghat\u00e1rozhat\u00f3, hogy a fenti adatokat a portlet bizonyos ideig gyors\u00edt\u00f3t\u00e1razza. A gyors\u00edt\u00f3t\u00e1r a fenti konfigur\u00e1l\u00e1si be\u00e1ll\u00edt\u00e1sokat, valamint a fent megnevezett n\u00e9zeti \u00e9s beszerkeszthet\u0151 f\u00e1jlok tartalm\u00e1t is t\u00e1rolni fogja. Nagy terhel\u00e9s eset\u00e9n ez jav\u00edthatja a portlet teljes\u00edtm\u00e9ny\u00e9t.</p><p>A gyors\u00edt\u00f3t\u00e1raz\u00e1s a k\u00edv\u00e1nt id\u0151tartam m\u00e1sodperceinek sz\u00e1m\u00e1t be\u00edrva enged\u00e9lyezhet\u0151 \u2013 p\u00e9ld\u00e1ul 15 perc id\u0151tartamhoz a <code>900</code> \u00e9rt\u00e9ket kell megadni. \u00c1lland\u00f3 gyors\u00edt\u00f3t\u00e1raz\u00e1s enged\u00e9lyez\u00e9s\u00e9hez <code>-1</code> \u00e9rt\u00e9ket \u00edrjon be. A gyors\u00edt\u00f3t\u00e1raz\u00e1s letilt\u00e1s\u00e1hoz \u00edrjon be <code>0</code> \u00e9rt\u00e9ket, vagy hagyja \u00fcresen a be\u00e1ll\u00edt\u00e1st.</p><p>Ha ezen az oldalon, b\u00e1rmelyik be\u00e1ll\u00edt\u00e1s eset\u00e9n a <b>Ment\u00e9s</b> parancsra kattint, az esetleg kor\u00e1bban m\u00e1r l\u00e9trehozott gyors\u00edt\u00f3t\u00e1r ki\u00fcr\u00edt\u00e9sre ker\u00fcl. Ez\u00e9rt az itt elmentett m\u00f3dos\u00edt\u00e1sok azonnal \u00e9rv\u00e9nyes\u00fclnek. A portlet \u00fajraind\u00edt\u00e1sa a gyors\u00edt\u00f3t\u00e1rat szint\u00e9n ki\u00fcr\u00edti.</p>
config.okbutton=Ment\u00e9s
info.saved=M\u00f3dos\u00edt\u00e1sok elmentve.

# messages for view mode 
# (none)

# messages for error handling
error.code=(Error: {0})
error.message=Error:
error.input=A be\u00edrt adatokkal kapcsolatban probl\u00e9ma mer\u00fclt fel.
error.internal=A keresett szolg\u00e1ltat\u00e1s vagy inform\u00e1ci\u00f3 jelenleg nem \u00e9rhet\u0151 el. K\u00e9rj\u00fck, pr\u00f3b\u00e1lja meg k\u00e9s\u0151bb.
error.nullFile=A keresett szolg\u00e1ltat\u00e1s vagy inform\u00e1ci\u00f3 jelenleg nem \u00e9rhet\u0151 el.  K\u00e9rj\u00fck, pr\u00f3b\u00e1lja meg k\u00e9s\u0151bb.
error.nullFilename=A n\u00e9zet f\u00e1jl neve nem lehet \u00fcres.  K\u00e9rj\u00fck, adja meg a f\u00e1jlnevet al\u00e1bb.
error.pathInFilename=A n\u00e9zet f\u00e1jl neve nem tartalmazhat semmilyen sz\u00fcl\u0151k\u00f6nyvt\u00e1ri hivatkoz\u00e1st (pl.: <code>..</code>).  K\u00e9rj\u00fck, jav\u00edtsa az al\u00e1bbi helyen.
error.pathInSubsFilename=A beszerkeszthet\u0151 f\u00e1jl neve nem tartalmazhat semmilyen sz\u00fcl\u0151k\u00f6nyvt\u00e1ri hivatkoz\u00e1st (pl.: <code>..</code>).  K\u00e9rj\u00fck, jav\u00edtsa az al\u00e1bbi helyen.
error.checkSecondsValue=A gyors\u00edt\u00f3t\u00e1raz\u00e1s m\u00e1sodpercekben kifejezett id\u0151tartam\u00e1t eg\u00e9sz sz\u00e1mokkal kell megadni.  K\u00e9rj\u00fck, jav\u00edtsa az al\u00e1bbi helyen.
error.notSaved=A megadott m\u00f3dos\u00edt\u00e1sok ment\u00e9se nem t\u00f6rt\u00e9nt meg.
#
warn.message=Figyelmeztet\u00e9s:
warn.nullFile=Az al\u00e1bbi n\u00e9zet f\u00e1jl nem tal\u00e1lhat\u00f3 vagy nem olvashat\u00f3.  L\u00e9trehozta \u00e9s telep\u00edtette m\u00e1r?
warn.nullSubsFile=Az al\u00e1bbi beszerkeszthet\u0151 f\u00e1jl nem tal\u00e1lhat\u00f3 vagy nem olvashat\u00f3.  L\u00e9trehozta \u00e9s telep\u00edtette m\u00e1r?
