# Filename: html_viewer_messages.properties
#
# Message catalog for HTMLViewer portlet.
######

# messages for config mode
config.viewfilename=Kuvafail:
config.viewfilename.help.title=Kuvafaili konfigureerimine
config.viewfilename.help.content=<p>Sisestage kuvafaili p\u00f5hinimi (sh. laiend).  N\u00e4iteks <code>myViewFile.html</code>.</p><p>Antud failis on sisu, mida kasutajaliidese komponent peab kuvama ning see peab eksisteerima.  See fail peaks olema igas selle klastri kasutajaliidese komponendiga serveris, kasutajaliidese komponendi ressursikomplekti kaustas v\u00f5i selle alamkaustas.  (Teise v\u00f5imalusena v\u00f5ib fail olla juurkaustas v\u00f5i selle alamkausta kasutajaliidese komponendis WAR).  Alamkausta kasutamisel peaks kuvafaili nimes olema selle alamkausta rada.  N\u00e4iteks <code>myFiles/myViewFile.html</code>.</p><p>Faili sisu tuleks p\u00f5hilokaadi jaoks lokaliseerida.  Sisu t\u00f5lkimise korral peaksid t\u00f5lgitud kuvafailid olema koos p\u00f5hifailidega samas asukohas ning vastavalt lokaadiga sildistatud</p><p>Lisateabe saamiseks vaadake haldusdokumenti.</p>
config.subsfilename=Valikuline <contextual_help>kaasafail</contextual_help>:
config.subsfilename.help.title=Kaasafaili konfigureerimine
config.subsfilename.help.content=<p>Kui kuvafail ei kasuta luba <code>{INCLUDE:<i>key</i>}</code>, v\u00f5ite selle v\u00e4lja t\u00fchjaks j\u00e4tta.</p><p>Kui kuvafail kasutab seda luba, sisestage siia kaasafaili nimi. N\u00e4iteks, <code>myViewFileIncludes.properties</code>.</p><p>See fail sisaldab v\u00f5tmepaare, mida kasutajaliidese komponent peaks sisestama teie kuvafaili <code>{INCLUDE:<i>key</i>}</code> lubade v\u00f5tmisel.  Kui te failinime ei sisesta, valitakse selleks fail nimega <code>html_viewer_includes.properties</code>.</p><p>See fail peaks olema igas selle klastri kasutajaliidese komponendiga serveris, klassitee kaustas (n\u00e4iteks kaustas \u00dcldised ressursid), kasutajaliidese komponendi ressursikomplekti kaustas v\u00f5i kasutajaliidese komponendis WAR. Kui kasutate alamkausta, peab kaasafaili nimi algama selle alamkausta teega. </p><p>Lisateavet leiate administreerimise abimaterjalidest.</p>
config.launchbuttonless=Linkide avamine <contextual_help>new buttonless window</contextual_help>?
config.launchbuttonless.help.title=Linkide avamine uues nuppudeta aknas
config.launchbuttonless.help.content=Selle suvandi m\u00e4rkimise korral avatakse kasutajaliidese komponendi kuvatud kuvafaili sisus asuvad mistahes h\u00fcperlingid uues nuppudeta t\u00fctaraknas.  Kui seda suvandit ei m\u00e4rgita, avanevad need praeguses aknas.  Lisateabe saamiseks vaadake haldusdokumenti.
config.checkseconds.text1=<contextual_help>Vahem\u00e4lu kestus:</contextual_help>
config.checkseconds.text2=sekundit
config.checkseconds.help.title=Vahem\u00e4lu kestuse konfigureerimine
config.checkseconds.help.content=<p>Selle suvandiga saate m\u00e4\u00e4rata, et kasutajaliidese komponent salvestab \u00fclaltoodud andmed teatud ajavahemikuks vahem\u00e4llu. Vahem\u00e4lu sisaldab eelnimetatud konfigureerimissuvandeid, samuti eelnimetatud kuva- ja kaasafailide sisu. See v\u00f5ib tugeva koormuse ajal parandada kasutajaliidese komponendi j\u00f5udlust.</p><p>Vahem\u00e4llu salvestamise lubamiseks teatud ajaks sisestage sekundite arv: n\u00e4iteks 15 minuti puhul <code>900</code>. Vahem\u00e4llu salvestamise alaliseks lubamiseks sisestage <code>-1</code>. Vahem\u00e4llu salvestamise v\u00e4ljal\u00fclitamiseks sisestage <code>0</code> v\u00f5i j\u00e4tke v\u00e4li t\u00fchjaks.</p><p>Kui te kl\u00f5psate sellel lehel k\u00e4sul <b>Salvesta</b>, t\u00fchjendatakse olemasolev vahem\u00e4lu igal juhul. Seet\u00f5ttu j\u00f5ustuvad siin salvestatud muudatused koheselt. Vahem\u00e4lu t\u00fchjendatakse ka kasutajaliidese komponendi taask\u00e4ivitamisel.</p>
config.okbutton=Salvesta
info.saved=Muudatused salvestati.

# messages for view mode 
# (none)

# messages for error handling
error.code=(T\u00f5rge: {0})
error.message=T\u00f5rge:
error.input=Sisestatud andmetega tekkis t\u00f5rge.
error.internal=Soovitud teenus v\u00f5i teave pole praegu saadaval. Palun proovige hiljem uuesti.
error.nullFile=Soovitud teenus v\u00f5i teave pole praegu saadaval.  Palun proovige hiljem uuesti.
error.nullFilename=Kuvafaili nimi ei tohi j\u00e4\u00e4da t\u00fchjaks.  Palun parandage see alloleval v\u00e4ljal.
error.pathInFilename=Kuvafaili nimi ei tohi sisaldada emakataloogi rada (st. <code>..</code> reference).  Palun parandage see alloleval v\u00e4ljal.
error.pathInSubsFilename=Kaasafaili nimi ei tohi sisaldada emakataloogi teed (s.t <code>..</code> reference).  Palun parandage see alloleval v\u00e4ljal.
error.checkSecondsValue=Vahem\u00e4lu kestus peab olema t\u00e4isarv sekundeid.  Palun parandage see alloleval v\u00e4ljal.
error.notSaved=Teie muudatusi ei salvestatud.
#
warn.message=Hoiatus:
warn.nullFile=Allpool nimetatud kuvafaili ei \u00f5nnestu leida v\u00f5i lugeda.  Kas see on juba koostatud ja installitud?
warn.nullSubsFile=Allpool nimetatud kaasafaili ei \u00f5nnestu leida v\u00f5i lugeda.  Kas see on juba koostatud ja installitud?
